package model_test

import (
	"strings"
	"testing"

	"github.com/godcong/fate/debug"
	"github.com/godcong/fate/model"
)

//byList
//一、吉祥数：    	1 、3、5、7、8、11、13、15、16、18、21、23、24、25、31、32、33、35、37、39、41、45、47、48、52、57、61、63、65、67、68、81
//二、次吉数：    	6 、17、26、27、29、30、38、49、51、55、58、71、73、75
//三、凶数：      	2、4、9、10、12、14、19、20、22、28、34、36、40、42、43、44、46、50、53、54、56、59、60、62、64、66、69、70、72、74、76、77、78、79、80
//四、首领数：    	3、13、16、21、23、29、31、37、39、41、45、47
//五、财富数：    	15 、16、24、29、32、33、41、52
//六、才能数：		13 、14、18、26、29、33、35、38、48
//七、女德数：		5、6、11、13、15、16、24、32、35
//八、女性孤寡数：	21 、23、26、28、29、33、39
//九、孤独数：     	4、10、12、14、22、28、34
//十、双妻运数：    	5 、6、15、16、32、39、41
//十一、刚情运数：    7 、17、18、25、27、28、37、47
//十二、温和数：    	5 、6、11、15、16、24、31、32、35
var byList = []string{
	"第1数暗示意义为：|太极之数|太极之数，万物开泰，生发无穷，利禄亨通。|吉|",
	"第2数暗示意义为：|两仪之数|两仪之数，混沌未开，进退保守，志望难达。|凶|",
	"第3数暗示意义为：|三才之数|三才之数，天地人和，大事大业，繁荣昌隆。|吉|",
	"第4数暗示意义为：|四象之数|四象之数，待于生发，万事慎重，不具营谋。|凶|",
	"第5数暗示意义为：|五行之数|五行俱权，循环相生，圆通畅达，福祉无穷。|吉|",
	"第6数暗示意义为：|六爻之数|六爻之数，发展变化，天赋美德，吉祥安泰。|吉|",
	"第7数暗示意义为：|七政之数|七政之数，精悍严谨，天赋之力，吉星照耀。|吉|",
	"第8数暗示意义为：|八卦之数|八卦之数，乾坎艮震，巽离坤兑，无穷无尽。|半吉|",
	"第9数暗示意义为：|大成之数|大成之数，蕴涵凶险，或成或败，难以把握。|凶|",
	"第10数暗示意义为：|终结之数|终结之数，雪暗飘零，偶或有成，回顾茫然。|凶|",
	"第11数暗示意义为：|旱苗逢雨|万物更新，调顺发达，恢弘泽世，繁荣富贵。|吉|",
	"第12数暗示意义为：|掘井无泉|无理之数，发展薄弱，虽生不足，难酬志向。|凶|",
	"第13数暗示意义为：|春日牡丹|才艺多能，智谋奇略，忍柔当事，鸣奏大功。|吉|",
	"第14数暗示意义为：|破兆|家庭缘薄，孤独遭难，谋事不达，悲惨不测。|凶|",
	"第15数暗示意义为：|福寿|福寿圆满，富贵荣誉，涵养雅量，德高望重。|吉|",
	"第16数暗示意义为：|厚重|厚重载德，安富尊荣，财官双美，功成名就。|吉|",
	"第17数暗示意义为：|刚强|权威刚强，突破万难，如能容忍，必获成功。|半吉|",
	"第18数暗示意义为：|铁镜重磨|权威显达，博得名利，且养柔德，功成名就。|半吉|",
	"第19数暗示意义为：|多难|风云蔽日，辛苦重来，虽有智谋，万事挫折。|凶|",
	"第20数暗示意义为：|屋下藏金|非业破运，灾难重重，进退维谷，万事难成。|凶|",
	"第21数暗示意义为：|明月中天|光风霁月，万物确立，官运亨通，大搏名利。女性不宜此数。|吉|",
	"第22数暗示意义为：|秋草逢霜|秋草逢霜，困难疾弱，虽出豪杰，人生波折。|凶|",
	"第23数暗示意义为：|壮丽|旭日东升，壮丽壮观，权威旺盛，功名荣达。女性不宜此数。|吉|",
	"第24数暗示意义为：|掘藏得金|家门余庆，金钱丰盈，白手成家，财源广进。|吉|",
	"第25数暗示意义为：|荣俊|资性英敏，才能奇特，克服傲慢，尚可成功。|半吉|",
	"第26数暗示意义为：|变怪|变怪之谜，英雄豪杰，波澜重叠，而奏大功。|凶|",
	"第27数暗示意义为：|增长|欲望无止，自我强烈，多受毁谤，尚可成功。|凶|",
	"第28数暗示意义为：|阔水浮萍|遭难之数，豪杰气概，四海漂泊，终世浮躁。女性不宜此数。|凶|",
	"第29数暗示意义为：|智谋|智谋优秀，财力归集，名闻海内，成就大业。|吉|",
	"第30数暗示意义为：|非运|沉浮不定，凶吉难变，若明若暗，大成大败。|半吉|",
	"第31数暗示意义为：|春日花开|智勇得志，博得名利，统领众人，繁荣富贵。|吉|",
	"第32数暗示意义为：|宝马金鞍|侥幸多望，贵人得助，财帛如裕，繁荣至上。|吉|",
	"第33数暗示意义为：|旭日升天|旭日升天，鸾凤相会，名闻天下，隆昌至极。女性不宜此数。|吉|",
	"第34数暗示意义为：|破家|破家之身，见识短小，辛苦遭逢，灾祸至极。|凶|",
	"第35数暗示意义为：|高楼望月|温和平静，智达通畅，文昌技艺，奏功洋洋。|吉|",
	"第36数暗示意义为：|波澜重叠|波澜重叠，沉浮万状，侠肝义胆，舍己成仁。|半吉|",
	"第37数暗示意义为：|猛虎出林|权威显达，热诚忠信，宜着雅量，终身荣富。|吉|",
	"第38数暗示意义为：|磨铁成针|意志薄弱，刻意经营，才识不凡，技艺有成。|半吉|",
	"第39数暗示意义为：|富贵荣华|富贵荣华，财帛丰盈，暗藏险象，德泽四方。|半吉|",
	"第40数暗示意义为：|退安|智谋胆力，冒险投机，沉浮不定，退保平安。|凶|",
	"第41数暗示意义为：|有德|纯阳独秀，德高望重，和顺畅达，博得名利。此数为最大好运数。|吉|",
	"第42数暗示意义为：|寒蝉在柳|博识多能，精通世情，如能专心，尚可成功。|凶|",
	"第43数暗示意义为：|散财破产|散财破产，诸事不遂，虽有智谋，财来财去。|凶|",
	"第44数暗示意义为：|烦闷|破家亡身，暗藏惨淡，事不如意，乱世怪杰。|凶|",
	"第45数暗示意义为：|顺风|新生泰和，顺风扬帆，智谋经纬，富贵繁荣。|吉|",
	"第46数暗示意义为：|浪里淘金|载宝沉舟，浪里淘金，大难尝尽，大功有成。|凶|",
	"第47数暗示意义为：|点石成金|花开之象，万事如意，祯祥吉庆，天赋幸福。|吉|",
	"第48数暗示意义为：|古松立鹤|智谋兼备，德量荣达，威望成师，洋洋大观。|吉|",
	"第49数暗示意义为：|转变|吉临则吉，凶来则凶，转凶为吉，配好三才。|半吉|",
	"第50数暗示意义为：|小舟入海|一成一败，吉凶参半，先得庇荫，后遭凄惨。|半吉|",
	"第51数暗示意义为：|沉浮|盛衰交加，波澜重叠，如能慎始，必获成功。|半吉|",
	"第52数暗示意义为：|达眼|卓识达眼，先见之明，智谋超群，名利双收。|吉|",
	"第53数暗示意义为：|曲卷难星|外祥内患，外祸内安，先富后贫，先贫后富。|凶|",
	"第54数暗示意义为：|石上栽花|石上栽花，难得有活，忧闷烦来，辛惨不绝。|凶|",
	"第55数暗示意义为：|善恶|善善得恶，恶恶得善，吉到极限，反生凶险。|半吉|",
	"第56数暗示意义为：|浪里行舟|历尽艰辛，四周障碍，万事龃龌，做事难成。|凶|",
	"第57数暗示意义为：|日照春松|寒雪青松，夜莺吟春，必遭一过，繁荣白事。|吉|",
	"第58数暗示意义为：|晚行遇月|沉浮多端，先苦后甜，宽宏扬名，富贵繁荣。|半吉|",
	"第59数暗示意义为：|寒蝉悲风|寒蝉悲风，意志衰退，缺乏忍耐，苦难不休。|凶|",
	"第60数暗示意义为：|无谋|无谋之人，漂泊不定，晦暝暗黑，动摇不安。|凶|",
	"第61数暗示意义为：|牡丹芙蓉|牡丹芙蓉，花开富贵，名利双收，定享天赋。|吉|",
	"第62数暗示意义为：|衰败|衰败之象，内外不和，志望难达，灾祸频来。|凶|",
	"第63数暗示意义为：|舟归平海|富贵荣华，身心安泰，雨露惠泽，万事亨通。|吉|",
	"第64数暗示意义为：|非命|骨肉分离，孤独悲愁，难得心安，做事不成。|凶|",
	"第65数暗示意义为：|巨流归海|天长地久，家运隆昌，福寿绵长，事事成就。|吉|",
	"第66数暗示意义为：|岩头步马|进退维谷，艰难不堪，等待时机，一跃而起。|凶|",
	"第67数暗示意义为：|顺风通达|天赋幸运，四通八达，家道繁昌，富贵东来。|吉|",
	"第68数暗示意义为：|顺风吹帆|智虑周密，集众信达，发明能智，拓展昂进。|吉|",
	"第69数暗示意义为：|非业|非业非力，精神迫滞，灾害交至，遍偿痛苦。|凶|",
	"第70数暗示意义为：|残菊逢霜|残菊逢霜，寂寞无碍，惨淡忧愁，晚景凄凉。|凶|",
	"第71数暗示意义为：|石上金花|石上金花，内心劳苦，贯彻始终，定可昌隆。|半吉|",
	"第72数暗示意义为：|劳苦|荣苦相伴，阴云覆月，外表吉祥，内实凶祸。|半吉|",
	"第73数暗示意义为：|无勇|盛衰交加，徒有高志，天王福祉，终世平安。|半吉|",
	"第74数暗示意义为：|残菊经霜|残菊经霜，秋叶寂寞，无能无智，辛苦繁多。|凶|",
	"第75数暗示意义为：|退守|退守保吉，发迹甚迟，虽有吉象，无谋难成。|凶|",
	"第76数暗示意义为：|离散|倾覆离散，骨肉分离，内外不和，虽劳无功。|凶|",
	"第77数暗示意义为：|半吉|家庭有悦，半吉半凶，能获援护，陷落不幸。|半吉|",
	"第78数暗示意义为：|晚苦|祸福参半，先天智能，中年发达，晚景困苦。|凶|",
	"第79数暗示意义为：|云头望月|云头望月，身疲力尽，穷迫不伸，精神不定。|凶|",
	"第80数暗示意义为：|遁吉|辛苦不绝，早入隐遁，安心立命，化凶转吉。|凶|",
	"第81数暗示意义为：|万物回春|最吉之数，还本归元，吉祥重叠，富贵尊荣。|吉|",
}

func TestBigYan_Create(t *testing.T) {
	for k, v := range byList {
		s := strings.Split(v, "|")
		//log.Println("splite:", s)
		v := model.BigYan{
			Index:   k + 1,
			Goil:    s[3],
			SkyNine: s[1],
			Comment: s[2],
		}
		v.Create()
	}
}

func TestGetAll2(t *testing.T) {
	var by []model.BigYan
	model.FindBigYanAll(&by)
	debug.Println(by)
}

func TestFind(t *testing.T) {
	var by []model.BigYan
	model.FindBigYanByGoil(&by, "吉")
	debug.Println(by)
}

func TestGetByIndex(t *testing.T) {
	for i := 0; i < 100; i++ {
		model.GetBigYanByIndex(i)
	}

}
