package fate

import (
	"log"
	"runtime"
	"strconv"
	"strings"

	"github.com/godcong/excavator"
	"github.com/godcong/fate/debug"
	"github.com/godcong/fate/model"
	"github.com/satori/go.uuid"
)

type Charset []string

var (
	//木
	mu = Charset{
		"",
		"九",
		`干 工 弓 广 丌 及 孑 巾 久 口 亏 乞 彡 已 义`,
		`卞 丐 公 勾 讥 见 介 斤 今 仅 巨 开 亢 孔 木
	廿 牛 亓 气 欠 区 犬 劝 五 牙 艺 元 月 匀`,
		`本 东 尕 甘 功 古 瓜 归 宄 讧 卉 击 叽 饥 记
	加 甲 艽 叫 讦 纠 旧 句 卡 可 叩 邝 兰 卯 艿 巧 丘 囚 犰 去 术 外
	未 业 仪 仡 议 玉 驭 札`,

		`朳 芏 朵 纥 各 巩 共 关 观 犷 轨 过 玑 芨 机
	乩 肌 吉 级 伎 纪 夹 价 幵 奸 囝 件 讲 交 阶 阱 臼 讵 军 扛 伉 考
	扣 夸 匡 夼 纩 扩 芒 芃 朴 祁 芑 岂 企 扦 芊 乔 庆 曲 权 戎 阮 芍
	芄 伪 扤 吓 芗 芎 朽 吁 许 旭 厌 仰 尧 芋 聿 芝 朱 竹`,

		`芭 苄 材 苍 岑 杈 苌 床 苁 村 杜 扼 苊 呃 芳
	芬 芙 伽 尬 改 肝 杆 肛 纲 杠 告 更 攻 贡 估 谷 龟 妫 庋 呙 囯 旱
	何 吼 花 肓 鸡 技 忌 妓 歼 坚 间 角 疖 劫 芥 近 妗 劲 究 玖 局 拒
	苣 姖 君 佧 忾 闶 抗 囥 壳 克 抠 芤 库 快 狂 旷 困 苈 芦 杩 拟 你
	伲 芘 芪 杞 启 弃 佥 芡 羌 呛 芹 芩 穷 邱 虬 诎 驱 劬 却 芟 杉 杓
	苏 苇 我 芜 吾 吴 妩 芴 杌 匣 苋 县 肖 芯 杏 芽 严 言 杨 苡 吟 饫
	妪 芫 芸 纭 杖 芷 苎`,

		`枊 昂 茇 板 苞 杯 苯 苾 茌 杵 枞 妸 轭 枋 枫
	苻 斧 呷 该 陔 苷 秆 绀 杲 疙 肱 供 苟 狗 构 购 诟 咕 孤 姑 股 固
	呱 诖 乖 官 规 匦 诡 柜 国 果 杭 忽 昏 佶 亟 虮 季 剂 佳 迦 郏 驾
	肩 艰 拣 枧 建 降 郊 佼 杰 诘 届 卺 茎 京 经 肼 径 弪 迥 疚 拘 苴
	狙 居 驹 咀 具 卷 咔 咖 凯 苛 肯 空 苦 侉 侩 郐 诓 拦 枥 林 苓 茏
	茆 茅 茂 枚 杪 苠 茉 苜 呢 怩 拈 茑 杻 杷 枇 苤 苹 其 奇 歧 祈 肷
	枪 侨 茄 苘 顷 茕 穹 屈 诠 券 苒 枘 若 苫 枢 松 苔 苕 玩 枉 卧 析
	侠 狎 贤 枭 欣 厓 兖 侥 杳 宜 驿 茚 英 苑 岳 枕 枝 竺 杼 茁`,

		`柏 柲 荜 标 柄 草 茬 茶 尝 柽 柢 笃 俄 枹 尜
	柑 竿 缸 郜 诰 咯 革 虼 哏 郠 拱 枸 骨 牯 故 胍 挂 冠 咣 皈 鬼 癸
	訇 荭 虹 哄 逅 恢 荟 荤 咭 笈 急 挤 哜 既 珈 枷 荚 胛 叚 架 茧 俭
	荐 贱 牮 姜 绛 茭 娇 姣 骄 挢 狡 饺 绞 觉 皆 拮 结 界 疥 诫 衿 矜
	荩 胫 扃 赳 韭 柩 莒 矩 举 郡 胩 看 钪 拷 珂 柯 轲 科 咳 恪 客 眍
	绔 挎 哙 狯 哐 诳 贶 括 栏 荔 栎 柃 柳 栊 栌 荦 络 荬 面 茗 昵 逆
	柠 柈 枰 荠 契 恰 茜 荞 俏 诮 亲 轻 俅 酋 祛 朐 荃 畎 荛 饶 绕 荏
	茸 荣 茹 柿 树 竖 荪 莛 茼 统 柁 柝 柙 狭 相 枵 荇 荀 荨 研 俨 药
	荑 蚁 弈 奕 疫 羿 茵 荫 胤 郢 哟 柚 禺 竽 语 狱 柞 栅 栈 柘 祗 枳
	栉 荮 彦 茱 柱 斫`,

		`桉 笆 栢 梆 荸 笔 栟 柴 郴 莼 档 荻 屙 婀 莪
	饿 粉 莩 赅 酐 疳 赶 高 羔 哥 格 鬲 哿 根 耕 哽 绠 恭 蚣 躬 珙 鸪
	罟 顾 倌 莞 桄 逛 桂 桧 衮 郭 捍 悍 荷 核 桁 笏 桦 桓 获 唧 笄 屐
	姬 脊 觊 继 痂 家 恝 兼 捡 笕 健 舰 豇 桨 胶 轿 桀 蚧 紧 赆 痉 竞
	阄 桕 疽 桔 俱 倨 捐 娟 倦 桊 绢 捃 隽 莰 栲 疴 课 恳 倥 恐 哭 胯
	脍 宽 框 悝 捆 阃 悃 栝 莱 栳 莉 莅 栗 莲 莨 莽 莓 娩 难 匿 臬 耙
	莆 栖 桤 耆 颀 脐 起 悭 虔 悄 桥 窍 衾 倾 卿 逑 鸲 悛 辁 拳 缺 桡
	桑 莎 莘 倏 秫 栓 凇 颂 荽 笋 桃 梃 桐 砼 荼 桅 莴 悟 牺 奚 莶 校
	哮 栩 桠 唁 验 样 倚 挹 悒 谊 莺 莹 痈 邕 莜 莸 莠 娱 圄 峪 预 原
	笊 桢 茝 桎 株 桩 桌`,

		`菝 菢 笨 菶 萆 梐 笾 彬 菜 梣 菖 笞 菙 崔 萃
	笪 萏 菪 笛 兜 鄂 阏 谔 梵 菲 菔 桴 符 盖 敢 鸽 舸 梗 龚 笱 菰 菇
	蛄 蛊 梏 牿 鸹 馆 掼 绲 掴 帼 菡 萑 隍 谎 掎 偈 悸 寄 笳 袈 戛 袷
	假 菅 笺 检 趼 减 谏 矫 皎 脚 教 秸 婕 堇 菁 惊 颈 竟 婧 救 厩 掬
	菊 据 距 惧 鄄 眷 掘 桷 菌 皲 珺 康 氪 骒 啃 裉 控 寇 眶 盔 傀 匮
	梱 婪 笠 敛 啉 菱 棂 笼 萝 梅 萌 梦 萘 猊 旎 偶 笸 菩 萋 萁 骐 骑
	绮 掐 掮 乾 羟 筇 蚯 球 赇 蛆 躯 娶 圈 痊 绻 萨 啬 梢 笙 菽 梳 耜
	笥 菘 桫 梭 萄 梼 梯 笤 萜 桶 菟 菀 萎 隗 偓 梧 晤 菥 厢 萧 啸 偕
	谐 械 悻 悬 菸 阎 掩 厣 眼 谚 窑 翊 萤 营 萦 唷 萸 圉 庾 阈 菑 笮
	著 棁 梓 菹`,

		`棒 葆 筚 萹 策 搽 猹 蒇 趁 葱 蒂 椟 鹅 萼 遏
	愕 葑 搁 隔 葛 赓 辊 琯 猴 葫 鹄 慌 赍 犄 缉 葭 跏 颊 蛱 徦 犍 睑
	裥 楗 毽 腱 蒋 椒 蛟 搅 窖 揭 喈 街 颉 筋 腈 景 敬 窘 揪 啾 琚 椐
	犋 飓 鹃 喀 揩 蒈 慨 棵 颏 缂 筘 喾 裤 款 筐 揆 葵 蒉 喟 馈 愦 愧
	琨 蛞 榔 棱 联 椋 琳 蒌 椤 棉 募 葩 棚 椑 葡 期 欺 琪 琦 棋 蛴 祺
	葺 葜 谦 椠 嵌 强 愀 翘 趄 琴 琼 萩 遒 巯 趋 蛐 阒 筌 裙 森 厦 筛
	葚 覃 棠 葶 筒 椭 皖 葳 蒍 珷 稀 葸 筅 葙 缃 萱 雅 筵 雁 傜 椰 遗
	椅 硬 遇 御 鹆 寓 葬 棹 筝 植 筑 椎 孳 棕 最`,

		`嗄 蒡 蓓 蓖 蔀 槎 榇 筹 椽 槌 椿 戥 椴 蛾 腭
	蒽 摁 概 戤 感 幹 筻 搞 缟 塥 嗝 跟 遘 彀 媾 毂 鼓 痼 褂 瑰 跪 蒿
	嗬 鲎 槐 畸 蒺 楫 嫉 麂 蓟 筴 嫁 搛 蒹 缣 简 骞 谫 酱 跤 敫 睫 解
	骱 谨 靳 禁 缙 睛 舅 雎 裾 榉 龃 筠 楷 戡 嗑 稞 窠 窟 跨 蒯 筷 窥
	暌 魁 髡 廓 蓝 榄 楞 蓠 廉 楝 楼 楣 蓦 墓 幕 楠 睨 腻 筢 蓬 榀 蒲
	签 愆 跷 鄡 勤 楸 群 蓉 蓐 嗓 瑟 筲 椹 筮 蒴 蒜 蓑 蓊 皙 暇 献 筱
	楔 歇 蓄 楦 靴 罨 肄 缢 蓥 楹 颖 媵 榆 愚 瘐 蓣 瑗 楂 蓁 蒸 罪`,

		`蔼 榜 蔽 箅 槟 蔡 箣 蔟 榱 箪 凳 蔸 鹗 榧 嘎
	睾 膏 槁 歌 搿 膈 箇 觏 箍 鹘 管 蝈 蜾 赫 瘊 夥 箕 跽 鲚 暨 嘉 瘕
	戬 僭 僬 鲛 酵 截 鲒 竭 馑 廑 兢 儆 獍 僦 窭 槛 阚 慷 犒 颗 箜 蔻
	骷 酷 睽 蔹 蓼 蔺 榴 箩 蔓 甍 蔑 模 蔫 酿 箄 裴 嘁 綦 旗 搴 箝 歉
	蔷 敲 箧 箐 蕖 蜷 榷 榕 箬 槊 蔌 算 榫 榻 箢 蔚 斡 蓰 辖 箫 榭 榍
	蓿 酽 疑 蜴 瘗 龈 蝇 蜮 愿 箦 榨 寨 肇 蔗 榛 槠 箸 赚`,

		`箯 槽 樗 稻 噔 蕫 懂 额 颚 蕃 樊 噶 橄 稿 骼
	鲠 穀 鲧 横 骺 篌 糇 槲 蝗 篁 蕙 稽 畿 蕺 瘠 稷 鲫 鲣 鹣 翦 踺 箭
	僵 蕉 噍 羯 槿 觐 憬 樛 踞 屦 蕨 靠 瞌 蝌 聩 篑 醌 篓 樠 瞢 耦 篇
	蕲 槭 樯 鞒 憔 撬 擒 蝤 觑 蕤 蕊 蔬 樘 瞎 箱 橡 蝎 撷 蕈 颜 魇 谳
	毅 樱 龉 窳 蕴 樟 箴 橥 篆 蕞 醉`,

		`薜 篦 篰 橙 篪 篘 橱 薋 篡 噩 篚 擀 篙 糕 篝
	薅 嚆 薨 蕻 黉 圜 癀 墼 激 髻 冀 稼 彊 缰 耩 犟 徼 缴 噤 鲸 橘 踽
	遽 橛 麇 瞰 鲲 篮 蕾 篱 篥 橹 鲵 篷 器 褰 黔 橇 缲 樵 鞘 檎 螓 檠
	擎 磬 鼽 糗 磲 醛 穑 薯 薮 薇 蕹 樨 魈 薤 薪 薛 赝 邀 薏 嬴 瘿 橼
	樾 嘴 樽`,

		`藊 檦 檗 藏 簇 瞪 篼 簖 鳄 藁 臌 簋 馘 蟥 簧
	鳇 豁 羁 藉 謇 鹪 鹫 鞠 糠 髁 檑 檩 簏 懋 檬 藐 篾 蹊 襁 瞧 罄 鳅
	璩 龋 薷 篸 簌 薹 檀 魏 檄 罅 藓 薰 檐 鹬`,

		`藨 檫 簦 簟 瞽 鳏 颢 鞯 糨 襟 鞫 藜 藕 髂 瞿
	鬈 檮 藤 黠 嚣 鹰 簪`,

		`霭 簸 蹬 蘅 攉 藿 蠖 醮 警 鬏 髋 籁 麓 蘑 孽
	攀 麒 黢 蘧 蟹 籀 缵`,

		`蘩 鳜 籍 醵 蘖 黦 纂`,

		`赣 瓘 夔`,

		`鱇 氍 鬻 蘸`,

		`欑 蠲 癯 颧 鼹 躜 攥`,

		`衢`,

		`戆`,

		`蠼`,
	}
	//金
	jin = Charset{
		"",
		` 匕 厂 刀 儿 七 人 入 十 厶`,

		` 才 叉 亍 川 寸 千 刃 三 上 尸 士 夕 小`,

		` 仓 车 仇 戈 仁 认 仍 冗 少 什 升 氏 手 殳 书
		闩 双 兮 心 扎 专`,

		` 册 出 刍 处 乏 戋 节 刊 仟 阡 邛 仞 讱 扔 闪
		讪 申 生 失 石 史 矢 示 世 仕 市 甩 帅 司 丝 四 凸 仙 轧 乍 占 正
		卮 主`,

		` 伧 产 忏 伥 伡 臣 成 丞 冲 舛 创 此 次 汆 存
		忖 丢 而 钆 刚 划 吏 列 齐 迁 任 纫 礽 如 伞 扫 色 伤 舌 厍 设 师
		式 守 妁 死 寺 讼 夙 岁 孙 刎 问 西 吸 戏 先 纤 囟 邢 匈 旬 巡 驯
		页 曳 钇 伛 刖 再 在 早 则 吒 众 舟 州 伫 妆 庄 壮 字`,

		` 财 岔 刬 肠 怅 抄 吵 扯 忱 迟 赤 饬 沖 忡 初
		氚 串 怆 吹 纯 词 钉 兑 刭 陉 钌 判 刨 钋 抢 吣 忍 韧 轫 饪 妊 肜
		删 邵 劭 佘 社 伸 身 声 时 识 寿 抒 纾 束 吮 私 伺 祀 姒 忪 宋 诉
		忒 吻 饩 系 伭 辛 秀 序 玚 译 酉 皂 诈 钊 诏 针 吱 纸 忮 诌 肘 助
		抓 孜 邹 走 诅 佐 作 坐 阼`,

		` 参 厕 侧 侘 刹 诧 拆 钗 侪 昌 怊 弨 抻 衬 诚
		承 宠 怵 绌 钏 垂 佌 刺 钓 钒 庚 刮 怪 刿 刽 环 饯 金 净 剀 侃 刻
		刳 钔 狞 拧 孥 钕 凭 妻 钎 戗 戕 郄 怯 青 取 叁 丧 钐 衫 姗 陕 疝
		尚 绍 舍 呻 侁 诜 绅 审 肾 诗 实 使 始 驶 势 事 试 视 受 叔 述 刷
		咝 兕 驷 怂 肃 所 钍 兔 昔 穸 细 祆 限 线 详 些 性 姓 询 咋 甾 驵
		枣 责 迮 昃 闸 怔 织 侄 帜 终 周 妯 咒 宙 绉 帚 邾 侏 诛 拄 贮 拙
		宗 驺 卒 组 怍`,

		` 钡 残 恻 臿 查 差 姹 觇 钞 疢 宬 持 穿 舡 疮
		春 呲 祠 殂 促 钭 毒 独 度 钝 耏 贰 罚 阀 珐 钫 钙 钢 宫 钩 剐 郝
		剑 俓 钜 绝 钧 枯 闾 钠 陧 钮 钤 前 钦 侵 氢 秋 衽 狨 绒 柔 砂 珊
		舢 殇 珅 神 哂 矧 甚 胂 牲 省 胜 狮 施 拾 食 蚀 是 室 首 狩 姝 耍
		拴 顺 说 思 俟 娀 送 诵 叟 俗 虽 狲 钛 剃 恸 钨 郤 籼 险 庠 哓 骁
		信 星 咻 修 庥 须 胥 叙 宣 选 绚 削 逊 钥 俞 俣 哉 咱 昝 蚤 怎 眨
		咤 毡 战 帧 胗 狰 拯 挣 栀 胝 指 轵 咫 峙 陟 钟 昼 拽 咨 姿 兹 总
		俎 祖 昨 胙 祚`,

		`铋 钵 剥 钹 铂 蚕 舱 敇 豺 谄 倡 鬯 晁 眧 耖
		唓 宸 琤 称 乘 蚩 翅 帱 俶 陲 玼 瓷 脆 挫 厝 钿 凋 铎 罡 钴 壶 剞
		钾 借 剧 峻 骏 钶 铃 铆 钼 铌 倪 捏 聂 珮 铍 钷 剖 铅 钱 钳 倩 挈
		请 逡 辱 弱 扇 捎 哨 射 娠 谂 眚 逝 轼 殊 衰 谁 铄 鸶 耸 悚 素 速
		狻 谇 祟 损 隼 唆 索 唢 铊 钽 铁 捅 途 剜 紊 唏 息 席 蚬 猃 陷 祥
		逍 宵 绡 笑 胸 脩 袖 绣 訏 徐 痃 眩 铉 殉 剡 铀 钰 钺 悦 栽 载 宰
		赃 奘 唣 造 贼 哳 痄 斋 窄 债 真 畛 疹 钲 症 脂 挚 胵 酎 皱 珠 诸
		疰 谆 酌 诼 资 郰 诹 陬 租 钻 唑 座`,

		`铵 猜 彩 惭 惨 曹 掺 谗 婵 铲 猖 阊 娼 常 偿
		徜 惝 唱 巢 晨 谌 趻 偁 铖 脭 瓻 豉 舂 崇 铳 紬 惆 绸 偢 船 捶 啜
		疵 粗 猝 啐 悴 脞 措 铛 祷 得 掉 铞 铫 铤 铥 堵 铒 副 铬 铪 铧 秽
		祭 寂 铗 剪 铰 捷 旌 铠 勘 铐 馗 铑 率 铭 啮 聍 掊 跄 惬 圊 情 铨
		悫 雀 蚺 铷 铯 铩 啥 唼 商 绱 奢 赊 猞 蛇 赦 婶 绳 盛 匙 授 售 兽
		绶 鄃 孰 庶 唰 爽 偲 隋 随 琐 铴 铜 偷 推 欷 悉 惜 觋 袭 铣 徙 阋
		掀 衔 舷 馅 象 斜 偰 訢 衅 羞 鸺 宿 琇 酗 绪 续 谖 旋 铘 谒 铱 铟
		银 铕 谕 啧 帻 舴 铡 蚱 砦 粘 着 赈 睁 铮 趾 铢 蛀 综 族 做`,

		`锕 裁 曾 插 嗏 馇 馋 禅 孱 敞 超 朝 琛 惩 牚
		啻 畴 厨 锄 储 揣 遄 喘 窗 赐 琮 窜 毳 皴 搓 嵯 矬 痤 锉 貂 犊 牍
		锇 锋 锆 割 辜 锅 戟 缄 锏 锔 竣 锎 铿 铼 锒 铹 锂 链 靓 锍 锊 甯
		裒 铺 腔 禽 锓 揿 氰 蛩 阕 然 揉 鄏 锐 毵 散 搔 骚 嫂 痧 跚 善 觞
		赏 稍 畲 甥 剩 释 谥 舒 疏 暑 黍 属 税 舜 斯 蛳 缌 竦 搜 嗖 馊 酥
		粟 谡 飧 睃 锁 锑 替 童 晰 傒 舾 粞 犀 舄 痫 鹇 羡 缐 销 谢 锌 猩
		惺 锈 絮 婿 揎 喧 揄 逾 腴 愉 喻 裕 缊 凿 锃 揸 喳 掌 絷 殖 黹 蛛
		铸 装 紫 腙 尊 酢`,

		`锛 睬 粲 鼌 嗔 赪 絺 傺 搊 酬 稠 愁 裯 蜍 雏
		楚 搐 触 搋 歂 锤 辞 慈 跐 催 瘁 错 锝 锭 嘟 睹 鄜 辐 锢 锪 辑 鉴
		键 剿 锦 靖 锯 锩 锞 锟 锣 锚 锰 嗫 锘 锫 遣 慊 蜣 锖 嗪 寝 跫 鹊
		阙 缛 瑞 腮 塞 搡 裟 傻 歃 煞 骟 蛸 艄 慑 蜃 慎 摅 输 毹 署 蜀 鼠
		腧 数 睡 搠 肆 嗣 飕 稣 嗉 愫 睢 嗦 嗍 羧 锬 酮 骰 颓 腿 锡 媳 禊
		酰 跹 锨 嫌 跣 腺 想 像 新 歆 腥 貅 馐 嗅 煦 暄 瑜 觎 愈 锗 斟 甄
		缜 酯 瘃 锥 锱`,

		`锿 綵 嘈 锸 察 瘥 摻 蝉 僝 鋋 嫦 綝 酲 殠 摴
		僢 摐 雌 鹚 骢 摧 粹 翠 镀 锻 锷 镄 锾 劐 精 静 聚 镌 劂 锴 镂 銮
		镅 镁 綮 锵 嫱 锹 劁 谯 锲 蜻 銎 睿 赛 糁 缫 瘙 僧 酾 鄯 韶 誓 瘦
		摔 锶 锼 瞍 嗾 嗽 僳 觫 酸 隧 缩 僮 酴 蜥 僖 屣 鲜 需 舆 窬 臧 遭
		谮 蜘 摭 碡 翥 粽 僔`,

		`镑 艑 镔 镈 踩 憯 艖 廛 麨 瞋 漦 褫 瘛 憧 諔
		膗 噇 糍 璁 聪 醋 璀 撮 敷 镐 镉 镓 镏 镆 镎 镊 镍 劈 谴 噙 趣 髯
		蝾 镕 糅 褥 馓 磉 缮 奭 艏 熟 撕 嘶 螋 艘 鋈 嘻 膝 暹 儇 镒 劓 蝓
		鋆 糌 赜 憎 缯 谵 稹 镇 嘱 颛 撞 幢 踪 遵 撙 嘬`,

		`翱 镚 镖 餐 操 糙 幨 鲳 氅 鋹 踸 瘳 憷 踹 膪
		輴 錞 踳 蹉 鹾 镝 雕 镜 镘 穆 颞 缱 鲭 瘸 蹂 儒 噻 颡 懆 穇 擅 膳
		嬗 擞 镗 螅 羲 醒 髹 錡 錾 赞 噪 甑 蹅 瘵 整 麈 鲰 镞`,

		`擦 縩 璨 螬 艚 嚓 鲿 韔 懤 歜 黜 镩 镫 镦 徽
		蹇 镢 镧 镣 镥 縻 鍪 蹑 镤 镨 镪 嚅 孺 鳃 臊 膻 蟀 瞬 邃 镡 蟋 谿
		燨 蟓 擤 翼 糟 罾 鍼 骤 瞩`,

		`鏊 鎞 饆 襜 繟 儭 艟 躇 幮 蹙 镭 镰 鎏 謦 鞣蟮 雟 燹镱 镯 鬃`,

		`鏖 镲 蟾 谶 蹴 蹿 骥 襦 醯`,

		`犨 鰆 黩 鐍 鏻 黥 颥 蠕 繻 鳝 孀 璺 霰 馨 瓒
		躁 鐘`,

		`蠢 髓`,

		`镵 镶`,

		`鼷 鱚 趱`,

		`矗 鑫`,

		`鑶`,
	}
	//水
	shui = Charset{
		"",
		` 八 勹 卜 乜`,

		` 凡 飞 马 么 门 万 亡 习 下 乡 子`,

		` 巴 办 贝 比 币 不 歹 反 方 分 风 凤 夫 父 讣
		冈 互 戶 户 化 幻 计 毛 爿 匹 片 攴 仆 壬 卅 水 文 无 毋 勿 凶 云`,

		` 扒 叭 白 半 包 北 必 边 弁 卟 布 匆 发 犯 氾
		冯 弗 付 邗 汉 夯 号 禾 弘 乎 汇 劢 邙 矛 们 灭 民 皿 末 母 目 仫
		丕 皮 氕 平 叵 扑 讫 仨 疋 汀 务 写 兄 玄 穴 训 印 匝 汁`,

		` 百 阪 邦 毕 闭 邠 冰 并 汊 池 闯 凼 讹 伐 帆
		汎 邡 防 仿 访 妃 份 讽 缶 伏 凫 负 妇 亥 汗 行 好 合 红 后 冱 华
		欢 回 会 讳 汲 江 邟 妈 犸 吗 买 迈 忙 扪 米 糸 名 牟 仳 牝 乒 迄
		汔 汝 杀 汕 收 汜 汤 网 危 污 汐 向 协 邪 刑 兴 休 血 汛 杂`,

		` 夿 把 弝 吧 扳 伴 扮 报 陂 孛 邶 貝 狈 呗 伻
		皀 吡 佊 沘 妣 庇 邲 诐 抃 汳 汴 忭 别 兵 邴 伯 驳 补 步 吥 沧 沉
		呆 沌 返 饭 泛 妨 纺 吠 吩 纷 汾 沣 沨 佛 否 呋 扶 孚 抚 甫 汞 佝
		沟 汩 还 邯 含 罕 沆 诃 亨 宏 囫 护 沪 怀 奂 即 戒 鸠 况 泐 冷 沥
		沦 玛 祃 麦 尨 沒 没 每 闷 芈 汨 沔 妙 闵 亩 沐 尿 妞 扭 狃 忸 纽
		沤 彷 抛 沛 批 邳 伾 屁 评 沏 汽 沁 扰 沙 纱 沈 汰 汪 忘 沩 尾 纹
		汶 沃 希 闲 孝 忻 形 汹 妍 沂 妤 沅 沄 妘 沚 状`,

		` 岸 拔 爸 败 攽 版 拌 姅 绊 孢 饱 抱 卑 备 奔
		屄 彼 畀 贬 变 表 玢 秉 幷 並 拨 波 帛 瓝 泊 怖 法 范 贩 祊 肪 房
		放 非 肥 肺 狒 沸 氛 奋 忿 奉 肤 拂 服 怫 绂 绋 拊 府 咐 阜 驸 侅
		泔 岡 沽 卦 函 呵 和 劾 河 佫 轰 泓 郈 呼 狐 弧 虎 怙 诨 或 货 泾
		沮 炬 泪 泠 泷 泸 泺 码 卖 盲 氓 牦 泖 玫 妹 門 孟 弥 觅 泌 宓 黾
		苗 庙 玟 抿 泯 鸣 命 抹 殁 沫 陌 侔 拇 姆 牧 泥 泞 拍 泮 咆 狍 庖
		泡 呸 帔 佩 抨 怦 朋 披 拚 贫 郱 泼 迫 泣 浅 泅 沭 饲 泗 沲 沱 味
		武 物 郃 弦 冼 现 享 協 胁 泄 泻 绁 幸 泫 学 郇 沿 泱 泳 油 鱼 雨
		郁 咂 泽 沾 沼 治 注 狀`,

		` 疤 胈 拜 帮 绑 胞 保 鸨 背 贲 甭 泵 迸 秕 珌
		毖 哔 陛 窆 扁 昪 便 飑 骉 饼 玻 勃 钚 测 浐 泚 荡 点 洞 洱 畈 飛
		封 風 疯 罘 氟 俘 郛 祓 复 負 訃 阁 哈 孩 骇 顸 绗 阂 贺 很 狠 恨
		恒 洪 紅 侯 厚 轷 浒 祜 哗 骅 徊 洹 奐 宦 皇 挥 虺 洄 哕 浍 诲 绘
		浑 活 計 洎 济 挟 浃 茳 洚 浇 洁 津 荆 姥 洌 浏 洛 蚂 骂 脉 茫 昴
		冒 贸 眉 美 昧 虻 咪 迷 祢 洣 弭 眄 勉 眇 秒 咩 珉 闽 哞 某 浓 哌
		派 眅 盼 叛 胖 胚 毗 骈 拼 姘 品 俜 玶 洴 屏 珀 匍 柒 洽 泉 染 娆
		洳 洒 飒 洮 洼 洧 闻 郚 郗 洗 虾 咸 涎 宪 香 响 饷 项 巷 卸 洩 洫
		恤 泶 洵 浔 恂 徇 衍 洋 洇 荥 盈 拶 浈 洲 洙 浊`,

		`氨 捌 粑 罢 班 般 颁 舨 浜 蚌 趵 豹 倍 狽 悖
		被 唄 倴 畚 俾 舭 粃 毙 畢 狴 髟 俵 宾 病 砵 饽 袯 亳 浡 逋 庯 捕
		哺 部 涔 秤 臭 唇 涤 娥 舫 紡 匪 诽 紛 峰 逢 俸 蚨 浮 俯 釜 胲 海
		氦 害 浛 航 颃 蚝 耗 浩 盍 哼 珩 竑 候 華 换 唤 涣 浣 珲 晖 悔 恚
		贿 浹 贾 涧 浆 较 浸 涇 酒 涓 浚 涞 浪 涝 涟 流 馬 唛 脈 旄 浼 們
		勐 脒 敉 秘 眠 悯 冥 莫 秣 毪 畝 涅 紐 俳 畔 袢 旁 袍 疱 陪 配 旆
		倗 蚍 郫 疲 陴 胼 娉 瓶 哱 圃 浦 凄 訖 润 脎 涩 殺 紗 涉 涑 绥 娑
		泰 烫 涛 涕 涂 涒 涠 蚊 紋 涡 浯 務 浠 消 效 挾 脅 屑 訓 珢 涌 浴
		耘 涨 浙 浞`,
		`豝 敗 湴 絆 偝 绷 偪 閉 庳 敝 婢 匾 貶 彪 婊
		菠 舶 脖 啵 脣 淳 淙 淬 淡 淀 渎 訛 販 訪 婓 啡 绯 淝 悱 酚 偾 唪
		麸 趺 匐 涪 艴 紱 紼 辅 婦 袱 淦 髙 够 涫 蚶 琀 涵 毫 淏 菏 盒 涸
		痕 鸿 唿 惚 唬 瓠 扈 淮 患 逭 凰 彗 晦 阍 婚 馄 混 貨 祸 渐 蚵 淶
		淚 涼 猎 淋 淩 渌 淪 麻 麥 曼 猫 袤 捫 猛 眯 猕 谜 覓 密 绵 冕 渑
		喵 描 敏 眸 谋 淖 脲 排 徘 盘 脬 匏 烹 捧 啤 偏 谝 殍 票 貧 萍 颇
		婆 粕 脯 淇 淺 清 渠 渃 深 渖 渗 淑 涮 淞 挲 淌 淘 添 淟 晚 涴 望
		逶 偎 隈 阌 渦 淅 現 鄉 淆 涬 婞 訩 虚 雪 涯 淹 液 淫 渶 淤 雩 魚
		渔 鄅 淯 渊 渚 涿 淄 渍`,

		`鲃 跋 斑 綁 棓 傍 谤 報 悲 琲 辈 備 惫 賁 絣
		琫 逼 皕 赑 詖 愊 愎 弼 编 惼 揙 徧 遍 缏 猋 傧 斌 摒 博 葧 鹁 渤
		跛 補 鈈 瓿 測 滁 湻 渡 發 番 飯 鲂 扉 腓 斐 粪 愤 馮 渢 跗 稃 幅
		腑 赋 傅 富 溉 港 缑 蛤 酣 韩 寒 喊 絎 喝 訶 颌 訸 軤 猢 湖 琥 猾
		滑 換 喚 痪 渙 遑 徨 湟 惶 揮 辉 蛔 惠 喙 缋 渾 耠 惑 禍 湔 溅 渴
		溃 阔 落 傌 買 蛮 鄚 帽 貿 猸 湄 媒 渼 寐 媚 悶 幂 谧 湎 缅 淼 渺
		缈 缗 閔 湣 黽 鄍 谟 蛑 湳 琶 牌 蒎 湃 跑 赔 喷 湓 彭 琵 脾 痞 骗
		評 普 湫 惹 湿 溲 湯 湉 琠 湍 湾 萬 溈 湋 渭 雯 渥 無 喜 隙 閑 湘
		飨 項 亵 渫 雄 溆 渲 湮 欹 絏 颍 湧 游 渝 淵 雲 渣 湛 湞 滞 粥 煮
		滋`,
		`靶 鲅 搬 頒 斒 稖 龅 雹 飽 鲍 鹎 傰 鄙 閟 跸
		嗶 腷 痹 滗 裨 裱 滨 缤 摈 禀 搏 鲌 馎 滄 滀 鹑 滌 滇 蜂 缝 鳧 福
		滏 腹 鲋 缚 滚 傼 颔 頏 嗥 號 滈 阖 嗨 瑚 鄠 嘩 豢 滉 暉 毁 匯 賄
		會 琿 魂 溷 賈 較 粳 鳩 溘 滥 蒗 雷 漓 溧 漣 粱 溜 滦 媽 嗎 獁 满
		鄤 谩 漭 瑁 蒙 盟 腼 鹋 瞄 愍 溟 酩 摸 馍 嫫 貊 貉 漠 寞 溺 滂 辔
		搒 鹏 睥 辟 媲 犏 剽 频 嫔 聘 鲆 溥 溱 裘 溶 溽 滠 飼 溯 綏 溻 滩
		溏 滔 微 溦 雾 溪 携 溴 滟 溢 滢 源 滓`,

		`魃 蝂 蜯 褓 骳 褙 嘣 綳 鼻 碧 馝 弊 幣 稨 褊
		摽 幖 颮 滮 骠 賓 殡 膑 餅 駁 僰 箔 膊 漕 滻 漘 滴 蜚 緋 翡 僨 瘋
		鳳 孵 輔 腐 赙 複 澉 閣 嘏 寡 滾 撖 漢 豪 閡 褐 滹 鹕 滸 滬 瘓 漶
		潢 誨 霁 漸 漤 潋 漏 漉 漯 瑪 嘛 勱 嘜 馒 滿 幔 漫 慢 缦 髦 貌 瞀
		麽 麼 酶 鹛 魅 蜢 艋 嘧 蜜 綿 閩 暝 鳴 摹 膜 慕 暮 漚 膀 蜱 罴 漂
		缥 嫖 嘌 撇 鄱 魄 頗 僕 谱 漆 蜞 颯 滲 漱 霆 網 潍 瘟 聞 舞 熙 餉
		鲞 潇 熊 漩 踅 熏 窨 鲟 演 漾 漪 滎 潆 漁 漳 漲 潴 漬`,

		`澳 罷 瘢 魬 褒 鴇 緥 暴 輩 髲 駜 潷 蝙 編 緶
		膘 麃 憋 瘪 播 撥 餑 踣 餔 潺 潮 澈 澂 澄 蝽 醇 蕩 幡 範 魴 誹 憤
		麩 膚 蝠 幞 撫 駙 賦 蝮 蝜 緱 虢 骸 憨 頜 鹤 踝 鲩 璜 輝 麾 慧 澗
		漿 澆 潔 潰 澜 澇 犛 潦 凛 履 碼 罵 賣 邁 瞒 蝥 霉 緬 緲 廟 緡 憫
		瞑 摩 墨 瘼 潘 醅 賠 霈 噴 嘭 澎 翩 潑 撲 噗 潜 潛 嬈 潤 撒 鲨 潸
		澐 震 潲 澠 澍 澌 潭 漽 潼 潿 嬉 霄 勰 缬 寫 潯 潁`,

		`辦 薄 虣 鮑 憊 糒 甏 觱 鮅 避 嬖 辨 辩 飙 飚
		瘭 褾 儐 濒 馞 鮊 澶 醕 澹 澱 璠 霏 鲱 奮 縫 諷 縛 鲴 盥 還 駭 撼
		翰 頷 澣 憾 翮 醐 寰 缳 擐 噦 諱 澮 閽 餛 諢 霍 濑 澧 濂 霖 潞 螞
		颟 鞔 瞞 螨 蟒 醚 謎 螟 默 謀 霓 凝 濃 螃 耪 膨 駢 蹁 諞 瓢 瞟 瞥
		頻 鮃 璞 氆 憩 霎 潚 濉 燙 靦 閿 禧 憲 獬 邂 廨 懈 興 噱 學 澡 澤
		濁`,

		`癍 幫 謗 鲾 鞞 蹕 髀 斃 濞 臂 鳊 辫 豳 濱 擯
		襏 擘 點 繁 鼢 鲼 糞 黻 襆 黼 鳆 醢 鼾 韓 嚎 濠 鴻 觳 隳 濟 瀞 闊
		濫 蟎 縵 蟊 懑 朦 糜 彌 謐 邈 嬤 貘 嬷 濘 蹒 貔 螵 縹 嬪 皤 濮 濡
		澀 濕 霜 穗 濤 濰 霞 澩 獯 濯`,

		`鼥 奰 鞭 邊 瀌 蹩 殯 臏 鵓 餺 鵏 瀍 闖 瀆 藩
		翻 覆 馥 鹱 鯇 蟪 繢 瀐 濺 獵 瀏 濼 謾 懵 禰 饃 蹣 蟠 蟛 癖 鯆 瀑
		鳍 擾 瀋 霧 瀉 瀅 雜`,

		`瓣 鵯 鞴 襣 襞 臕 鳔 鳖 癟 瀕 髌 醭 簿 鶉 蹯
		鯡 羹 鞲 韝 鯝 瀚 懷 繯 繪 嚯 瀖 瀨 瀝 瀘 饅 鳗 艨 蠓 靡 鶓 鳘 髈
		鵬 羆 騙 蹼 譜 瀜 瀟 瀣 鳕 霪 瀛 瀠 藻`,

		`齙 鰏 躄 鯿 辮 穮 繽 鬓 襮 瀿 瀵 酆 鰒 灌 蠔
		鶘 護 驊 獾 鹹 瀾 瀲 瀧 鬕 顢 鶥 獼 蠛 魔 譬 蠙 瀼 攘 嚷 饗 響 瀷
		瀹 灂`,
		`黯 霸 贔 辯 驃 飆 飈 灃 灏 鶴 轟 歡 露 霹 鼙
		颦 禳 灄 攜 纈 醺`,

		`鷩 鰾 鱉 霽 霾 鰻 蘼 鰵 耱 轡 穰 瓤 灑 灘 鱈`,

		`變 髕 鱝 鬟 黴 鱘`,

		`灞 鬢 灝 襻 躞`,

		`蠻 灣 戅`,

		`灤`,
		"",
		"",
		`鬱`,

		`驫`,

		`灩`,
	}
	//火
	huo = Charset{

		"",
		` 丁 二 了 力 乃`,

		` 彳 大 孓 女 勺 巳 乇 幺 弋 丈 之`,

		` 尺 丑 从 丹 邓 仃 订 斗 队 丰 火 井 仂 历 六
		仑 内 日 太 天 厅 屯 乌 午 爻 长 仉 支 止 中`,

		` 丙 丛 打 代 旦 叨 忉 氐 电 叮 冬 对 尔 叻 乐
		礼 厉 立 辽 另 令 龙 卢 奶 尼 宁 奴 冉 让 他 它 台 叹 讨 田 仝 头
		讯 占 仗 召 只 左`,

		` 犴 场 尘 吃 弛 驰 虫 传 达 当 氘 导 灯 吊 玎
		动 多 夺 阨 耳 旮 亘 光 伙 尖 匠 尽 决 诀 旯 老 玏 耒 肋 利 尥 劣
		刘 甪 伦 论 吕 那 氖 囡 讷 年 农 乓 全 肉 她 饧 廷 同 团 氽 托 驮
		佤 纨 妄 寻 迅 扬 吆 宅 兆 贞 阵 争 执 旨 至 仲 纣 自`,

		` 灿 层 彻 陈 呈 辵 但 岛 低 狄 邸 诋 玓 弟 佃
		甸 阽 盯 町 疔 冻 抖 豆 妒 吨 旰 际 进 灸 抉 吭 来 劳 牢 里 丽 励
		呖 奁 连 良 两 疗 冽 邻 吝 伶 灵 陇 庐 卤 陆 卵 乱 抡 囵 纶 驴 呐
		纳 男 佞 弄 努 求 闰 邰 呔 忐 忑 体 条 听 佟 彤 投 抟 吞 囤 饨 佗
		陀 妥 肟 巫 旸 炀 妖 佁 灾 灶 张 帐 找 折 这 诊 证 志 豸 妐 住 灼
		姊 纵 足`,

		` 哎 佰 宝 采 畅 炒 坼 齿 侈 抶 抽 炊 佽 徂 怛
		妲 甙 岱 迨 绐 担 单 砀 宕 到 的 迪 籴 抵 底 典 店 耵 顶 定 咚 侗
		祋 炖 咄 剁 迩 佴 昉 拐 炅 昊 戽 诙 姐 咎 玦 炕 昆 拉 郎 佬 诔 例
		疠 戾 隶 怜 帘 练 拎 囹 呤 咙 拢 陋 炉 虏 坴 侓 录 轮 罗 侣 免 旻
		明 肭 奈 呶 闹 妮 念 咛 侬 驽 弩 疟 庞 炝 妾 炔 乳 软 朊 侍 沓 抬
		态 肽 贪 昙 帑 弢 屉 忝 佻 迢 帖 图 拖 驼 骀 拓 罔 炜 昕 炎 佯 疡
		易 绎 择 斩 账 胀 招 者 侦 征 郑 诤 知 肢 直 祉 郅 帙 制 质 炙 忠
		肿 驻 转 隹 卓`,

		` 炳 炽 俦 除 耷 哒 玳 带 殆 贷 待 怠 眈 胆 挡
		帝 玷 酊 胨 恫 陡 郖 段 怼 盹 盾 哆 哚 诶 饵 赴 曷 烀 恍 咴 钬 姞
		迹 柬 将 奖 炯 珏 俊 恺 剌 览 烂 类 厘 俚 郦 轹 俪 俐 疬 炼 俩 亮
		咧 临 玲 瓴 珑 胧 娄 轳 胪 孪 骆 律 哪 衲 娜 柰 耐 南 侽 挠 恼 哝
		怒 虐 挪 逄 炮 适 烁 挞 闼 胎 炱 炭 逃 畋 恬 殄 挑 贴 烃 亭 庭 挺
		突 彖 退 挖 歪 弯 挝 显 炫 紃 殃 徉 轺 咬 轶 荧 映 昱 怨 炸 昭 赵
		珍 轸 鸩 政 盅 种 重 轴 胄 炷 祝 追 耔 秭 籽 奏`,

		`龀 逞 骋 哧 鸱 耻 翀 畜 娖 耽 郸 疸 紞 党 捣
		倒 敌 递 娣 刁 爹 瓞 鸫 胴 都 蚪 逗 读 趸 顿 珥 烦 耿 烘 晃 晄 烩
		积 疾 晋 烬 狷 倔 烤 徕 狼 阆 朗 捞 唠 烙 狸 离 骊 逦 哩 娌 珕 猁
		恋 凉 谅 料 烈 赁 凌 陵 留 鸬 辂 赂 栾 挛 倮 珞 捋 旅 虑 耄 拿 孬
		脑 馁 能 娘 恁 脓 诺 恧 衄 哦 秦 逎 热 蚋 偌 晒 晌 烧 晟 恕 朔 趿
		郯 谈 袒 唐 倘 绦 陶 套 特 疼 剔 绨 倜 逖 悌 祧 调 珽 通 透 徒 涂
		鸵 娲 袜 顽 挽 倭 娭 玺 夏 晓 烜 珣 烟 鸯 秧 烊 珧 舀 窈 晔 烨 旃
		盏 展 站 哲 祯 振 朕 值 贽 致 晊 秩 舯 衷 冢 逐 烛 罜 捉 倬 赀 笫
		恣`,
		`欸 皑 捭 蛃 晡 阐 绰 蛏 眵 敕 逴 婥 凑 逮 袋
		聃 掸 啖 惮 弹 蛋 裆 盗 悼 羝 谛 掂 惦 谍 啶 断 惇 掇 敚 舵 鸸 烽
		晗 焓 焊 斛 焕 绩 接 琎 觖 龛 啦 翋 赉 啷 琅 廊 勒 累 梨 犁 理 蛎
		唳 粝 粒 琏 脸 殓 梁 辆 聊 捩 琌 聆 蛉 翎 羚 绫 领 琉 绺 聋 隆 偻
		颅 舻 掳 鹿 逯 鸾 掠 逻 脶 猡 绿 略 焖 捺 赧 捻 您 胬 喏 戚 婼 酞
		探 焘 掏 啕 惕 甜 掭 粜 停 屠 豚 脱 庹 唾 烷 脘 惋 绾 惘 焐 晞 烯
		谑 绽 章 辄 职 鸷 掷 痔 窒 啁 猪 舳 啭 骓 缀 啄 谘 缁 眦 偬`,

		`掰 焙 焯 掣 程 裎 欻 辍 搭 嗒 傣 殚 氮 谠 道
		登 觌 睇 缔 跌 揲 耋 喋 鼎 腚 董 痘 赌 短 缎 敦 遁 惰 焚 缓 践 焦
		嗟 晶 就 厥 焜 喇 腊 睐 阑 揽 缆 稂 痨 愣 鹂 喱 犂 雳 跞 詈 傈 痢
		裢 裣 量 晾 裂 硫 搂 喽 鲁 琭 禄 脔 缕 遖 喃 揇 婻 蛲 猱 辇 傩 晴
		赎 遂 塔 跆 毯 赕 傥 铽 提 啼 鹈 缇 腆 蜓 婷 艇 痛 酡 跎 腕 辋 喔
		窝 幄 循 巽 琰 焰 焱 蛘 谣 媛 暂 蛰 臸 智 痣 骘 彘 惴 缒 琢 辎 粢`,

		`摆 稗 煲 煏 煸 缠 塍 嗤 痴 媸 褚 辏 腠 瘅 亶
		嗲 殿 牒 叠 窦 督 煅 裰 躲 跺 觥 煳 煌 幌 跻 煎 赖 耢 酪 傫 蜊 缡
		粮 趔 零 龄 馏 旒 骝 遛 鲈 路 裸 煤 谬 睦 腩 瑙 鲇 暖 搦 稔 摄 遢
		鲐 摊 痰 搪 慆 腾 誊 裼 阗 龆 跳 嗵 蜕 煺 腽 畹 煨 蜗 瑄 煊 腰 摇
		徭 遥 虞 煜 詹 搌 鄣 障 照 罩 蜇 谪 置 雉 趑 訾 觜`,

		`叆 暧 熬 憏 踌 瞅 褡 靼 瘩 嘀 嫡 骶 端 鲕 裹
		摎 谲 蜡 瘌 辣 谰 罱 螂 嫪 嫘 缧 酹 嘞 璃 嫠 踉 僚 寥 撂 廖 粼 熘
		瘘 骡 摞 雒 缪 鼐 嫩 熔 煽 裳 谭 耥 瑭 韬 慝 舔 蜩 褪 箨 蜿 熄 鄩
		鞅 瑶 毓 摘 辗 獐 彰 嫜 幛 肈 遮 赘 禚 龇`,

		`僾 熛 噌 嘲 撤 撑 踟 憃 踔 龊 骴 撮 鞑 儋 德
		踮 蝶 齑 瑾 撅 噘 獗 褴 黎 鲡 鲤 鲢 撩 嘹 獠 寮 缭 遴 瘤 耧 蝼 撸
		噜 辘 戮 熳 蝻 撵 噢 僻 飘 熵 踏 瘫 羰 膛 躺 趟 滕 踢 题 髫 鲦 璇
		鹞 熠 熨 璋 赭 踬 膣 觯 撰 馔`,

		`薆 瞠 螭 鲷 蹀 憝 踱 燔 斓 懒 擂 罹 魉 燎 辚
		廪 懔 膦 鲮 鹨 癃 窿 氇 瘰 蟆 鲶 耨 燃 燊 燧 獭 螗 糖 醍 蹄 曈 暾
		橐 熹 燚 燠 燏 赠 瘴 辙 褶 鹧 臻 踵 髭 鲻`,

		`戴 黛 蹈 鲽 餲 爵 儡 臁 鹩 磷 瞵 璐 螺 麋 黏
		懦 赡 曙 騃 蹋 醣 螳 嚏 瞳 疃 臀 魍 龌 襄 燮 繇 赢 燥 蟑 螽 擢`,

		`雠 矁 戳 鞮 癜 邋 癞 髅 鹭 鳎 餮 曛 鳐 曜 瞻`,

		`爆 蹭 颤 魑 歠 蹲 蹶 鳓 羸 蠊 酃 蠃 曝 蹻 鼗
		瓆`,
		`嚼 矍 黧 醴 鳞 瓐 糯 鼍 曦 骧 耀 躅`,

		`癫 爝 鳢 躏 曩 鳣`,

		`躐 驎 囊 饕`,

		`攫 麟`,

		`纛 蠹`,

		`鬣 囔 馕 攮`,
	}
	//土
	tu = Charset{
		` 一 乙`,

		` 又`,

		` 个 己 山 土 丸 卫 兀 丫 也 亿 尢 于`,

		` 厄 切 瓦 王 韦 为 卬 夭 以 忆 尹 引 尤 友 与
		予 曰 允`,

		` 艾 凹 鸟 圣 戊 阢 央 叶 永 用 由 右 幼 邘 孕
		仔`,

		` 吖 安 充 地 圪 艮 圭 灰 圾 岌 圹 讴 圮 屺 似
		戍 吐 圩 伟 圬 邬 伍 仵 戌 压 伢 亚 讶 延 闫 羊 阳 爷 伊 衣 圯 夷
		屹 亦 异 因 阴 优 有 迂 纡 屿 宇 羽 约 圳`,

		` 阿 芺 岙 岜 坝 坂 坌 辰 肚 坊 坟 附 岗 坏 矶
		均 坎 坑 块 岚 坜 牡 呕 怄 妑 圻 岐 岍 岖 坍 坛 秃 完 违 围 帏 闱
		纬 位 呜 迕 庑 怃 忤 坞 氙 岘 轩 岈 迓 呀 冶 邺 医 诒 矣 抑 呓 邑
		佚 役 吲 饮 迎 应 佣 甬 攸 忧 邮 犹 卣 佑 玙 欤 余 园 员 远 狁 运
		址 坠`,

		` 肮 垇 坳 坢 衩 诞 坻 坫 岽 矾 废 坩 矸 岣 岵
		画 话 岬 坷 岢 矿 岿 坤 垃 岭 垅 垄 垆 峁 岷 坶 坭 拗 瓯 欧 殴 爬
		帕 怕 坯 坪 坡 坦 坨 宛 往 旺 玮 委 瓮 岫 盱 诩 押 岩 奄 怏 肴 耶
		夜 依 祎 饴 怡 迤 峄 佾 怿 诣 茔 拥 咏 呦 侑 盂 臾 育 鸢 玥 昀 郓
		征 肫`,

		` 哀 按 袄 砭 垞 昶 砗 城 垫 垤 垌 峒 砘 垛 垩
		垡 费 砜 垓 垢 闺 胡 砉 垲 砍 垦 垮 奎 垒 峦 娈 垴 鸥 趴 盆 砒 砌
		牵 峤 窃 埏 垧 哇 娃 威 畏 胃 诬 屋 侮 误 峡 型 勋 峋 鸦 哑 垭 砑
		娅 咽 恹 匽 砚 养 垚 姚 要 咿 咦 贻 姨 舣 音 姻 垠 俑 勇 幽 疣 羑
		囿 宥 诱 舁 禹 垣 爰 院 郧 陨 恽 峥 砖 窀`,

		`啊 埃 唉 挨 砹 爱 俺 胺 案 盎 敖 峬 埕 础 砥
		峨 恶 恩 砝 砩 埂 埚 监 砬 崃 崂 砺 砾 埒 砻 埋 袅 砰 破 埔 峭 容
		砷 砣 诿 娓 軎 翁 唔 捂 娴 顼 埙 鸭 琊 蚜 氩 胭 盐 艳 晏 宴 氧 恙
		眙 胰 酏 益 氤 殷 狺 蚓 狳 馀 谀 彧 眢 鸳 冤 袁 圆 阅 晕 砸 砟 砧
		轾 准`,

		`捱 庵 谙 埯 唵 崩 埠 埭 硐 堆 堕 硌 崮 惯 硅
		崞 黄 基 崨 崛 崆 堀 逵 壸 硭 埝 啪 盘 培 堋 埤 畦 崎 堑 硗 埽 硕
		眭 堂 窕 眺 堍 婉 唯 帷 惟 维 谓 尉 釫 牾 硒 硖 崤 硎 勖 崖 痖 焉
		崦 阉 偃 痒 掖 揶 野 猗 移 痍 埸 逸 翌 寅 隐 婴 庸 恿 悠 蚰 蚴 隅
		域 欲 跃 殒 酝 崭 埴`,

		`隘 啽 媕 揞 晻 媪 奡 傲 奥 堡 堛 嵖 堾 堤 奠
		堞 黑 堠 硷 堪 喹 塄 嵝 嵋 嵚 确 嵘 蛙 崴 琬 琟 嵬 猥 喂 猬 温 握
		硪 痦 婺 骛 翕 遐 翔 硝 揠 腌 蜒 堰 崵 崾 腋 揖 壹 堙 喑 愔 瑛 鱿
		釉 喁 嵛 琙 鼋 援 缘 越 粤 愠 崽 跖 蛭 嵫`,

		`矮 碍 嗳 嗌 嫒 鹌 腤 暗 嶅 遨 嗷 廒 骜 塝 碑
		碚 碜 碘 碉 碇 碓 痱 觟 嵴 跬 碌 硼 碰 嵊 嵩 塑 碎 塌 塘 填 碗 韪
		艉 痿 嗡 蜈 鹉 瑕 睚 衙 鄢 颐 裔 意 鄞 雍 蛹 猷 瘀 瑀 誉 塬 猿 氲
		韫 韵 稚`,

		`瑷 璈 獒 碥 碴 墋 磁 磋 碲 碟 鲑 碱 碣 境 墚
		墁 墙 墒 塾 墅 碳 鲔 稳 寤 鹜 墟 嘘 碹 嫣 旖 夤 撄 嘤 罂 缨 墉 慵
		踊 辕 翟 嶂`,
		`鞍 懊 磅 嶓 嶒 墀 嶝 墩 磙 嘿 蝴 糊 磕 蝰 磊
		嶙 碾 豌 慰 鞋 糈 噎 靥 璎 影 蝣 牖 墺 豫 增 磔`,

		`聱 螯 壁 衡 磺 磨 碛 融 歙 燕 噫 殪 瘾 鹦 壅
		螈`,
		`癌 闇 鮟 醠 謷 磴 礅 壕 壑 礁 嬲 嶷 翳 臆 膺
		臃 黝 龠`,
		`盫 鳌 蹦 璧 礓 礞 黟 彝 癔 鼬`,

		`爊 礤 巅 疆 嬿 繶 鳙`,

		`巉 壤 巍 鼯`,

		`礴 蠡`,

		`鹳 懿 饔`,

		`罐`,
	}
)

var charList = []Charset{
	//"钅"
	char_jin,
	//"木"
	char_mu,
	//"水"
	char_shui,
	//"火"
	char_huo,
	//"土"
	char_tu,
	//"艹"
	char_cao,
	//"氵"
	char_3shui,
	//"月"
	char_yue,
	//"宀"
	char_gai,
	//"门"
	char_men,
	//"冖"
	char_mi,
	//"口"
	char_kou,
	//"广"
	char_guang,
	//"山"
	char_shan,
	//"爫"
	char_zhao,
	//"亠"
	char_tou,
}
var (
	//部首: 钅
	char_jin = Charset{
		"5|钅|jīn", "6|钆|gá", "6|钇|yǐ", "7|钉|dìng,dīng", "7|钌|liào,liǎo", "7|钋|pō", "7|钊|zhāo", "7|针|zhēn", "8|钗|chāi", "8|钏|chuàn", "8|钓|diào", "8|钒|fán", "8|钔|mén", "8|钕|nǚ", "8|钎|qiān", "8|钐|shàn,shān", "8|钍|tǔ", "8|钖|yáng", "8|钑|sà", "9|钯|bǎ", "9|钣|bǎn", "9|钡|bèi", "9|钚|bù", "9|钞|chāo", "9|钭|dǒu", "9|钝|dùn", "9|钫|fāng", "9|钙|gài", "9|钢|gàng,gāng", "9|钩|gōu", "9|钬|huǒ", "9|钜|jù", "9|钧|jūn", "9|钪|kàng", "9|钠|nà", "9|钮|niǔ", "9|钤|qián", "9|钦|qīn", "9|钛|tài", "9|钨|wū", "9|钘|xíng", "9|钥|yào,yuè", "9|钟|zhōng", "10|铋|bì", "10|钵|bō", "10|钹|bó", "10|铂|bó", "10|钸|bū", "10|钿|diàn,tián", "10|铎|duó", "10|钴|gǔ", "10|钾|jiǎ", "10|钶|kē", "10|铃|líng", "10|铆|mǎo", "10|钼|mù", "10|铌|ní", "10|铍|pí,pī", "10|钷|pǒ", "10|铅|qiān,yán", "10|钱|qián", "10|钳|qián", "10|铈|shì", "10|铄|shuò", "10|铊|tā", "10|钽|tǎn", "10|铁|tiě", "10|铉|xuàn", "10|铀|yóu", "10|钰|yù", "10|钺|yuè", "10|钲|zhēng", "10|钻|zuàn,zuān", "10|铇|bào", "11|铵|ǎn", "11|铲|chǎn", "11|铛|chēng,dāng", "11|铖|chéng", "11|铳|chòng", "11|铞|diào", "11|铫|diào,yáo", "11|铤|dìng,tǐng", "11|铥|diū", "11|铒|èr,ěr", "11|铬|gè", "11|铪|hā", "11|铧|huá", "11|铗|jiá", "11|铰|jiǎo", "11|铠|kǎi", "11|铐|kào", "11|铑|lǎo", "11|铝|lǚ", "11|铓|máng", "11|铭|míng", "11|铙|náo", "11|铨|quán", "11|铷|rú", "11|铯|sè", "11|铩|shā", "11|铴|tàng,tāng", "11|铜|tóng", "11|铣|xǐ,xiǎn", "11|铦|xiān", "11|铏|xíng", "11|铘|yé", "11|铱|yī", "11|铟|yīn", "11|银|yín", "11|铕|yǒu", "11|铡|zhá", "11|铮|zhèng,zhēng", "11|铚|zhì", "11|铢|zhū", "11|铔|yā", "12|锕|ā", "12|锄|chú", "12|锉|cuò", "12|锇|é", "12|锋|fēng", "12|锆|gào", "12|锅|guō", "12|锏|jiàn,jiǎn", "12|锔|jú,jū", "12|锎|kāi", "12|铿|kēng", "12|铼|lāi", "12|锒|láng", "12|铹|láo", "12|锂|lǐ", "12|链|liàn", "12|锍|liǔ", "12|锊|lüè", "12|铺|pù,pū", "12|锓|qǐn", "12|锐|ruì", "12|锁|suǒ", "12|铽|tè", "12|锑|tī", "12|铻|wú,yǔ", "12|销|xiāo", "12|锌|xīn", "12|锈|xiù", "12|铸|zhù", "12|锃|zèng", "13|锛|bēn", "13|锤|chuí", "13|错|cuò", "13|锝|dé", "13|锭|dìng", "13|锢|gù", "13|锪|huō", "13|键|jiàn", "13|锦|jǐn", "13|锯|jù", "13|锩|juǎn", "13|锞|kè", "13|锟|kūn", "13|锣|luó", "13|锚|máo", "13|锰|měng", "13|锘|nuò", "13|锫|péi", "13|锖|qiāng", "13|锬|tán", "13|锡|xī", "13|锨|xiān", "13|锳|yīng", "13|锗|zhě", "13|锧|zhì", "13|锥|zhuī", "13|锱|zī", "13|锜|qí", "13|锠|chāng", "14|锿|āi", "14|锸|chā", "14|镀|dù", "14|锻|duàn", "14|锷|ě", "14|镄|fèi", "14|锾|huán", "14|锽|huáng", "14|镌|juān", "14|锴|kǎi", "14|镂|lòu", "14|镅|méi", "14|镁|měi", "14|锵|qiāng", "14|锹|qiāo", "14|锲|qiè", "14|锶|sī", "14|锼|sōu", "14|镃|zī", "14|锺|zhōng", "15|镑|bàng", "15|镈|bó", "15|镐|gǎo,hào", "15|镉|gé", "15|镓|jiā", "15|镏|liú,liù", "15|镆|mò", "15|镎|ná", "15|镊|niè", "15|镍|niè", "15|镋|tǎng", "15|镒|yì", "15|镇|zhèn", "15|镔|bīn", "15|镕|róng", "10||pō", "16|镚|bèng", "16|镖|biāo", "16|镝|dí,dī", "16|镜|jìng", "16|镠|liú", "16|镘|màn", "16|镗|táng,tāng", "16|镛|yōng", "16|镞|zú", "16|镙|luó", "16|镟|xuàn", "17|镩|cuàn,cuān", "17|镫|dèng", "17|镦|duì,dūn", "17|镢|jué", "17|镧|lán", "17|镣|liào", "17|镥|lǔ", "17|镤|pú", "17|镨|pǔ", "17|镪|qiǎng,qiāng", "17|镡|xín", "18|镮|huán", "18|镬|huò", "18|镭|léi", "18|镰|lián", "18|镱|yì", "18|镯|zhuó", "19|镲|chǎ", "20|镴|là", "20|镳|biāo", "15||shàn", "15||shàn", "16||zhuō", "22|镶|xiāng", "22|镵|chán", "25||jué"}
	//部首: 木
	char_mu = Charset{
		"4|木|mù", "4|朩|pin", "5|本|běn", "5|末|mò", "5|术|shù,zhú", "5|未|wèi", "5|札|zhá", "5|朮|shù", "5|朰|tewule", "6|朳|bā", "6|朵|duǒ", "6|机|jī", "6|朴|piáo,pò,pō,pǔ", "6|权|quán", "6|杀|shā", "6|朽|xiǔ", "6|杂|zá", "6|朱|zhū", "6|朶|duǒ", "6|朼|bǐ", "6|朾|chéng", "6|朿|cì", "6|朷|dāo", "6|朹|qiú", "6|朻|jiū", "6|朸|lì", "6|朲|rén", "6|杁|ru", "7|杓|biāo,sháo", "7|材|cái", "7|杈|chà,chā", "7|村|cūn", "7|杕|dì,duǒ", "7|杜|dù", "7|杆|gǎn,gān", "7|杠|gàng,gāng", "7|极|jí", "7|来|lái,lāi", "7|李|lǐ", "7|杩|mà", "7|杧|máng", "7|杞|qǐ", "7|杉|shā,shān", "7|束|shù", "7|条|tiáo", "7|杌|wù", "7|杏|xìng", "7|杨|yáng", "7|杝|yí", "7|杙|yì", "7|杖|zhàng", "7|杇|wū", "7|杘|chì", "7|杒|rèn", "7|杋|fán", "7|杚|gū", "7|杛|gōng", "7|杢|jié", "7|杦|jiu", "7|杗|máng", "7|杄|qiān", "7|杣|mián", "7|杔|tuō", "7|杤|wɑn", "7|杅|yú", "7|杊|xún", "7|杍|zǐ", "8|枊|àng", "8|杷|bà,pá", "8|板|bǎn", "8|杯|bēi", "8|枨|chéng", "8|杻|chǒu,niǔ", "8|杵|chǔ", "8|枞|cōng,zōng", "8|枓|dǒu", "8|枋|fāng", "8|枌|fén", "8|枫|fēng", "8|杲|gǎo", "8|构|gòu", "8|柜|guì,jǔ", "8|果|guǒ", "8|杭|háng", "8|枑|hù", "8|枧|jiǎn", "8|杰|jié", "8|枥|lì", "8|林|lín", "8|枚|méi", "8|杪|miǎo", "8|枇|pí", "8|枪|qiāng", "8|枘|ruì", "8|枢|shū", "8|杸|shū", "8|松|sōng", "8|枉|wǎng", "8|析|xī", "8|枭|xiāo", "8|杳|yǎo", "8|枣|zǎo", "8|枕|zhěn", "8|枝|zhī", "8|杼|zhù", "8|東|dōng", "8|枏|nán", "8|柹|shì", "8|杴|xiān", "8|杮|fèi", "8|枈|pī", "8|杽|chǒu", "8|杶|chūn", "8|枤|dì", "8|枙|ě", "8|柉|fán", "8|枎|fú", "8|杹|huà", "8|枅|jī", "8|枃|jìn", "8|枦|lú", "8|枆|máo", "8|枬|zhān", "8|枡|shēng", "8|杫|sì", "8|枀|sōng", "8|枩|sōng", "8|枂|wò", "8|杺|xīn", "8|枔|xín", "8|枒|yā", "8|枖|yǎo", "8|枍|yì", "8|杬|yuán", "8|枟|yùn", "8|枛|zhào", "8|枠|huà", "8||gāng", "9|柏|bǎi,bó,bò", "9|柈|bàn,pán", "9|枹|bāo,fú", "9|柲|bì", "9|标|biāo", "9|柄|bǐng", "9|查|chá,zhā", "9|柽|chēng", "9|柢|dǐ", "9|栋|dòng", "9|柮|duǒ", "9|柂|duǒ", "9|柎|fū", "9|柑|gān", "9|枸|gǒu,gōu,jǔ", "9|枷|jiā", "9|架|jià", "9|柬|jiǎn", "9|柩|jiù", "9|柯|kē", "9|枯|kū", "9|栏|lán", "9|栎|lì,yuè", "9|柃|líng", "9|柳|liǔ", "9|栊|lóng", "9|栌|lú", "9|某|mǒu", "9|柰|nài", "9|柅|nǐ", "9|柠|níng", "9|枰|píng", "9|柒|qī", "9|染|rǎn", "9|柔|róu", "9|栅|shān,zhà", "9|柿|shì", "9|树|shù", "9|柁|tuó", "9|柝|tuò", "9|柙|xiá", "9|枵|xiāo", "9|枻|yì", "9|柚|yóu,yòu,zhú", "9|柞|zhà", "9|栈|zhàn", "9|柘|zhè", "9|栀|zhī", "9|枳|zhǐ", "9|栉|zhì", "9|柣|zhì", "9|柊|zhōng", "9|柱|zhù,zhǔ", "9|枲|xǐ", "9|柟|nán", "9|柺|guǎi", "9|柵|shān", "9|栁|liǔ", "9|栆|zɑo", "9|柪|āo", "9|柭|bā", "9|柸|bēi", "9|柀|bǐ", "9|柨|bù", "9|査|chá", "9|枱|sì", "9|柌|cí", "9|柋|dài", "9|柦|dàn", "9|柫|fú", "9|柧|gū", "9|枴|guǎi", "9|柇|hé", "9|柾|jiù", "9|柆|lā", "9|栃|lì", "9|桞|liǔ", "9|栂|méi", "9|枺|mò", "9|枿|niè", "9|桏|qióng", "9|栄|róng", "9|栍|sɑying", "9|桒|sāng", "9|柖|sháo", "9|柛|shēn", "9|枾|shì", "9|柕|mào", "9|柶|sì", "9|柗|sōng", "9|枮|xiān", "9|柍|yǎng", "9|柼|yǎo", "9|枼|yè", "9|栐|yǒng", "9|柤|zhā", "9|柷|zhù", "10|桉|ān", "10|案|àn", "10|梆|bāng", "10|栟|bīng", "10|柴|chái,zhài", "10|档|dàng", "10|栭|ér", "10|栿|fú", "10|格|gé,gē", "10|根|gēn", "10|栱|gǒng", "10|栝|guā,kuò", "10|桄|guàng,guāng", "10|桂|guì", "10|桧|guì,huì", "10|桁|háng,héng", "10|核|hé,hú", "10|桦|huà", "10|桓|huán", "10|桨|jiǎng", "10|校|jiào,xiào", "10|桔|jié,jú", "10|桀|jié", "10|桕|jiù", "10|桊|juàn", "10|栲|kǎo", "10|框|kuàng", "10|栳|lǎo", "10|栗|lì", "10|栾|luán", "10|栖|qī,xī", "10|桤|qī", "10|桥|qiáo", "10|桡|ráo", "10|桑|sāng", "10|栓|shuān", "10|桃|táo", "10|梃|tìng,tǐng", "10|桐|tóng", "10|桅|wéi", "10|栩|xǔ", "10|栒|xún", "10|桠|yā", "10|样|yàng", "10|栘|yí", "10|栽|zāi", "10|桢|zhēn", "10|桎|zhì", "10|株|zhū", "10|桩|zhuāng", "10|桌|zhuō", "10|條|tiáo", "10|栔|qì", "10|栢|bǎi", "10|栧|yì", "10|栰|fá", "10|栞|kān", "10|栤|bìng", "10|梴|chān", "10|棦|chēng", "10|栦|chóu", "10|桘|chuí", "10|栜|sè", "10|栨|cì", "10|桗|duò", "10|栮|ěr", "10|栫|jiàn", "10|桝|jie", "10|桍|kū", "10|栛|lì", "10|栵|liè", "10|梠|lǚ", "10|桙|yú", "10|梛|nuó", "10|栠|rěn", "10|栣|rěn", "10|桇|rú", "10|栻|shì", "10|桋|yí", "10|桛|kɑsei", "10|栙|xiáng", "10|桖|xuè", "10|桪|xún", "10|枽|yè", "10|栺|zhī", "10|栶|yīn", "10|桜|ying", "10|柡|yǒng", "10|栯|yǒu", "10|桚|zā", "10|栴|zhān", "10|桟|zhàn", "10|栕|chén", "10|栚|zhèn", "10|栥|zī", "10|栬|zuì", "11|桮|bēi", "11|梐|bì", "11|梣|cén", "11|梵|fàn", "11|棻|fēn", "11|桴|fú", "11|梗|gěng", "11|梏|gù", "11|检|jiǎn", "11|梮|jū", "11|桷|jué", "11|梱|kǔn", "11|梾|lāi", "11|桹|láng", "11|梨|lí", "11|梿|lián", "11|梁|liáng", "11|棂|líng", "11|梅|méi", "11|梦|mèng", "11|桲|po", "11|桼|qī", "11|梫|qǐn", "11|桵|ruǐ", "11|梢|shāo", "11|梳|shū", "11|桫|suō", "11|梭|suō", "11|梼|táo", "11|梯|tī", "11|桯|tīng", "11|桶|tǒng", "11|梧|wú", "11|械|xiè", "11|梽|zhì", "11|棁|zhuō", "11|梓|zǐ", "11|桺|liǔ", "11|梘|jiǎn", "11|梩|sì", "11|桿|gǎn", "11|梟|xiāo", "11|梔|zhī", "11|梎|āo", "11|梖|bèi", "11|桳|bèn", "11|梹|bīn", "11|梌|tú", "11|桭|chén", "11|椘|chǔ", "11|梊|dì", "11|梑|dí", "11|梪|dòu", "11|梤|fēn", "11|桻|fēng", "11|梻|xikimi", "11|梒|hán", "11|椛|huɑ", "11|梙|huàn", "11|梡|kuǎn", "11|梞|jì", "11|楖|jí", "11|梜|jiā", "11|桱|jìng", "11|梷|jìng", "11|梋|xuān", "11|桾|jūn", "11|桰|guā", "11|梸|lí", "11|梇|lòng", "11|梈|pēng", "11|梂|qiú", "11|梕|rèn", "11|桬|shā", "11|梥|sōng", "11|梀|sù", "11|梚|wǎn", "11|梶|wěi", "11|桽|wěn", "11|桸|xī", "11|梺|xiɑ", "11|梬|yǐng", "11|梄|yǒu", "11|梍|zào", "11|梉|zhuāng", "11|梲|zhuō", "12|棒|bàng", "12|棓|bàng,bèi", "12|椑|bēi,pí", "12|楮|chǔ", "12|棰|chuí", "12|椎|chuí,zhuī", "12|棣|dì", "12|椟|dú", "12|棐|fěi", "12|棼|fén", "12|棡|gāng", "12|棺|guān", "12|棍|gùn,gǔn", "12|椁|guǒ", "12|楛|hù,kǔ", "12|棔|hūn", "12|棘|jí", "12|楗|jiàn", "12|椒|jiāo", "12|椐|jū", "12|椈|jú", "12|椇|jǔ", "12|棵|kē", "12|榔|láng", "12|棱|lēng,líng", "12|椋|liáng", "12|椤|luó", "12|棉|mián", "12|棑|pái", "12|棚|péng", "12|椪|pèng", "12|棋|qí", "12|棨|qǐ", "12|椠|qiàn", "12|棬|quān", "12|森|sēn", "12|棯|shēn", "12|棠|táng", "12|椭|tuǒ", "12|棪|yǎn", "12|椰|yē", "12|椅|yǐ,yī", "12|棫|yù", "12|棹|zhào", "12|椥|zhī", "12|植|zhí", "12|椓|zhuó", "12|棕|zōng", "12|棗|zǎo", "12|椉|chéng", "12|棄|qì", "12|琹|qín", "12|棶|lái", "12|棖|chéng", "12|棊|qí", "12|棟|dòng", "12|椏|yā", "12|棧|zhàn", "12|棃|lí", "12|椗|dìng", "12|椀|wǎn", "12|極|jí", "12|椝|guī", "12|椕|bīn", "12|棅|bǐng", "12|棌|cǎi", "12|棎|chán", "12|椙|chɑng", "12|棽|chēn", "12|椆|chóu", "12|棇|cōng", "12|椊|zú", "12|棤|què", "12|椡|dɑo", "12|棏|dé", "12|椣|diɑn", "12|棥|fán", "12|棴|fú", "12|椨|fu", "12|椩|geng", "12|棝|gù", "12|椢|guì", "12|棞|jùn", "12|楇|guō", "12|椃|háo", "12|検|jiǎn", "12|椄|jiē", "12|椌|qiāng", "12|棙|lì", "12|椂|lù", "12|棆|lún", "12|椚|men", "12|椧|mieng", "12|棿|ní", "12|椖|péng", "12|棲|qī", "12|棈|qiàn", "12|棾|qíng", "12|椦|quān", "12|楉|ruò", "12|椫|shàn", "12|椮|sēn", "12|棷|zōu", "12|棢|wǎng", "12|椞|xì", "12|楧|yǎng", "12|棭|yì", "12|椬|yí", "12|棛|yù", "12|棜|yù", "12|楰|yú", "12|棳|zhuō", "12|椔|zī", "12|棸|zōu", "13|楂|chá,zhā", "13|槎|chá,zhà", "13|榇|chèn", "13|楚|chǔ", "13|椽|chuán", "13|槌|chuí", "13|椿|chūn", "13|楤|cōng,sǒng", "13|椴|duàn", "13|楯|dùn,shūn", "13|概|gài", "13|榾|gǔ", "13|槐|huái", "13|楫|jí", "13|楷|jiē,kǎi", "13|楬|jié", "13|榉|jǔ", "13|榄|lǎn", "13|楞|léng,lèng", "13|楝|liàn", "13|楼|lóu", "13|榈|lǘ", "13|楣|méi", "13|楠|nán", "13|楄|pián", "13|榀|pǐn", "13|楸|qiū", "13|椹|shèn,zhēn", "13|楒|sī", "13|榃|tán", "13|椳|wēi", "13|楔|xiē", "13|楦|xuàn", "13|椸|yí", "13|楹|yíng", "13|楢|yóu", "13|榆|yú", "13|楳|méi", "13|業|yè", "13|楊|yáng", "13|楥|xuàn", "13|楩|pián", "13|椶|zōng", "13|榘|jǔ", "13|楓|fēng", "13|槩|gài", "13|楍|běn", "13|楅|bī", "13|榋|chu", "13|槆|chūn", "13|楱|còu", "13|楴|dì", "13|楪|dié", "13|椯|duǒ", "13|椱|fù", "13|椷|jiān", "13|楁|hé", "13|楜|hú", "13|楻|huáng", "13|椲|wěi", "13|楎|huī", "13|椵|jiǎ", "13|椾|jiān", "13|楐|jiè", "13|楶|jié", "13|楏|kuí", "13|楑|kuí", "13|楋|là", "13|楽|lè", "13|楙|máo", "13|楘|mù", "13|榌|bī", "13|椺|xí", "13|楾|hɑnizɑwu", "13|榵|róng", "13|楺|róu", "13|榊|shen", "13|榁|mule", "13|榙|tā", "13|楟|tíng", "13|榳|tíng", "13|楕|tuǒ", "13|楲|wēi", "13|榅|wēn", "13|楃|wò", "13|楿|kɑtuilɑ", "13|楈|xū", "13|椻|yàn", "13|椼|yǎn", "13|楌|yán", "13|楆|yāo", "13|楀|yǔ", "13|楡|yú", "13|棩|yuān", "13|楨|zhēn", "14|榜|bàng,bǎng", "14|槟|bīn,bīng", "14|榱|cuī", "14|榧|fěi", "14|榑|fú", "14|槔|gāo", "14|槁|gǎo", "14|槅|gé", "14|榥|huàng", "14|槚|jiǎ", "14|槛|jiàn,kǎn", "14|榤|jié", "14|榼|kē", "14|榴|liú", "14|榠|míng", "14|模|mó,mú", "14|槃|pán", "14|榷|què", "14|榕|róng", "14|槊|shuò", "14|榫|sǔn", "14|榻|tà", "14|槄|tāo", "14|樋|tōng", "14|榲|wēn", "14|榭|xiè", "14|榍|xiè", "14|榨|zhà", "14|榛|zhēn", "14|榰|zhī", "14|槠|zhū", "14|槖|tuó", "14|榦|gàn", "14|槑|méi", "14|槇|diān", "14|構|gòu", "14|榎|jiǎ", "14|槤|lián", "14|槓|gàng", "14|榪|mà", "14|樺|huà", "14|榿|qī", "14|槍|qiāng", "14|槀|gǎo", "14|槨|guǒ", "14|榮|róng", "14|榖|gǔ", "14|榐|zhǎn", "14|樄|chén", "14|樆|lí", "14|槒|xù", "14|槝|dɑo", "14|槙|diān", "14|槉|jí", "14|榢|jià", "14|榗|jiàn", "14|樃|láng", "14|槏|qiǎn", "14|槞|lóng", "14|榓|mì", "14|槈|nòu", "14|榒|nuò", "14|槰|pèng", "14|樥|péng", "14|榩|qián", "14|槗|qiáo", "14|槡|sāng", "14|榝|shā", "14|榺|shèng", "14|榯|shí", "14|榹|sì", "14|榡|sù", "14|槂|sūn", "14|榶|táng", "14|樤|tiáo", "14|榽|xī", "14|樇|xiū", "14|様|yàng", "14|榚|yǎo", "14|榣|yáo", "14|榏|yì", "14|榞|yuán", "14|榬|yuán", "14|榸|zhāi", "14|槜|zuì", "14|槕|zhuō", "14|榟|zǐ", "15|槽|cáo", "15|樘|chēng,táng", "15|樗|chū", "15|樀|dí", "15|樊|fán", "15|橄|gǎn", "15|横|héng,hèng", "15|槲|hú", "15|槥|huì", "15|樫|jiān", "15|槿|jǐn", "15|樛|jiū", "15|槺|kāng", "15|槷|niè", "15|槭|qì", "15|樯|qiáng", "15|橡|xiàng", "15|樱|yīng", "15|樟|zhāng", "15|橥|zhū", "15|檛|zhuā", "15|樂|lè", "15|樁|zhuāng", "15|標|biāo", "15|樞|shū", "15|樏|léi", "15|樓|lóu", "15|樅|cōng", "15|樑|liáng", "15|樣|yàng", "15|槳|jiǎng", "15|橢|tuǒ", "15|槹|gāo", "15|槱|yǒu", "15|樔|cháo", "15|樬|cōng", "15|槯|cuī", "15|槢|xí", "15|樚|lù", "15|槪|gài", "15|樌|guàn", "15|槣|jī", "15|槶|guì", "15|槻|guī", "15|槼|guī", "15|槴|hù", "15|槬|huà", "15|槵|huàn", "15|樭|ji", "15|樖|kē", "15|樠|mán", "15|樐|lǔ", "15|槾|màn", "15|橗|méng", "15|樒|mì", "15|樢|niǎo", "15|槧|qiàn", "15|樈|qíng", "15|槫|tuán", "15|権|quán", "15|槮|sēn", "15|樧|shā", "15|樉|shǎng", "15|樎|sù", "15|樕|sù", "15|樰|xue", "15|樮|yɑn", "15|槸|yì", "15|槦|róng", "15|樍|zé", "15|樝|zhā", "15|樜|zhè", "15|樦|zhù", "16|橙|chéng", "16|橱|chú", "16|樲|èr", "16|橘|jú", "16|橛|jué", "16|橹|lǔ", "16|橇|qiāo", "16|樵|qiáo", "16|檎|qín", "16|檠|qíng", "16|橪|rǎn", "16|橤|ruǐ", "16|檨|shē", "16|橦|tóng", "16|橐|tuó", "16|樨|xī", "16|檃|yǐn", "16|橼|yuán", "16|樾|yuè", "16|檇|zuì", "16|樽|zūn", "16|橜|jué", "16|橈|ráo", "16|樹|shù", "16|樷|cóng", "16|樸|pǔ", "16|檝|jí", "16|橋|qiáo", "16|機|jī", "16|橺|xiàn", "16|橴|zɑ", "16|橧|zēng", "16|橕|chēng", "16|橖|táng", "16|檙|chéng", "16|橻|cū", "16|橁|chūn", "16|橽|tà", "16|檤|dào", "16|橂|diàn", "16|橝|tán", "16|橷|dōu", "16|橔|tuí", "16|橃|fá", "16|橎|fǎn", "16|橨|fén", "16|橰|gāo", "16|橭|gū", "16|橫|héng", "16|橞|huì", "16|橶|jǐ", "16|橌|xiàn", "16|橏|zhǎn", "16|橸|jing", "16|樻|guì", "16|橑|liáo", "16|橯|lào", "16|橉|lìn", "16|橊|liú", "16|橮|liǔ", "16|橅|mó", "16|橣|níng", "16|橠|nuó", "16|橬|qián", "16|橩|qióng", "16|橍|rùn", "16|橵|zān", "16|樿|shàn", "16|橳|sheng", "16|橓|shùn", "16|檧|sōng", "16|檖|suì", "16|橆|wú", "16|橀|xī", "16|橲|xi", "16|樳|xún", "16|樴|zhí", "16|橒|yún", "16|樼|zhēn", "16|樶|zuī", "12|﨓|fu", "17|檦|biǎo", "17|檗|bò", "17|檞|jiě", "17|櫆|kuí", "17|檑|lèi", "17|檩|lǐn", "17|檬|méng", "17|檀|tán", "17|檄|xí", "17|檐|yán", "17|檥|yǐ,yī", "17|檉|chēng", "17|檣|qiáng", "17|檔|dàng", "17|檢|jiǎn", "17|檜|guì", "17|櫛|zhì", "17|檘|píng", "17|檚|chǔ", "17|檒|fēng", "17|檊|gàn", "17|檴|huò", "17|檅|huì", "17|檓|huǐ", "17|檕|jì", "17|檟|jiǎ", "17|橿|jiāng", "17|橚|sù", "17|檋|jū", "17|檪|lì", "17|櫣|lián", "17|檁|lǐn", "17|檂|nóng", "17|檏|pǔ", "17|橾|shū", "17|檆|shān", "17|檡|zhái", "17|檈|xuán", "17|檍|yì", "17|檌|zuì", "18|檫|chá", "18|檵|jì", "18|檰|mián", "18|檷|nì", "18|檯|tái", "18|檮|chóu", "18|櫃|guì", "18|檻|jiàn", "18|檸|níng", "18|檳|bīn", "18|檾|qǐng", "18|櫂|zhào", "18|櫈|dèng", "18|櫉|chú", "18|櫄|chūn", "18|檺|gǎo", "18|櫊|ge", "18|櫎|huǎng", "18|櫅|jī", "18|櫭|jué", "18|櫔|lì", "18|櫚|lǘ", "18|櫗|miè", "18|櫁|mì", "18|檽|nòu", "18|櫙|ōu", "18|櫇|pó", "18|檱|qí", "18|櫀|qí", "18|檶|qiān", "18|櫒|sà", "18|檲|tuán", "18|檿|yǎn", "18|檹|yī", "18|檭|yín", "18|檼|yǐn", "18|櫡|zhuó", "14|﨔|ju", "19|櫕|cuán", "19|櫜|gāo", "19|櫞|yuán", "19|櫝|dú", "19|櫫|zhū", "19|櫧|zhū", "19|櫟|lì", "19|櫓|lǔ", "19|櫥|chú", "19|櫖|lǜ", "19|櫠|fèi", "19|櫘|huì", "19|櫤|jiɑng", "19|櫵|qiáo", "19|櫐|lěi", "19|櫑|léi", "19|櫋|mián", "19|櫏|qiān", "19|櫦|qing", "19|櫢|sǒu", "19|櫌|yōu", "19|櫲|yù", "19|櫍|zhì", "20|櫶|xiǎn", "20|櫱|niè", "20|櫽|yǐn", "20|櫨|lú", "20|櫪|lì", "20|櫸|jǔ", "20|櫬|chèn", "20|欂|bó", "20|櫮|è", "20|櫰|huái", "20|櫷|gui", "20|櫴|là", "20|櫹|xiāo", "20|櫯|sū", "20|櫩|yán", "20|櫿|yíng", "21|櫼|jiān", "21|櫳|lóng", "21|櫻|yīng", "21|櫺|líng", "21|權|quán", "21|欄|lán", "21|欌|zɑng", "21|欃|chán", "21|欍|jiu", "21|欅|jǔ", "21|欁|nóng", "21|欀|xiāng", "21|櫾|yòu", "22|欋|qú", "22|欉|cóng", "22|欇|shè", "22|欆|shuāng", "22|欈|wéi", "22|欎|yù", "23|欐|lì", "23|欒|luán", "23|欏|luó", "23|欑|cuán", "23|欕|emi", "24|欓|dǎng", "24|欔|qú", "24|欗|lán", "25|欙|léi", "25|欛|bà", "25|欖|lǎn", "25|欚|lǐ", "25|欝|yù", "25|欘|zhú", "26|欜|náng", "28|欞|líng", "28|欟|guàn"}
	//部首: 水
	char_shui = Charset{
		"4|水|shuǐ", "5|氹|dàng", "5|永|yǒng", "5|氷|bīng", "5|氶|zhěng", "5|氺|shuǐ", "6|汆|cuān", "6|氽|tǔn", "6|氼|nì", "7|汞|gǒng", "7|求|qiú", "7|汖|pìn", "8|沓|dá,tà,tɑ", "8|沊|dàn", "8|汬|jǐng", "8|沀|xù", "8|沝|zhuǐ", "9|泵|bèng", "9|泉|quán", "9|泶|xué", "9|泴|guàn", "9|沗|hóng", "9|沯|zá", "10|浆|jiāng", "10|洯|qiè", "10|泰|tài", "10|洜|luò", "12|淼|miǎo", "12|淾|yǐn", "13|湬|qiū", "14|滎|xíng", "15|漦|chí", "15|滕|téng", "15|潁|yǐng", "15|漿|jiāng", "15|漀|qǐng", "15|漐|zhí", "16|澃|jiǒng", "17|澩|xué", "17|濌|tà", "18|濷|fèi", "20|瀪|fàn", "23|灓|luán", "27|灥|xún"}
	//部首: 火
	char_huo = Charset{
		"4|火|huǒ", "5|灭|miè", "6|灯|dēng", "6|灰|huī", "6|灮|guāng", "6|灳|huī", "6|灱|xiāo", "6|灲|xiāo", "7|灿|càn", "7|灸|jiǔ", "7|灵|líng", "7|灺|xiè", "7|炀|yáng,yàng", "7|灾|zāi", "7|灶|zào", "7|灼|zhuó", "7|災|zāi", "7|灻|chì", "7|灴|hōng", "7|灹|zhà", "7|灷|zhuàn", "8|炒|chǎo", "8|炊|chuī", "8|炖|dùn", "8|炅|guì,jiǒng", "8|炔|guì,quē", "8|炕|hāng,kàng", "8|炜|huī,wěi", "8|炬|jù", "8|炉|lú", "8|炝|qiàng", "8|炆|wén", "8|炘|xīn", "8|炎|yán", "8|炙|zhì", "8|炃|fén", "8|炞|biān", "8|炐|pàng", "8|炗|guāng", "8|炚|guāng", "8|炛|guāng", "8|炌|kài", "8|炏|yán", "8|炓|liào", "8|炑|mù", "8|炄|niǔ", "8|炍|pàn", "8|炋|pī", "8|炇|pū", "8|炈|yì", "8|烎|yín", "8|炂|zhōng", "9|炮|bāo,páo,pào", "9|炳|bǐng", "9|炽|chì", "9|炟|dá", "9|烀|hū", "9|炯|jiǒng", "9|烂|làn", "9|炼|liàn", "9|炻|shí", "9|烁|shuò", "9|炱|tái", "9|炭|tàn", "9|烃|tīng", "9|炫|xuàn", "9|炸|zhá,zhà", "9|炷|zhù", "9|炧|xiè", "9|炤|zhào", "9|炦|bá", "9|炪|zhuō", "9|炥|fú", "9|炾|huǎng", "9|炣|kě", "9|炩|lìng", "9|炶|shǎn", "9|炲|tái", "9|炵|tōng", "9|炠|xiá", "9|炨|xiè", "9|炴|yǎng", "9|炡|zhēng", "9|炿|zhōu", "9|炢|zhú", "10|烦|fán", "10|烘|hōng", "10|烩|huì", "10|烬|jìn", "10|烤|kǎo", "10|烙|lào,luò", "10|烧|shāo", "10|烫|tàng", "10|烜|xuǎn", "10|烟|yān", "10|烊|yáng,yàng", "10|烨|yè", "10|烛|zhú", "10|烉|huàn", "10|烖|zāi", "10|烔|tóng", "10|烠|huí", "10|烢|chè", "10|烥|chen", "10|烡|guāng", "10|烆|héng", "10|烣|huī", "10|烄|jiǎo", "10|烗|kài", "10|烮|liè", "10|焒|lu", "10|烞|pò", "10|烇|quǎn", "10|烻|yàn", "10|烒|shì", "10|烶|tǐng", "10|烪|uu", "10|烓|wēi", "10|烚|xiá", "10|烍|xiǎn", "10|烌|xiū", "10|烅|xù", "10|烕|miè", "10|烑|yáo", "10|烐|zhōu", "10|烵|zhuó", "11|烽|fēng", "11|焓|hán", "11|焊|hàn", "11|焕|huàn", "11|焗|jú", "11|焌|jùn,qū", "11|烺|lǎng", "11|焖|mèn", "11|烷|wán", "11|焐|wù", "11|烯|xī", "11|烴|tīng", "11|烱|jiǒng", "11|焅|kù", "11|烲|xiè", "11|烾|chì", "11|焍|dì", "11|烰|fú", "11|烸|hǎi", "11|焃|hè", "11|焀|hú", "11|焆|juān", "11|烳|pǔ", "11|烿|róng", "11|焫|ruò", "11|焂|shū", "11|焑|uu", "11|焁|xī", "11|焈|xī", "11|焇|xiāo", "11|烼|xù", "11|焔|yàn", "11|焋|zhuàng", "12|焙|bèi", "12|焯|chāo,zhuō", "12|焠|cuì", "12|焚|fén", "12|煚|jiǒng", "12|焜|kūn", "12|焮|xìn", "12|焰|yàn", "12|焱|yàn", "12|煑|zhǔ", "12|焥|wò", "12|焻|chàng", "12|焧|zǒng", "12|焨|fèng", "12|焤|fǔ", "12|焵|gàng", "12|焿|gēng", "12|焸|xiǒng", "12|煱|guā", "12|焢|hōng", "12|焝|hùn", "12|焳|jué", "12|煡|jìn", "12|焞|tūn", "12|焛|lìn", "12|焾|nemu", "12|焷|pí", "12|焩|píng", "12|焪|qióng", "12|焭|qióng", "12|焼|shāo", "12|焺|shēng", "12|焽|xiǒng", "12|焹|gàng", "12|煀|qū", "12|焟|xī", "12|焬|xī", "12|焲|yì", "12|煐|yīng", "12|焴|yù", "13|煲|bāo", "13|煏|bì", "13|煸|biān", "13|煅|duàn", "13|煳|hú", "13|煌|huáng", "13|煤|méi", "13|煣|róu", "13|煺|tuì", "13|煨|wēi", "13|煖|xuān", "13|煊|xuān", "13|煜|yù", "13|煴|yùn,yūn", "13|煒|wěi", "13|煉|liàn", "13|煙|yān", "13|煠|yè", "13|煩|fán", "13|煗|nuǎn", "13|煬|yáng", "13|煢|qióng", "13|煇|huī", "13|煘|chán", "13|煁|chén", "13|煈|fèng", "13|煂|hè", "13|煥|huàn", "13|煍|jiǎo", "13|煯|jiē", "13|煃|kuǐ", "13|煷|huǒ", "13|煝|mèi", "13|煵|nǎn", "13|煔|shǎn", "13|熍|qióng", "13|煪|qiú", "13|煰|zào", "13|煶|shi", "13|煫|suì", "13|煓|tuān", "13|煟|wèi", "13|煆|xiā", "13|煋|xīng", "13|煄|zhǒng", "14|熇|hè,kào", "14|熘|liū", "14|熔|róng", "14|煽|shān", "14|熥|tōng", "14|熄|xī", "14|燁|yè", "14|熗|qiàng", "14|熒|yíng", "14|熢|péng", "14|熚|bì", "14|煿|bó", "14|煼|chǎo", "14|煾|ēn", "14|熕|gòng", "14|煹|gòu", "14|熆|hé", "14|熀|huǎng", "14|煛|jiǒng", "14|熑|lián", "14|熐|mì", "14|熋|xióng", "14|熌|shǎn", "14|煻|táng", "14|熃|wù", "14|熓|wǔ", "14|熂|xì", "14|熁|xié", "14|熖|yàn", "14|熎|yào", "14|熅|yūn", "14|熉|yún", "15|熛|biāo", "15|熯|hàn", "15|熳|màn", "15|熰|ōu", "15|熵|shāng", "15|熠|yì", "15|熨|yù,yùn", "15|熝|lù", "15|熜|cōng", "15|熣|suī", "15|熩|hù", "15|熿|huáng", "15|熞|jiān", "15|熲|jiǒng", "15|熦|jué", "15|熴|kūn", "15|熮|liǔ", "15|熡|lóu", "15|熭|wèi", "15|熤|yì", "15|熪|yí", "15|熼|yì", "15|熫|zhì", "15|熧|zōng", "16|燔|fán", "16|熸|jiān", "16|燎|liáo,liào,liǎo", "16|燋|qiáo", "16|燃|rán", "16|燊|shēn", "16|燧|suì", "16|燖|xún", "16|燠|yù", "16|燏|yù", "16|燄|yàn", "16|營|yíng", "16|熺|xī", "16|燒|shāo", "16|燀|chǎn", "16|燙|tàng", "16|熾|chì", "16|燉|dùn", "16|燚|yì", "16|燜|mèn", "16|燈|dēng", "16|燌|fén", "16|燪|zǒng", "16|熶|cuàn", "16|燵|tātuī", "16|燑|tóng", "16|燓|fén", "16|燝|zhǔ", "16|燇|jùn", "16|燗|làn", "16|燤|tài", "16|燐|lín", "16|燘|měi", "16|燂|tán", "16|燆|qiāo", "16|燍|sī", "16|熻|xī", "16|燅|xún", "16|熷|zèng", "17|燬|huǐ", "17|燥|sào,zào", "17|燮|xiè", "17|燦|càn", "17|燭|zhú", "17|燴|huì", "17|燷|lán", "17|燛|jiǒng", "17|燣|lán", "17|燫|lián", "17|燯|líng", "17|燶|nóng", "17|燩|què", "17|燰|wēi", "17|燨|xī", "17|熽|xiào", "17|燲|xié", "17|燢|xué", "17|燡|yì", "17|燱|yì", "17|燳|zhào", "18|燹|xiǎn", "18|燻|xūn", "18|爗|yè", "18|燿|yào", "18|燼|jìn", "18|燽|chóu", "18|燺|hè", "18|爀|hè", "18|爌|kuàng", "18|爁|làn", "18|爄|lì", "18|爃|róng", "18|燸|xū", "19|爊|āo", "19|爆|bào", "19|爕|xiè", "19|爍|shuò", "19|爂|biāo", "19|爑|jué", "19|爉|là", "19|爎|liáo", "19|爈|lǜ", "19|爅|mò", "20|爓|yàn", "20|爔|xī", "20|爐|lú", "20|爘|cɑn", "20|爏|lì", "20|爒|liáo", "20|爋|xūn", "21|爝|jué", "21|爚|yuè", "21|爛|làn", "21|爟|guàn", "21|爖|lóng", "21|爙|rǎng", "22|爡|chè", "22|爞|chóng", "22|爜|cóng", "22|爠|qú", "24|爤|làn", "24|爣|tǎng", "25|爥|zhú", "25|爦|lǎn", "28|爧|líng", "30|爨|cuàn", "33|爩|yù"}
	//部首: 土
	char_tu = Charset{
		"3|土|tǔ", "4|圡|tǔ", "4|圠|yà", "5|圣|shèng", "5|圧|yā", "5|圦|kuɑi", "5|圥|lù", "5|圤|pú", "5|圢|tǐng", "6|场|cháng,chǎng,chɑng", "6|地|de,dì", "6|圪|gē", "6|圭|guī", "6|圾|jī", "6|圹|kuàng", "6|圮|pǐ", "6|圩|wéi,xū", "6|圬|wū", "6|圯|yí", "6|在|zài", "6|圳|zhèn", "6|圵|dàng", "6|圶|qià", "6|圱|qiān", "6|圲|qiān", "6|圸|shɑn", "6|圷|xiɑ", "6|圫|yù", "6|圴|zhuó", "6|赱|zǒu", "7|坝|bà", "7|坂|bǎn", "7|坌|bèn", "7|坊|fáng,fāng", "7|坟|fén", "7|坋|fèn", "7|坏|huài", "7|坚|jiān", "7|均|jūn", "7|坎|kǎn", "7|坑|kēng", "7|块|kuài", "7|坜|lì", "7|圻|qí,yín", "7|坍|tān", "7|坛|tán", "7|坞|wù", "7|址|zhǐ", "7|坠|zhuì", "7|坐|zuò", "7|坒|bì", "7|坘|dǐ", "7|坔|dì", "7|坆|méi", "7|坖|jì", "7|圿|jiá", "7|坓|jǐng", "7|坕|jīng", "7|坙|jīng", "7|坈|rǒng", "7|圽|mò", "7|圼|niè", "7|坅|qǐn", "7|坉|tún", "7|坃|xūn", "7|坄|yì", "7|坁|zhǐ", "8|垇|ào", "8|坳|ào", "8|坢|bàn,pǎn", "8|坼|chè", "8|坻|chí,dǐ", "8|垂|chuí", "8|坫|diàn", "8|坩|gān", "8|坷|kě,kē", "8|坤|kūn", "8|垃|lā", "8|垄|lǒng", "8|垆|lú", "8|坭|ní", "8|坯|pī", "8|坪|píng", "8|坡|pō", "8|坦|tǎn", "8|坨|tuó", "8|坿|fù", "8|坵|qiū", "8|坺|fá", "8|垈|dài", "8|坲|fó", "8|坸|gòu", "8|坬|guà", "8|垀|hū", "8|坥|qū", "8|坽|líng", "8|垅|lǒng", "8|坴|lù", "8|坶|mù", "8|垊|min", "8|垉|páo", "8|坮|tái", "8|坣|táng", "8|坹|xuè", "8|坱|yǎng", "8|坧|zhǐ", "8|垁|zhì", "8|坾|zhù", "9|垵|ǎn", "9|垞|chá", "9|城|chéng", "9|垯|dà", "9|垱|dàng", "9|垫|diàn", "9|垤|dié", "9|垌|dòng,tóng", "9|垛|duǒ,duǒ", "9|垩|ě", "9|垡|fá", "9|垓|gāi", "9|垢|gòu", "9|垝|guǐ", "9|垕|hòu", "9|垍|jì", "9|坰|jiōng", "9|垲|kǎi", "9|垦|kěn", "9|垮|kuǎ", "9|垒|lěi", "9|垴|nǎo", "9|垧|shǎng", "9|型|xíng", "9|垭|yà", "9|埏|yán", "9|垟|yáng", "9|垚|yáo", "9|垠|yín", "9|垣|yuán", "9|垜|duǒ", "9|垹|bāng", "9|垪|bing", "9|埩|zhēng", "9|垑|chǐ", "9|垐|cí", "9|埅|dì", "9|垖|duī", "9|垘|fú", "9|垙|guāng", "9|垳|hɑng", "9|垎|hè", "9|垬|hóng", "9|垰|kɑ", "9|垏|lǜ", "9|垨|shǒu", "9|垥|xié", "9|垔|yīn", "9|垗|zhào", "10|埃|āi", "10|埔|bù,pǔ", "10|埕|chéng", "10|埂|gěng", "10|埚|guō", "10|垾|hàn", "10|埌|làng", "10|埒|liè", "10|埋|mái,mān", "10|埆|què", "10|埘|shí", "10|垿|xù", "10|埙|xūn", "10|垽|yìn", "10|垸|yuàn", "10|垻|bà", "10|埄|běng", "10|埗|bù", "10|堲|jí", "10|埊|dì", "10|垺|póu", "10|埖|huɑ", "10|埉|xiá", "10|埐|qín", "10|埛|jiōng", "10|埍|juǎn", "10|埈|jùn", "10|埓|liè", "10|埁|cén", "10|垷|xiàn", "10|垶|xīng", "10|垼|yì", "10|埇|yǒng", "10|埑|zhé", "10|埀|chuí", "11|埯|ǎn", "11|埠|bù", "11|埭|dài", "11|堵|dǔ", "11|堆|duī", "11|埵|duǒ", "11|堕|duò,huī", "11|堌|gù", "11|基|jī", "11|堇|jǐn", "11|堀|kū", "11|堎|lèng", "11|埨|lǔn", "11|堄|nì", "11|埝|niàn", "11|培|péi", "11|堋|péng", "11|埤|pí,pì", "11|堑|qiàn", "11|埽|sào", "11|堂|táng", "11|堍|tù", "11|埸|yì", "11|域|yù", "11|堉|yù", "11|埴|zhí", "11|埻|zhǔn", "11|埜|yě", "11|埡|yà", "11|堊|è", "11|堅|jiān", "11|埼|qí", "11|堝|guō", "11|埰|cǎi", "11|埳|xiàn", "11|堃|kūn", "11|執|zhí", "11|堓|àn", "11|埿|ní", "11|埲|běng", "11|埫|chǒng", "11|埱|chù", "11|埞|dī", "11|埬|dōng", "11|堏|fɑng", "11|堈|gāng", "11|埧|jù", "11|埾|jù", "11|埢|quán", "11|堁|kè", "11|埪|kōng", "11|堒|kun", "11|埥|qīng", "11|堔|shen", "11|埶|yì", "11|埣|suì", "11|埮|tán", "11|埦|wǎn", "11|堐|yá", "12|堡|bǎo,bǔ,pù", "12|堛|bì", "12|堾|chūn", "12|塔|dɑ,tǎ", "12|堤|dī", "12|堞|dié", "12|塅|duàn", "12|堩|gèng", "12|堠|hòu", "12|塃|huāng", "12|堪|kān", "12|塄|léng", "12|堧|ruán", "12|堶|tuó", "12|塆|wān", "12|堰|yàn", "12|堙|yīn", "12|堦|jiē", "12|場|cháng", "12|堘|chéng", "12|塊|kuài", "12|報|bào", "12|堖|nǎo", "12|塟|zàng", "12|堨|è", "12|堢|bǎo", "12|塠|duī", "12|堮|è", "12|堸|féng", "12|堼|fēng", "12|堚|huán", "12|堭|huáng", "12|堿|jiǎn", "12|塂|jiǎng", "12|堺|jiè", "12|堻|jīn", "12|塁|lěi", "12|堜|liàn", "12|堥|máo", "12|堳|méi", "12|塀|píng", "12|堷|yìn", "12|堗|tū", "12|塭|wen", "12|塈|xì", "12|塇|xuān", "12|堯|yáo", "12|堣|yú", "12|堬|yú", "12|塦|zhèn", "12|堹|zhòng", "12|堟|zhuàn", "12|堫|zōng", "13|塝|bàng", "13|塍|chéng", "13|堽|gāng", "13|塥|gé", "13|塨|gōng", "13|塱|lǎng", "13|塓|mì", "13|墓|mù", "13|塞|sài,sāi,sè", "13|塑|sù", "13|塌|tā", "13|塘|táng", "13|填|tián", "13|塕|wěng", "13|塮|xiè", "13|塬|yuán", "13|塤|xūn", "13|塏|kǎi", "13|塢|wù", "13|塗|tú", "13|塙|què", "13|塋|yíng", "13|塚|zhǒng", "13|塧|ài", "13|塡|tián", "13|塖|chéng", "13|墎|guō", "13|塰|hɑi", "13|塉|jí", "13|塪|xiàn", "13|塛|lì", "13|塯|liù", "13|塻|mò", "13|塜|péng", "13|塳|péng", "13|塒|shí", "13|塐|sù", "13|塩|yán", "13|墷|yè", "13|塎|yǒng", "13|塣|zhèng", "10|袁|yuán", "10|﨏|xu", "14|墋|chěn", "14|墐|jìn", "14|境|jìng", "14|墈|kàn", "14|墚|liáng", "14|墁|màn", "14|墘|qián", "14|墙|qiáng", "14|墒|shāng", "14|塾|shú", "14|墅|shù", "14|塽|shuàng", "14|墟|xū", "14|墕|yàn", "14|墉|yōng", "14|墴|huáng", "14|墍|xì", "14|塹|qiàn", "14|塼|zhuān", "14|墊|diàn", "14|塲|cháng", "14|墖|tǎ", "14|塵|chén", "14|墜|zhuì", "14|墬|dì", "14|墮|duò", "14|塴|bèng", "14|墂|biāo", "14|墄|qī", "14|墔|cuī", "14|墆|zhì", "14|墑|dì", "14|塿|lǒu", "14|塶|lù", "14|塷|lǔ", "14|塺|méi", "14|塸|ōu", "14|墏|qiǎng", "14|墭|shèng", "14|墛|wei", "14|増|zēng", "14|墇|zhàng", "14|墌|zhǐ", "14|墸|zhu", "15|墺|ào", "15|墀|chí", "15|墫|cūn", "15|墩|dūn", "15|墦|fán", "15|墨|mò", "15|墝|qiāo", "15|墠|shàn", "15|墡|shàn", "15|增|zēng", "15|墳|fén", "15|墶|dā", "15|墪|dūn", "15|墢|fá", "15|墱|dèng", "15|墥|tuǎn", "15|墯|duò", "15|墹|jiɑn", "15|墤|kuài", "15|墲|wú", "15|墣|pú", "15|墧|qiáo", "15|墰|tán", "15|墵|tán", "16|壁|bì", "16|墼|jī", "16|壈|lǎn", "16|壅|yōng", "16|墻|qiáng", "16|壄|yě", "16|壋|dàng", "16|墾|kěn", "16|壇|tán", "16|壒|ài", "16|墽|qiāo", "16|壆|xué", "16|壂|diàn", "16|壊|huài", "16|壃|jiāng", "16|壉|jù", "16|壀|pí", "16|壌|rǎng", "16|墿|yì", "17|壕|háo", "17|壑|hè", "17|壐|xǐ", "17|壓|yā", "17|壎|xūn", "17|壙|kuàng", "17|壔|dǎo", "17|壗|jin", "17|壏|xiàn", "17|壍|qiàn", "17|壖|ruán", "18|壘|lěi", "18|壝|wéi", "19|壢|lì", "19|壚|lú", "19|壜|tán", "19|壞|huài", "19|壡|ruǐ", "19|壛|yán", "20|壤|rǎng", "20|壟|lǒng", "20|壠|lǒng", "20|壥|chán", "20|壣|lín", "20|壦|xūn", "22|壧|yán", "23|壨|lěi", "24|壩|bà", "25|壪|wān"}
	//部首: 艹
	char_cao = Charset{
		"3|艹|ǎo", "4|艺|yì", "5|艾|ài,yì", "5|艽|jiāo", "5|节|jié,jiē", "5|艻|lè", "5|艿|nǎi,rèng", "5|艼|dǐng", "5|芁|qiú", "5|芀|tiáo", "6|芏|dù", "6|芨|jī", "6|芒|máng", "6|芃|péng", "6|芑|qǐ", "6|芊|qiān", "6|芍|què,sháo", "6|芄|wán", "6|芗|xiāng", "6|芎|xiōng", "6|芋|yù", "6|芝|zhī", "6|芆|chāi", "6|芉|gǎn", "6|芐|hù", "6|芇|mián", "6|芕|suī", "6|芌|yù", "6|芅|yì", "6|芖|zhì", "6|芓|zì", "7|芺|ǎo", "7|芭|bā", "7|芘|bì,pí", "7|苄|biàn", "7|苍|cāng", "7|苌|cháng", "7|苁|cōng", "7|苊|ě", "7|芳|fāng", "7|芾|fèi,fú", "7|芬|fēn", "7|芙|fú", "7|芣|fú", "7|芥|gài,jiè", "7|芴|hū,wù", "7|花|huā", "7|芰|jì", "7|苣|jù,qǔ", "7|芤|kōu", "7|苈|lì", "7|芦|lú", "7|芼|mào", "7|苉|pǐ", "7|芪|qí", "7|芡|qiàn", "7|芹|qín", "7|芩|qín", "7|芮|ruì", "7|芟|shān", "7|苏|sū", "7|苇|wěi", "7|芜|wú", "7|苋|xiàn", "7|芯|xìn,xīn", "7|芧|xù,zhù", "7|芽|yá", "7|芫|yán,yuán", "7|苡|yǐ", "7|芸|yún,yùn", "7|芷|zhǐ", "7|苎|zhù", "7|芿|réng", "7|芚|tún", "7|芲|lún", "7|苅|yì", "7|苀|háng", "7|芶|gǒu", "7|芵|jué", "7|芞|qì", "7|苂|chán", "7|茾|qiān", "7|苆|sūsā", "7|芢|rén", "7|芛|wěi", "7|芠|wén", "7|苃|yǒu", "4||gòng", "8|茇|bá", "8|苞|bāo", "8|苯|běn", "8|苾|bì", "8|范|fàn", "8|苻|fú", "8|茀|fú", "8|苷|gān", "8|苟|gǒu", "8|苦|gǔ,kǔ", "8|茄|jiā,qié", "8|茎|jīng", "8|苴|jū,zū", "8|苛|kē", "8|苓|líng", "8|茏|lóng", "8|茆|máo,mǎo", "8|茅|máo", "8|茂|mào", "8|苗|miáo", "8|苠|mín", "8|茉|mò", "8|苜|mù", "8|茑|niǎo", "8|苶|nié", "8|苧|níng", "8|苤|piě", "8|苹|píng", "8|苘|qǐng", "8|茕|qióng", "8|苒|rǎn", "8|若|rě,ruò", "8|苫|shàn,shān", "8|苕|sháo,tiáo", "8|苔|tái,tāi", "8|茓|xué", "8|苢|yǐ", "8|茚|yìn", "8|英|yīng", "8|茔|yíng", "8|苑|yuàn", "8|苲|zhǎ", "8|茁|zhuó", "8|茌|chí", "8|苽|gū", "8|苝|bèi", "8|苪|bǐng", "8|苩|pā", "8|茐|cōng", "8|苐|dì", "8|苖|dí", "8|苵|dié", "8|苳|dōng", "8|苰|hóng", "8|苸|hū", "8|苙|lì", "8|苺|méi", "8|苨|nǐ", "8|苼|shēng", "8|茒|yuán", "8|苿|wèi", "8|苮|xiān", "8|苬|xiú", "8|苭|yǎo", "8|苚|yòng", "8|茋|zhǐ", "8|茊|zī", "9|荜|bì", "9|草|cǎo", "9|茬|chá", "9|茶|chá", "9|茺|chōng", "9|荈|chuǎn", "9|茈|cí,zǐ", "9|茨|cí", "9|荙|dá", "9|荅|dá", "9|荡|dàng", "9|茯|fú", "9|荄|gāi", "9|茖|gé", "9|茛|gèn", "9|荭|hóng", "9|荁|huán", "9|荒|huāng,huɑng", "9|茴|huí", "9|荟|huì", "9|荤|hūn,xūn", "9|荠|jì,qí", "9|荚|jiá", "9|茧|jiǎn", "9|荐|jiàn", "9|茳|jiāng", "9|茭|jiāo", "9|荩|jìn", "9|荆|jīng", "9|莒|jǔ", "9|荖|lǎo", "9|荔|lì", "9|荦|luò", "9|荬|mǎi", "9|茫|máng", "9|茗|míng", "9|荨|qián,xún", "9|茜|qiàn,xī", "9|荞|qiáo", "9|荍|qiáo", "9|荃|quán", "9|荛|ráo,yáo", "9|荏|rěn", "9|茸|róng", "9|荣|róng", "9|茹|rú", "9|荪|sūn", "9|荑|tí,yí", "9|莛|tíng", "9|茼|tóng", "9|荥|xíng,yíng", "9|荇|xìng", "9|荀|xún", "9|药|yào", "9|茵|yīn", "9|荫|yìn", "9|荧|yíng", "9|荮|zhòu", "9|茱|zhū", "9|茘|lì", "9|茲|zī", "9|荘|zhuāng", "9|荌|àn", "9|茷|fá", "9|荝|cè", "9|茞|chén", "9|荿|chéng", "9|荎|chí", "9|茦|cì", "9|茤|jì", "9|荋|ér", "9|荂|fū", "9|茩|hòu", "9|茪|guāng", "9|茥|guī", "9|茠|hāo", "9|茍|jì", "9|茮|jiāo", "9|荕|jīn", "9|荊|jīng", "9|茢|liè", "9|荓|píng", "9|茙|róng", "9|荗|shù", "9|茟|yù", "9|莚|yán", "9|茰|yú", "9|荢|zì", "9|茽|zhòng", "9|茿|zhú", "9|茡|zì", "9||qióng", "10|荸|bí", "10|茝|chǎi,zhǐ", "10|莼|chún", "10|莝|cuò", "10|荻|dí", "10|莪|é", "10|莩|fú,piǎo", "10|莞|guǎn,guān,wǎn", "10|荷|hé,hè", "10|获|huò", "10|莙|jūn", "10|莰|kǎn", "10|莱|lāi", "10|莨|láng,làng,liáng", "10|莉|lì", "10|莅|lì", "10|莲|lián", "10|莽|mǎng", "10|莓|méi", "10|莫|mò,mù", "10|莆|pú", "10|莎|suō,shā", "10|莘|shēn,xīn", "10|莳|shí,shì", "10|荼|shū,tú", "10|荽|sui", "10|莴|wō", "10|莶|xiān", "10|莺|yīng", "10|莹|yíng", "10|莜|yóu", "10|莸|yóu", "10|莠|yǒu", "10|華|huá", "10|莕|xìng", "10|莢|jiá", "10|莖|jìng", "10|莧|xiàn", "10|莂|bié", "10|荹|bù", "10|莗|chē", "10|莀|chén", "10|莐|chén", "10|莡|cuò", "10|荳|dòu", "10|荰|dù", "10|莑|péng", "10|荴|fū", "10|莄|gěng", "10|莟|hàn", "10|莋|zuó", "10|莭|jié", "10|荲|lí", "10|莔|méng", "10|莬|wèn", "10|莈|mò", "10|莯|mù", "10|莮|nán", "10|莻|nūxi", "10|莥|niǔ", "10|菦|qín", "10|莍|qiú", "10|菃|qú", "10|荵|rěn", "10|莦|shāo", "10|莤|sù", "10|荾|suī", "10|莏|suō", "10|莵|tù", "10|莌|tuō", "10|莣|wáng", "10|荱|wěi", "10|茣|wú", "10|莁|wú", "10|莃|xī", "10|荶|yín", "10|荺|yǔn", "10|莇|zhù", "10|莊|zhuāng", "11|菝|bá", "11|菢|bào", "11|菶|běng", "11|萆|bì", "11|菠|bō", "11|菜|cài", "11|菖|chāng", "11|菙|chuí", "11|菆|cuán,zōu", "11|萃|cuì", "11|萏|dàn", "11|菪|dàng", "11|菂|dì", "11|菲|fěi,fēi", "11|菔|fú", "11|菰|gū", "11|菇|gū", "11|菓|guǒ", "11|菡|hàn", "11|菏|hé", "11|萑|huán", "11|菅|jiān", "11|菨|jié", "11|菁|jīng", "11|菊|jú", "11|菌|jùn,jūn", "11|菻|lǐn", "11|菱|líng", "11|菉|lù", "11|萝|luó", "11|萌|méng", "11|萘|nài", "11|萍|píng", "11|菩|pú", "11|萋|qī", "11|萁|qí", "11|萨|sà", "11|萐|shà", "11|菽|shū", "11|菘|sōng", "11|菼|tǎn", "11|萄|táo", "11|菾|tián", "11|萜|tiē", "11|菟|tú,tù", "11|萚|tuò", "11|菀|wǎn,yù", "11|菵|wǎng", "11|萎|wěi", "11|菋|wèi", "11|菥|xī", "11|萧|xiāo", "11|萤|yíng", "11|营|yíng", "11|萦|yíng", "11|菸|yū", "11|萸|yú", "11|著|zhù", "11|菑|zī", "11|菹|zū", "11|菴|ān", "11|萇|cháng", "11|萅|chūn", "11|萊|lái", "11|萡|bó", "11|萞|bì", "11|萗|cè", "11|菭|tái", "11|菗|chóu", "11|莿|cì", "11|萕|qí", "11|菿|dào", "11|菧|dǐ", "11|萣|dìng", "11|菄|dōng", "11|萉|fèi", "11|菒|gǎo", "11|菮|gēng", "11|萖|wǎn", "11|萂|hé", "11|萀|hǔ", "11|萈|huán", "11|菺|jiān", "11|菫|jǐn", "11|菳|qín", "11|萛|jiū", "11|菤|juǎn", "11|萒|yǎn", "11|菎|kūn", "11|菈|lā", "11|蓈|láng", "11|菞|lí", "11|菕|lún", "11|莾|mǎng", "11|菛|mén", "11|萠|pān", "11|菍|niè", "11|萢|pāo", "11|菬|qiáo", "11|菣|qìn", "11|萔|tiáo", "11|蒁|shù", "11|萵|wō", "11|萓|yí", "11|萟|yì", "11|菚|zhàn", "11|萙|kǔtābīlɑī", "11|菷|zhǒu", "12|葆|bǎo", "12|萹|biǎn,biān", "12|葧|bó", "12|蒇|chǎn", "12|葱|cōng", "12|蒂|dì", "12|董|dǒng", "12|萼|ě", "12|葑|fèng,fēng", "12|葍|fú", "12|葛|gé,gě", "12|蓇|gū", "12|葓|hóng", "12|葫|hú", "12|葭|jiā,xiá", "12|蒋|jiǎng", "12|蒈|kǎi", "12|葵|kuí", "12|落|là,lào,luò,luō", "12|蒌|lóu", "12|葎|lǜ", "12|葩|pā", "12|蒎|pài", "12|葡|pú", "12|葺|qì", "12|葜|qiā", "12|萩|qiū", "12|葚|rèn,shèn", "12|葇|róu", "12|葹|shī", "12|蒐|sōu", "12|葶|tíng", "12|葖|tū", "12|葳|wēi", "12|葸|xǐ", "12|葈|xǐ", "12|葙|xiāng", "12|萱|xuān", "12|葬|zàng", "12|葉|yè", "12|葢|gài", "12|萬|wàn", "12|蒉|kuì", "12|葅|zū", "12|葠|shēn", "12|萲|xuān", "12|蒍|wěi", "12|葷|hūn", "12|葒|hóng", "12|葦|wěi", "12|葤|zhòu", "12|萻|ān", "12|葊|ān", "12|萯|fù", "12|萴|cè", "12|蒢|chú", "12|萶|chǔn", "12|蒫|cuó", "12|葮|duàn", "12|葐|pén", "12|蒄|guān", "12|葔|hóu", "12|葟|huáng", "12|萿|kuò", "12|葪|jì", "12|蔇|jì", "12|葌|jiān", "12|葏|jīng", "12|葥|qián", "12|葁|jiāng", "12|葝|qíng", "12|萭|yǔ", "12|葰|jùn", "12|萪|kē", "12|葀|kuò", "12|葻|lán", "12|萰|liàn", "12|萺|mào", "12|葿|méi", "12|葞|mǐ", "12|蒾|mí", "12|葂|miǎn", "12|萳|nǎn", "12|蓱|píng", "12|菐|pú", "12|葴|zhēn", "12|葋|qú", "12|葲|quán", "12|蒅|sūkūmō", "12|萷|shāo", "12|蓃|sōu", "12|蓚|tiáo", "12|蒊|uu", "12|葨|wēi", "12|萫|xiāng", "12|蒆|xuē", "12|葕|xìng", "12|葯|yào", "12|葽|yāo", "12|萾|yíng", "12|蒏|yòng", "12|萮|yú", "12|葾|yuān", "12|蒀|yūn", "12|葃|zuò", "12|蒃|zhuàn", "12|葘|zī", "12|葼|zōng", "12|葄|zuò", "13|蒡|bàng", "13|蓓|bèi", "13|蓖|bì", "13|蔀|bù", "13|蓧|diào", "13|蒽|ēn", "13|蒿|hāo", "13|蒦|huò", "13|蒺|jí", "13|蓟|jì", "13|蒹|jiān", "13|蒟|jǔ", "13|蒯|kuǎi", "13|蓝|lán", "13|蒗|làng", "13|蓠|lí", "13|蓏|luǒ", "13|蒙|méng,měng,mēng", "13|蓂|mì,míng", "13|蓦|mò", "13|蒳|nà", "13|蓬|péng", "13|蒱|pú", "13|蒲|pú", "13|蓉|róng", "13|蓐|rù", "13|蒻|ruò", "13|蒒|shī", "13|蓍|shī", "13|蒴|shuò", "13|蒜|suàn", "13|蓑|suō", "13|蓨|tiáo", "13|蓊|wěng", "13|蓄|xù", "13|蓥|yíng", "13|蓣|yù", "13|蓁|zhēn", "13|蒸|zhēng", "13|蓋|gài", "13|蓮|lián", "13|蓽|bì", "13|蒼|cāng", "13|蒨|qiàn", "13|蒞|lì", "13|蓡|shēn", "13|蓆|xí", "13|蓀|sūn", "13|蒓|chún", "13|蔭|yīn", "13|蔜|áo", "13|蓛|cè", "13|蔯|chén", "13|蒭|chú", "13|蓫|zhú", "13|蓌|cuò", "13|蒧|diǎn", "13|蒶|fén", "13|蓕|guì", "13|蓘|gǔn", "13|蒝|yuán", "13|蒩|zū", "13|蓢|lǎng", "13|蒚|lì", "13|蓤|líng", "13|蒥|liú", "13|蓅|liú", "13|蓩|mǎo", "13|蒘|rú", "13|蒰|pán", "13|蓜|pei", "13|蒪|pò", "13|蒛|quē", "13|蔱|shā", "13|蒔|shì", "13|蒣|xú", "13|蓎|táng", "13|蓪|tōng", "13|蒤|tú", "13|蓞|dàn", "13|蒠|xī", "13|蒵|xí", "13|蓒|xuān", "13|蓔|yǎo", "13|蒑|yīn", "13|蒮|yù", "13|蒬|yuān", "13|蒕|yūn", "13|蒷|yún", "13|蒖|zhēn", "13|蓗|zǒng", "13|蓙|gōzhā", "14|蔼|ǎi", "14|蔽|bì", "14|蔡|cài", "14|蔟|cù", "14|蔸|dōu", "14|蔊|hǎn", "14|蔧|huì", "14|蔻|kòu", "14|蔹|liǎn", "14|蓼|liǎo,lù", "14|蔺|lìn", "14|蔓|mán,màn,wàn", "14|蔑|miè", "14|蔫|niān", "14|蔷|qiáng", "14|蕖|qú", "14|蔌|sù", "14|蓷|tuī", "14|蔚|wèi,yù", "14|蓰|xǐ", "14|箫|xiāo", "14|蓿|xu", "14|蔗|zhè", "14|蓺|yì", "14|蓴|chún", "14|蔕|dì", "14|蔂|léi", "14|蔞|lóu", "14|蔥|cōng", "14|蔦|niǎo", "14|蓯|cōng", "14|蔔|bo", "14|蔆|líng", "14|蔴|má", "14|蔣|jiǎng", "14|薌|xiāng", "14|蓭|ān", "14|蔈|biāo", "14|蔢|pó", "14|蔵|zàng", "14|蓸|cáo", "14|蕏|zhū", "14|蔍|lù", "14|蔖|cuó", "14|蔋|dí", "14|蔐|dí", "14|蓲|qiū", "14|蔉|gǔn", "14|蔮|guó", "14|蔛|hú", "14|蔰|hù", "14|蔒|hūn", "14|蔪|jiān", "14|蓵|jié", "14|蓳|jǐn", "14|蓻|zí", "14|蔨|juàn", "14|薖|kē", "14|蔲|kòu", "14|蕯|sà", "14|蓾|lǔ", "14|蔄|màn", "14|蔝|mǐ", "14|蔤|mì", "14|蔳|qiàn", "14|蔘|shēn", "14|蔏|shāng", "14|蔎|shè", "14|蓶|wéi", "14|蔙|xuàn", "14|蔅|yán", "14|蔩|yín", "14|蔶|zé", "14|蔁|zhāng", "14|蔠|zhōng", "15|蕃|bō,fán,fān", "15|蕡|fén", "15|蕙|huì", "15|蕺|jí", "15|蕉|jiāo,qiáo", "15|蕨|jué", "15|蕢|kuì", "15|蕲|qí", "15|蕤|ruí", "15|蕊|ruǐ", "15|蔬|shū", "15|蕣|shùn", "15|蕰|wēn", "15|蕈|xùn", "15|薁|yù", "15|蕴|yùn", "15|蕞|zuì", "15|蕓|yún", "15|蕘|ráo", "15|薘|dá", "15|蕋|ruǐ", "15|蕚|è", "15|蕒|mɑi", "15|蕪|wú", "15|蕎|qiáo", "15|蕕|yóu", "15|蕆|chǎn", "15|蔾|lí", "15|蕫|dǒng", "15|蕩|dàng", "15|蕁|qián", "15|蕔|bāo", "15|蕇|diǎn", "15|薡|dǐng", "15|蕟|fà", "15|蕜|fěi", "15|蕧|fù", "15|蕐|huá", "15|蕀|jí", "15|蕑|jiān", "15|蕳|jiān", "15|蔃|qiáng", "15|蕝|jué", "15|蕌|lěi", "15|蕄|méng", "15|蕅|ǒu", "15|蕠|rú", "15|蕱|shɑo", "15|蕂|shèng", "15|蕬|sī", "15|蕵|sūn", "15|蕛|tí", "15|蔿|wěi", "15|蕮|xì", "15|蕸|xiá", "15|蕦|xū", "15|蕥|yǎ", "15|蓹|yù", "15|蕍|yú", "16|薆|ài", "16|薄|báo,bó,bò", "16|薜|bì", "16|薋|cí", "16|薅|hāo", "16|薨|hōng", "16|蕻|hóng,hòng", "16|蕾|lěi", "16|薐|léng", "16|蕗|lù", "16|薯|shǔ", "16|薮|sǒu", "16|薙|tì", "16|薇|wēi", "16|薳|wěi", "16|蕹|wèng", "16|薤|xiè", "16|薢|xiè", "16|薪|xīn", "16|薛|xuē", "16|薏|yì", "16|薔|qiáng", "16|薑|jiāng", "16|薟|xiān", "16|薈|huì", "16|薊|jì", "16|蕿|xuān", "16|薦|jiàn", "16|蕭|xiāo", "16|薩|sà", "16|蕷|yù", "16|薉|huì", "16|薬|yào", "16|薭|bài", "16|薒|càn", "16|薠|fán", "16|薣|gǔ", "16|薃|hào", "16|薧|hāo", "16|薕|lián", "16|蕶|líng", "16|薍|wàn", "16|薎|miè", "16|蕽|nóng", "16|薓|shēn", "16|薥|shǔ", "16|蕼|sì", "16|薞|sūn", "16|薚|tāng", "16|薀|yùn", "16|薂|xí", "16|藇|xù", "16|薫|xūn", "16|薗|yuán", "16|薝|zhān", "16|薽|zhēn", "17|藊|biǎn", "17|藏|cáng,zàng", "17|藂|cóng", "17|薾|ěr", "17|藁|gǎo", "17|藉|jí,jiè", "17|藐|miǎo", "17|薿|nǐ", "17|薸|piáo", "17|藑|qióng", "17|薷|rú", "17|薹|tái", "17|藓|xiǎn", "17|薰|xūn", "17|藍|lán", "17|薻|zǎo", "17|薺|jì", "17|薴|níng", "17|藎|jìn", "17|薼|chén", "17|薵|chóu", "17|藋|diào", "17|藡|dí", "17|薱|duì", "17|藅|fá", "17|藃|xiāo", "17|藱|huì", "17|藆|jiǎn", "17|藈|kuí", "17|薶|mái", "17|藌|mí", "17|薲|pín", "17|藄|qí", "17|藒|qì", "17|藗|sù", "17|藬|tuī", "17|藀|yíng", "18|藨|biāo", "18|藩|fān", "18|藠|jiào", "18|藟|lěi", "18|藜|lí", "18|藕|ǒu", "18|藤|téng", "18|藝|yì", "18|藪|sǒu", "18|藷|shǔ", "18|藭|qióng", "18|藴|yùn", "18|藵|bɑo", "18|藣|bēi", "18|藸|zhū", "18|藳|gǎo", "18|藧|huàn", "18|藞|lǎ", "18|藰|liú", "18|藥|yào", "18|藘|lǘ", "18|藦|mò", "18|藲|ōu", "18|藖|xián", "18|藫|tán", "18|藔|liáo", "18|藯|wèi", "18|藛|xiě", "18|藚|xù", "18|藙|yì", "18|藢|zhǐ", "19|蘅|héng", "19|藿|huò", "19|蘑|mó", "19|蘧|qú", "19|藻|zǎo", "19|蘀|tuò", "19|藶|lì", "19|蘆|lú", "19|蘋|pín", "19|蘓|sū", "19|蘇|sū", "19|藹|ǎi", "19|蘐|xuān", "19|蘂|ruǐ", "19|藺|lìn", "19|蘁|wù", "19|蘕|péng", "19|蘄|qí", "19|蘎|jì", "19|蘏|jiōng", "19|蘔|jiōng", "19|藾|lài", "19|蘉|máng", "19|藮|qiáo", "19|藽|qìn", "19|蘒|qiu", "19|蘃|ruǐ", "19|蘣|tǒu", "19|蘈|tuí", "19|蘊|yùn", "19|藼|xuān", "19|蘍|xūn", "19|蘟|yǐn", "16|﨟|ai", "20|蘩|fán", "20|蘖|niè", "20|蘘|ráng", "20|蘡|yīng", "20|蘢|lóng", "20|蘤|huā", "20|蘞|liǎn", "20|蘚|xiǎn", "20|蘭|lán", "20|蘪|mí", "20|蘗|bò", "20|蘯|dàng", "20|蘫|lán", "20|蘳|huī", "20|蘮|jì", "20|蘜|jú", "20|蘝|liǎn", "20|蘦|lìng", "20|蘰|kɑtesurɑ", "20|蘠|qiáng", "20|蘶|wèi", "20|蘨|yáo", "20|蘙|yì", "20|蘌|yù", "20|蘛|yú", "20|蘥|yuè", "21|蘺|lí", "21|蘴|fēng", "21|蘬|guī", "21|蘷|kuí", "21|蘲|léi", "21|蘵|zhī", "22|蘼|mí", "22|蘸|zhɑn", "22|蘽|lěi", "22|蘿|luó", "22|蘹|huái", "22|蘾|huài", "22|蘻|jì", "22|虀|jī", "22|蘱|lèi", "19|蘒|qiu", "23|虃|jiān", "23|虇|quǎn", "23|虄|sǎri", "23|虅|téng", "24|虉|yì", "24|虆|léi", "24|虁|kuí", "24|虂|lù", "24|虈|xiāo", "26|虌|biē", "26|虊|luán", "29|虋|mén"}
	//部首: 氵
	char_3shui = Charset{
		"3|氵|shuǐ", "5|汈|diāo", "5|氾|fàn", "5|氿|guǐ,jiǔ", "5|汉|hàn", "5|汇|huì", "5|汃|pà,pā", "5|汀|tīng", "5|汁|zhī", "5|氻|lè", "5|汅|miǎn", "5|汄|zè", "6|汊|chà", "6|池|chí", "6|汏|dà,tài", "6|汗|hán,hàn", "6|汲|jí", "6|江|jiāng", "6|汔|qì", "6|汝|rǔ", "6|汕|shàn", "6|汤|shāng,tàng,tāng", "6|汜|sì", "6|汍|wán", "6|污|wū", "6|汐|xī", "6|汛|xùn", "6|汙|wū", "6|汚|wū", "6|汎|fàn", "6|汓|qiú", "6|汌|chuàn", "6|汣|jiǔ", "6|汒|máng", "6|汘|qiān", "6|汋|zhuó", "6|汢|tu", "6|汑|tuō", "6|汷|zhōng", "7|汳|biàn", "7|汴|biàn", "7|沧|cāng", "7|沉|chén", "7|沌|dùn,zhuàn", "7|泛|fàn", "7|汾|fén", "7|沣|fēng", "7|沨|féng", "7|沟|gōu", "7|汩|gǔ,yù", "7|沆|hàng", "7|沪|hù", "7|汫|jǐng", "7|泐|lè", "7|沥|lì", "7|沦|lún", "7|没|méi,mò", "7|汶|mén,wèn", "7|汨|mì", "7|沔|miǎn", "7|沐|mù", "7|沤|òu,ōu", "7|沛|pèi", "7|沏|qī", "7|汽|qì", "7|汧|qiān", "7|沁|qìn", "7|汭|ruì", "7|沙|shà,shā", "7|沈|shěn", "7|汰|tài", "7|汪|wāng", "7|沩|wéi", "7|沃|wò", "7|汹|xiōng", "7|沂|yí", "7|沅|yuán", "7|沄|yún", "7|汦|zhī", "7|沚|zhǐ", "7|沍|hù", "7|沘|bǐ", "7|沖|chōng", "7|決|jué", "7|汵|gàn", "7|汸|fāng", "7|汱|tài", "7|沕|mì", "7|汯|hóng", "7|汻|hǔ", "7|沎|huò", "7|汥|zhī", "7|泲|jǐ", "7|洰|jù", "7|汮|jūn", "7|沠|pài", "7|沒|méi", "7|汼|niú", "7|沑|nǜ", "7|沜|pàn", "7|泤|sì", "7|沇|yǎn", "7|汿|xù", "7|沋|yóu", "7|沞|zā", "7|沢|zé", "8|泌|bì,mì", "8|波|bō", "8|泊|bó,pō", "8|沲|duǒ", "8|法|fǎ", "8|沸|fèi", "8|泭|fú", "8|泔|gān", "8|沽|gū", "8|河|hé", "8|泓|hóng", "8|浅|jiān,qiǎn", "8|泾|jīng", "8|泂|jiǒng", "8|泃|jū", "8|沮|jù,jǔ", "8|泪|lèi", "8|沴|lì", "8|泠|líng", "8|泷|lóng,shuāng", "8|泸|lú", "8|泺|luò", "8|泖|mǎo", "8|沬|mèi", "8|沵|mǐ", "8|泯|mǐn", "8|沫|mò", "8|泥|ní,nì", "8|泞|nìng", "8|泮|pàn", "8|泡|pào,pāo", "8|泙|pēng", "8|泼|pō", "8|泣|qì", "8|泅|qiú", "8|沭|shù", "8|泗|sì", "8|沱|tuó", "8|泄|xiè", "8|泻|xiè", "8|泫|xuàn", "8|沿|yán", "8|泱|yāng", "8|泆|yì", "8|泳|yǒng", "8|油|yóu", "8|泽|zé", "8|沾|zhān", "8|沼|zhǎo", "8|治|zhì", "8|注|zhù", "8|況|kuàng", "8|泜|zhī", "8|泝|sù", "8|泑|yōu", "8|泍|bēn", "8|泟|chēng", "8|沶|yí", "8|泹|dàn", "8|沰|tuō", "8|沷|fā", "8|泒|gū", "8|泘|hū", "8|泋|huì", "8|泇|jiā", "8|泦|jú", "8|泬|jué", "8|泏|chù", "8|泧|yuè", "8|泩|shēng", "8|泀|sī", "8|沺|tián", "8|泈|zhōng", "8|泎|zé", "9|测|cè", "9|浐|chǎn", "9|泚|cǐ", "9|洞|dòng", "9|洏|ér", "9|洱|ěr", "9|洑|fú,fù", "9|洸|guāng", "9|浔|hǎixún,xún", "9|洪|hóng", "9|浒|hǔ,xǔ", "9|洹|huán", "9|洄|huí", "9|浍|huì,kuài", "9|浑|hún,hǔn", "9|活|huó", "9|济|jì,jǐ", "9|洎|jì", "9|浃|jiā", "9|浇|jiāo", "9|洁|jié", "9|津|jīn", "9|浕|jìn", "9|洭|kuāng", "9|洌|liè", "9|浏|liú", "9|洛|luò", "9|洣|mǐ", "9|洺|míng", "9|浓|nóng", "9|派|pā,pài", "9|洴|píng", "9|洽|qià", "9|洳|rù", "9|洒|sǎ", "9|浉|shī", "9|洮|táo", "9|洟|tì", "9|洼|wā", "9|洈|wéi", "9|洧|wěi", "9|洿|wū", "9|洗|xǐ,xiǎn", "9|涎|xián", "9|洨|xiáo", "9|洫|xù", "9|洵|xún", "9|洋|yáng", "9|洇|yīn", "9|浈|zhēn", "9|洲|zhōu", "9|洙|zhū", "9|浊|zhuó", "9|洩|xiè", "9|洶|xiōng", "9|洝|àn", "9|洆|chéng", "9|洊|jiàn", "9|洉|hòu", "9|洃|huī", "9|洚|jiàng", "9|浄|jìng", "9|洘|kǎo", "9|洡|lěi", "9|洠|sì", "9|洀|pán", "9|浌|peole", "9|洦|pò", "9|洓|sè", "9|浀|qū", "9|洤|quán", "9|洂|yiè", "9|洬|sù", "9|涏|tǐng", "9|洐|xíng", "9|洢|yī", "9|浂|yì", "9|泿|yín", "9|洕|yìn", "9|洅|zài", "9|洔|zhǐ", "9|洷|zhì", "9||tà", "10|浜|bāng", "10|浡|bó", "10|涔|cén", "10|涌|chōng,yǒng", "10|涤|dí", "10|涐|é", "10|浮|fú", "10|涡|guō,wō", "10|海|hǎi", "10|浬|hǎilǐ", "10|浛|hán,hàn", "10|浩|hào", "10|涣|huàn", "10|浣|huàn", "10|涧|jiàn", "10|浸|jìn", "10|涓|juān", "10|浚|jùn,xùn", "10|涞|lāi", "10|浪|làng", "10|涝|láo,lào", "10|涖|lì", "10|涟|lián", "10|流|liú", "10|浼|měi", "10|涊|niǎn", "10|涅|niè", "10|浦|pǔ", "10|润|rùn", "10|涩|sè", "10|涉|shè", "10|涘|sì", "10|涑|sù", "10|涛|tāo", "10|涕|tì", "10|涂|tú", "10|涠|wéi", "10|浯|wú", "10|浠|xī", "10|消|xiāo", "10|浥|yì", "10|浴|yù", "10|涢|yún", "10|涨|zhàng,zhǎng", "10|浙|zhè", "10|浞|zhuó", "10|浹|jiā", "10|涇|jīng", "10|浧|yǐng", "10|浾|chēng", "10|浺|chōng", "10|浱|chún", "10|浟|yōu", "10|浢|dòu", "10|涜|toko", "10|淓|fāng", "10|浲|féng", "10|浭|gēng", "10|浫|hǎn", "10|涆|hàn", "10|涥|hēng", "10|浤|hóng", "10|涀|xiàn", "10|浻|jiǒng", "10|涃|kùn", "10|浨|lǎn", "10|浶|láo", "10|涙|lèi", "10|浰|lì", "10|浖|liè", "10|涁|shèn", "10|浝|máng", "10|浽|suī", "10|浿|pèi", "10|涄|pīng", "10|浗|qiú", "10|涗|shuì", "10|涚|shuì", "10|洍|sì", "10|浵|tóng", "10|涋|tū", "10|涒|tūn", "10|浘|wěi", "10|洖|wú", "10|涍|xiào", "10|浳|yì", "10|淽|zhǐ", "11|湴|bàn", "11|淳|chún", "11|淙|cóng", "11|淬|cuì", "11|淡|dàn", "11|淀|diàn", "11|渎|dòu,dú", "11|淝|féi", "11|涪|fú", "11|淦|gàn", "11|涫|guàn", "11|涵|hán", "11|淏|hào", "11|涸|hé", "11|淴|hū", "11|淮|huái", "11|混|hún,hǔn", "11|渐|jiàn,jiān", "11|淋|lín,lìn", "11|淩|líng", "11|渌|lù", "11|渑|miǎn,shéng", "11|淖|nào", "11|淠|pì", "11|淇|qí", "11|清|qīng", "11|渠|qú", "11|深|shēn", "11|渗|shèn", "11|淑|shū", "11|涮|shuàn", "11|淞|sōng", "11|淌|tǎng", "11|淘|táo", "11|添|tiān", "11|淟|tiǎn", "11|涴|wò,yuān", "11|淅|xī", "11|淆|xiáo", "11|涯|yá", "11|淹|yān", "11|液|yè", "11|淫|yín", "11|淤|yū", "11|渔|yú", "11|淯|yù", "11|渊|yuān", "11|渚|zhǔ", "11|涿|zhuō", "11|淄|zī", "11|渍|zì", "11|淚|lèi", "11|淶|lái", "11|淒|qī", "11|淺|qiǎn", "11|渦|wō", "11|淪|lún", "11|淛|zhè", "11|淊|yān", "11|涼|liáng", "11|済|jì", "11|渀|bèn", "11|淲|biāo", "11|淿|bó", "11|淐|chāng", "11|淨|jìng", "11|淔|zhí", "11|涰|chuò", "11|淂|dé", "11|淍|zhōu", "11|渉|shè", "11|涷|dōng", "11|渄|fēi", "11|淈|gǔ", "11|淉|guǒ", "11|渇|kě", "11|渮|hé", "11|涽|hūn", "11|淁|qiè", "11|湕|jiǎn", "11|涺|jū", "11|淗|jú", "11|淃|juàn", "11|涳|kōng", "11|淕|lù", "11|淥|lù", "11|渵|máo", "11|淧|mì", "11|渂|wèn", "11|淰|niǎn", "11|淣|ní", "11|淎|pěng", "11|淜|píng", "11|渒|pài", "11|渏|yī", "11|淸|qīng", "11|淭|qú", "11|渃|ruò", "11|渋|sè", "11|涻|shè", "11|渖|shěn", "11|涭|shòu", "11|涾|tà", "11|涶|tuō", "11|涹|wō", "11|渓|xī", "11|涬|xìng", "11|淢|yù", "11|渶|yīng", "11|渁|yuān", "11|渆|yuān", "11|渕|yuān", "11|涱|zhàng", "12|渤|bó", "12|滁|chú", "12|湩|dòng", "12|渡|dù", "12|溉|gài", "12|港|gǎng", "12|渹|hōng", "12|湖|hú", "12|滑|huá", "12|湟|huáng", "12|溅|jiàn,jiān", "12|湔|jiān", "12|湫|jiǎo,jiū,qiū", "12|湝|jiē", "12|湨|jú", "12|渴|kě", "12|溃|kuì", "12|溇|lóu", "12|湄|méi", "12|渼|měi", "12|湎|miǎn", "12|渺|miǎo", "12|湣|mǐn", "12|湃|pài", "12|湓|pén", "12|湿|shī", "12|湜|shí", "12|溲|sōu", "12|溚|tǎ", "12|湠|tàn", "12|湉|tián", "12|渟|tíng", "12|湍|tuān", "12|湾|wān", "12|湋|wéi", "12|渭|wèi", "12|温|wēn", "12|渥|wò", "12|湘|xiāng", "12|渫|xiè", "12|湑|xǔ,xū", "12|溆|xù", "12|渲|xuàn", "12|湮|yān", "12|渰|yǎn", "12|湧|yǒng", "12|游|yóu", "12|渝|yú", "12|湲|yuán", "12|渣|zhā", "12|溠|zhā", "12|湛|zhàn", "12|滞|zhì", "12|滋|zī", "12|湊|còu", "12|減|jiǎn", "12|湞|zhēn", "12|湯|tāng", "12|渢|fēng", "12|測|cè", "12|湌|cān", "12|淵|yuān", "12|湻|chún", "12|溈|wéi", "12|渾|hún", "12|溾|āi", "12|湢|bì", "12|湐|pò", "12|湹|chán", "12|湁|chì", "12|渧|tí", "12|湺|xián", "12|湂|è", "12|渪|rú", "12|湗|fèng", "12|溄|féng", "12|渱|hóng", "12|湀|guǐ", "12|湼|niè", "12|渙|huàn", "12|湏|huì", "12|湷|zhuāng", "12|湱|huò", "12|湒|jí", "12|溂|lɑ", "12|湅|liàn", "12|湸|liàng", "12|湰|lóng", "12|満|mǎn", "12|湈|méi", "12|渳|mǐ", "12|渿|nài", "12|湳|nǎn", "12|渜|nuǎn", "12|湪|tuàn", "12|溌|hātū", "12|湆|qì", "12|湇|qì", "12|溬|qiāng", "12|渞|qiú", "12|湭|qiú", "12|湶|quán", "12|渘|róu", "12|溞|sāo", "12|渻|shěng", "12|湦|shēng", "12|湤|shī", "12|湥|tū", "12|渨|wěi", "12|溊|bō", "12|渷|yǎn", "12|湙|yì", "12|湚|yìn", "12|溁|yíng", "12|溋|yíng", "12|湵|yǒu", "12|湡|yú", "12|渽|zāi", "12|湽|zī", "13|滗|bì", "13|滨|bīn", "13|滀|chù,xù", "13|滇|diān", "13|滏|fǔ", "13|滆|gé", "13|滚|gǔn", "13|滈|hào", "13|滉|huàng", "13|溷|hǔn", "13|漷|huǒ", "13|滘|jiào", "13|溘|kè", "13|滥|làn", "13|漓|lí", "13|溧|lì", "13|溜|liù,liū", "13|滦|luán", "13|滤|lǜ", "13|满|mǎn", "13|漭|mǎng", "13|溟|míng", "13|漠|mò", "13|溺|nì,niào", "13|滂|pāng", "13|溥|pǔ", "13|溱|qín,zhēn", "13|溶|róng", "13|溽|rù", "13|滠|shè", "13|溯|sù", "13|溻|tā", "13|滩|tān", "13|溏|táng", "13|滔|tāo", "13|溦|wēi", "13|滃|wěng,wēng", "13|溪|xī", "13|滫|xiǔ", "13|溴|xiù", "13|滟|yàn", "13|溢|yì", "13|溵|yīn", "13|滢|yíng", "13|滪|yù", "13|源|yuán", "13|滍|zhì", "13|滓|zǐ", "13|溝|gōu", "13|漣|lián", "13|滙|huì", "13|滅|miè", "13|溼|shī", "13|滭|bì", "13|溳|yún", "13|滛|yín", "13|滄|cāng", "13|準|zhǔn", "13|滌|dí", "13|溰|ái", "13|滶|áo", "13|漨|féng", "13|溗|chéng", "13|滣|chún", "13|滜|zé", "13|滒|gē", "13|溎|yàn", "13|澕|hé", "13|滐|jié", "13|溍|jìn", "13|溓|lián", "13|滝|lóng", "13|溣|lùn", "13|溤|mǎ", "13|溕|méng", "13|溿|pàn", "13|滊|qì", "13|溹|suò", "13|溡|shí", "13|溮|shī", "13|溸|sù", "13|滖|suī", "13|溑|suǒ", "13|溙|tài", "13|溛|wā", "13|溫|wēn", "13|溩|wù", "13|滧|yáo", "13|潃|xiǔ", "13|溔|yǎo", "13|溒|yuán", "13|溨|zāi", "13|溭|zé", "14|滮|biāo", "14|漕|cáo", "14|漘|chún", "14|潀|cóng", "14|漼|cuǐ", "14|滴|dī", "14|漧|gān", "14|澉|gǎn", "14|漍|guó", "14|滹|hū", "14|漶|huàn", "14|潢|huáng", "14|漈|jì", "14|漖|jiào", "14|漤|lǎn", "14|漯|lěi,luò,tà", "14|潋|liàn", "14|漏|lòu", "14|漉|lù", "14|漫|màn", "14|漰|pēng", "14|漂|piào,piǎo,piāo", "14|漆|qī", "14|漱|shù", "14|漙|tuán", "14|潍|wéi", "14|潇|xiāo", "14|漩|xuán", "14|演|yǎn", "14|漾|yàng", "14|漪|yī", "14|潆|yíng", "14|漳|zhāng", "14|潴|zhū", "14|潈|zōng", "14|漬|zì", "14|漸|jiàn", "14|漚|òu", "14|漢|hàn", "14|滿|mǎn", "14|滷|lǔ", "14|漊|lóu", "14|濄|guō", "14|漁|yú", "14|滬|hù", "14|滸|hǔ", "14|滾|gǔn", "14|滻|chǎn", "14|滲|shèn", "14|漲|zhǎng", "14|澚|ɑo", "14|漅|cháo", "14|滯|zhì", "14|漴|chóng", "14|漺|shuǎng", "14|漎|cóng", "14|漗|cōng", "14|潒|dàng", "14|滼|fàn", "14|漑|gài", "14|潅|guàn", "14|潂|hóng", "14|漃|jì", "14|滰|jiàng", "14|漌|jǐn", "14|漮|kāng", "14|滱|kòu", "14|潉|kun", "14|漻|liáo", "14|漋|lóng", "14|滵|mì", "14|漞|mì", "14|潎|pì", "14|滳|shāng", "14|漡|shāng", "14|潄|shù", "14|漟|táng", "14|漛|téng", "14|潳|tú", "14|漥|wā", "14|漇|xǐ", "14|漝|xí", "14|漵|xù", "14|潊|xù", "14|漄|yá", "14|漹|yān", "14|漜|yě", "14|潩|yì", "14|滽|yōng", "14|滺|yōu", "14|潌|zhi", "15|澳|ào", "15|潺|chán", "15|潮|cháo", "15|澈|chè", "15|澄|chéng,dèng", "15|濆|fén,pēn", "15|澔|hào", "15|澒|hòng", "15|潓|huì", "15|澜|lán", "15|潦|láo,lào,lǎo,liáo", "15|潾|lín", "15|潖|pá", "15|潘|pān", "15|澎|péng", "15|潽|pū", "15|潜|qián", "15|潵|sǎ", "15|潸|shān", "15|潲|shào", "15|澍|shù", "15|澌|sī", "15|潠|sùn", "15|澾|tà", "15|潭|tán,xún", "15|潼|tóng", "15|潫|wān", "15|澫|wàn", "15|潕|wǔ", "15|潝|xī", "15|潟|xì", "15|潔|jié", "15|澆|jiāo", "15|澘|shān", "15|澐|yún", "15|澁|sè", "15|潛|qián", "15|潿|wéi", "15|潰|kuì", "15|澂|chéng", "15|潷|bì", "15|潨|cōng", "15|澇|lào", "15|澗|jiàn", "15|潑|pō", "15|潯|xún", "15|潤|rùn", "15|澠|miǎn", "15|潹|chán", "15|澊|cūn", "15|濎|dǐng", "15|潡|dùn", "15|澓|fú", "15|潙|wéi", "15|澏|hán", "15|潶|hēi", "15|澋|jǐng", "15|澅|huà", "15|潗|jí", "15|濈|jí", "15|潐|jiào", "15|潏|yù", "15|澑|liū", "15|澛|lǔ", "15|潣|mǐn", "15|澝|nìng", "15|漒|qiáng", "15|潬|tān", "15|潻|shǔ", "15|濍|sōng", "15|潥|sù", "15|澻|suì", "15|漽|tí", "15|澙|xì", "15|澖|xián", "15|潱|yē", "15|潪|zhí", "15|潧|zhēn", "15|濐|zhǔ", "16|濒|bīn", "16|澶|chán", "16|澹|dàn,tán", "16|澤|duó", "16|澴|huán", "16|激|jī", "16|澽|jù", "16|濑|lái", "16|澧|lǐ", "16|濂|lián", "16|潞|lù", "16|濛|méng", "16|澼|pì", "16|澨|shì", "16|濉|suī", "16|澥|xiè", "16|澡|zǎo", "16|澣|huàn", "16|濇|sè", "16|濃|nóng", "16|濁|zhuó", "16|澱|diàn", "16|澦|yù", "16|濭|ǎi", "16|澯|càn", "16|濸|cɑng", "16|濋|chǔ", "16|澬|zī", "16|濨|cí", "16|澸|gǎn", "16|澢|dāng", "16|濩|huò", "16|澮|kuài", "16|濊|huì", "16|濅|jìn", "16|澰|liàn", "16|濓|lián", "16|澟|lǐn", "16|澪|líng", "16|澷|màn", "16|濗|mì", "16|澿|qín", "16|濏|sè", "16|濖|shù", "16|潚|sù", "16|澲|yè", "16|澺|yì", "16|澭|yōng", "16|澞|yú", "16|澵|zhēn", "16|瀄|zhì", "17|濞|bì", "17|濲|gǔ", "17|濠|háo", "17|濮|pú", "17|濡|rú", "17|瀁|yǎng", "17|濯|zhuó", "17|濔|mǐ", "17|濤|tāo", "17|濫|làn", "17|濬|jùn", "17|濕|shī", "17|濘|nìng", "17|濱|bīn", "17|濶|kuò", "17|濜|jìn", "17|澀|sè", "17|濰|wéi", "17|濵|bīn", "17|瀞|jìng", "17|濢|cuì", "17|濧|duì", "17|濻|wěi", "17|濟|jì", "17|濪|qìng", "17|濿|lì", "17|濹|boku", "17|瀎|miè", "17|濝|qí", "17|瀡|suǐ", "17|瀇|wǎng", "17|濣|wò", "17|濥|yǐn", "17|濦|yīn", "17|濙|yíng", "17|濚|yíng", "17|濴|yíng", "18|瀑|bào,pù", "18|瀌|biāo", "18|瀍|chán", "18|濽|zàn", "18|瀔|gǔ", "18|瀆|dú", "18|瀦|zhū", "18|濾|lǜ", "18|濺|jiàn", "18|濼|luò", "18|瀏|liú", "18|瀋|shěn", "18|瀉|xiè", "18|瀅|yíng", "18|瀓|chéng", "18|瀢|wěi", "18|瀈|huī", "18|瀐|jiān", "18|瀂|lǔ", "18|瀊|pán", "18|瀒|sè", "18|瀃|sì", "18|瀀|yōu", "19|瀚|hàn", "19|瀣|xiè", "19|瀛|yíng", "19|瀨|lài", "19|瀝|lì", "19|瀕|bīn", "19|瀟|xiāo", "19|瀘|lú", "19|瀯|yíng", "19|瀠|yíng", "19|瀩|duì", "19|瀫|hú", "19|瀤|huái", "19|瀖|huò", "19|瀳|jiàn", "19|瀬|lài", "19|瀮|lián", "19|濳|qián", "19|瀙|qìn", "19|瀜|róng", "19|瀭|shu", "19|瀗|xiàn", "19|瀥|xuè", "20|瀵|fèn", "20|灌|guàn", "20|瀽|jiǎn", "20|瀼|ráng,ràng", "20|瀹|yuè", "20|瀧|lóng", "20|瀰|mí", "20|瀺|chán", "20|瀻|dài", "20|瀿|fán", "20|瀱|jì", "20|瀸|jiān", "20|灂|zhuó", "20|瀾|lán", "20|灆|lán", "20|瀲|liàn", "20|瀶|lín", "20|灀|shuàng", "20|瀷|yì", "20|瀴|yīng", "20|灁|yuān", "21|灏|hào", "21|灊|qián", "21|灋|fǎ", "21|灃|fēng", "21|灄|shè", "21|灕|lí", "21|灇|cóng", "21|灍|jué", "21|灅|lěi", "21|灈|qú", "21|灐|yíng", "21|灉|yōng", "22|灑|sǎ", "22|灔|yàn", "22|灒|zàn", "22|灘|tān", "22|灖|mǐ", "22|灗|shàn", "23|灛|chǎn", "23|灙|dǎng", "23|灚|jiǎo", "23|灡|lán", "23|灜|yíng", "24|灞|bà", "24|灠|làn", "24|灝|hào", "24|灟|zhú", "25|灣|wān", "25|灢|nǎng", "26|灤|luán", "26|灦|xiǎn", "26|灎|yàn", "27|灨|gàn", "27|灧|yàn", "31|灩|yàn", "32|灪|yù"}
	//部首: 月
	char_yue = Charset{
		"4|月|yuè", "5|肊|yì", "6|肌|jī", "6|肋|lē,lèi", "6|有|yòu,yǒu", "6|肎|kěn", "6|肍|qiú", "7|肠|cháng", "7|肚|dù,dǔ", "7|肝|gān", "7|肛|gāng", "7|肓|huāng", "7|肜|róng", "7|肟|wò", "7|肖|xiào,xiāo", "7|肘|zhǒu", "7|肐|gē", "7|肑|bó", "7|肞|chāi", "7|肔|chǐ", "7|肒|huàn", "7|肕|rèn", "7|肗|rǔ", "7|肙|yuān", "8|肮|āng,háng", "8|肪|fáng", "8|肥|féi", "8|肺|fèi", "8|肤|fū", "8|服|fú,fù", "8|肱|gōng", "8|股|gǔ", "8|肩|jiān", "8|肼|jǐng", "8|肯|kěn", "8|肭|nà", "8|朋|péng", "8|肷|qiǎn", "8|朊|ruǎn", "8|肾|shèn", "8|肽|tài", "8|肸|xī", "8|肹|xī", "8|胁|xié", "8|肴|yáo", "8|育|yō,yù", "8|胀|zhàng", "8|肢|zhī", "8|肿|zhǒng", "8|肫|zhūn", "8|肧|pēi", "8|肬|yóu", "8|肶|pí", "8|朌|fén", "8|肦|bān", "8|胏|zǐ", "8|肨|pàng", "8|肣|qín", "8|肻|kěn", "8|肵|qí", "8|肰|rán", "8|肳|wěn", "9|胈|bá", "9|胞|bāo", "9|背|bèi,bēi", "9|胆|dǎn", "9|胨|dòng", "9|朏|fěi", "9|胍|guā", "9|胡|hú", "9|胛|jiǎ", "9|胫|jìng", "9|胩|kǎ", "9|胧|lóng", "9|胪|lú", "9|脉|mài,mò", "9|胖|pán,pàng", "9|胚|pēi", "9|胠|qū", "9|朐|qú", "9|胂|shèn", "9|胜|shèng", "9|胎|tāi", "9|胃|wèi", "9|胥|xū", "9|胤|yìn", "9|胗|zhěn,zhēn", "9|胝|zhī", "9|胄|zhòu", "9|胙|zuò", "9|胇|fèi", "9|胉|bó", "9|胣|chǐ", "9|胊|qú", "9|胅|dié", "9|胐|fěi", "9|胕|fū", "9|胢|qià", "9|朎|líng", "9|胟|mǔ", "9|胒|nì", "9|胓|píng", "9|胑|zhī", "9|胋|tián", "9|朑|tì", "9|胘|xián", "9|胦|yāng", "9||zhuān", "10|胺|àn,ě", "10|胵|chī", "10|脆|cuì", "10|胴|dòng", "10|胹|ér", "10|胳|gé,gē", "10|胱|guāng", "10|胲|hǎi", "10|胻|héng", "10|脊|jǐ", "10|胶|jiāo", "10|胯|kuà", "10|脍|kuài", "10|朗|lǎng", "10|脒|mǐ", "10|脑|nǎo", "10|能|néng", "10|脓|nóng", "10|朒|nǜ", "10|胼|pián", "10|脐|qí", "10|脎|sà", "10|朔|shuò", "10|朓|tiǎo", "10|脡|tǐng", "10|胸|xiōng", "10|脩|xiū", "10|胭|yān", "10|胰|yí", "10|脏|zàng,zāng", "10|朕|zhèn", "10|脂|zhī", "10|脇|xié", "10|脈|mài", "10|脃|cuì", "10|胷|xiōng", "10|脋|xié", "10|脠|shān", "10|脀|zhēng", "10|胿|guī", "10|脄|méi", "10|脌|nin", "10|胮|pāng", "10|脁|tiǎo", "10|脅|xié", "11|脖|bó", "11|脭|chéng", "11|脞|cuǒ", "11|脰|dòu", "11|脯|fǔ,pú", "11|脝|hēng", "11|脚|jiǎo,jué", "11|朘|juān", "11|脸|liǎn", "11|脟|luán", "11|脶|luó", "11|脢|méi", "11|脲|niào", "11|脬|pāo", "11|脤|shèn", "11|脦|te", "11|脱|tuō", "11|脘|wǎn", "11|望|wàng", "11|脧|zuī", "11|脣|chún", "11|脛|jìng", "11|脗|wěn", "11|朙|míng", "11|脪|xìn", "11|脨|cù", "11|脵|gu", "11|朚|huāng", "11|脥|jiá", "11|朖|lǎng", "11|脷|lì", "11|脳|nǎo", "11|脮|něi", "11|脴|pǐ", "11|脫|tuō", "11|脕|wàn", "11|脙|xiū", "11|脜|róu", "12|腌|ā,yān", "12|朝|cháo,zhāo", "12|腚|dìng", "12|腓|féi", "12|腑|fǔ", "12|腘|guó", "12|腱|jiàn", "12|腈|jīng", "12|腒|jū", "12|腊|là,xī", "12|脾|pí", "12|期|qī", "12|腔|qiāng", "12|腆|tiǎn", "12|腕|wàn", "12|腋|yè", "12|腴|yú", "12|腙|zōng", "12|脹|zhàng", "12|腖|dòng", "12|腎|shèn", "12|腡|luó", "12|腗|pí", "12|脿|biāo", "12|腄|chuí", "12|腏|zhuì", "12|脺|cuī", "12|腅|dàn", "12|腍|rèn", "12|腂|guò", "12|脻|jiē", "12|腃|juàn", "12|脼|liǎng", "12|腀|lún", "12|腉|nái", "12|腇|něi", "12|腁|pián", "12|朞|jī", "12|脽|shuí", "12|朜|tūn", "12|朠|yīng", "13|腤|ān", "13|腷|bì", "13|腠|còu", "13|腭|ě", "13|腹|fù", "13|腼|miǎn", "13|腩|nǎn", "13|腻|nì", "13|腮|sāi", "13|腧|shù", "13|腾|téng", "13|腯|tú", "13|腿|tuǐ", "13|腽|wà", "13|腺|xiàn", "13|腥|xīng", "13|腰|yāo", "13|膇|zhuì", "13|腳|jiǎo", "13|腣|dì", "13|腸|cháng", "13|腫|zhǒng", "13|腦|nǎo", "13|腟|chì", "13|腶|duàn", "13|腞|zhuàn", "13|腵|jiā", "13|腜|méi", "13|腝|ruǎn", "13|腢|ǒu", "13|腬|róu", "13|膄|shòu", "13|腨|shuàn", "13|腲|wěi", "13|腛|wò", "13|腪|yùn", "13|朡|zōng", "14|膀|bàng,bǎng,páng,pāng", "14|膑|bìn", "14|膊|bo,bó", "14|膏|gào,gāo", "14|膈|gé", "14|膋|liáo", "14|膂|lǚ", "14|膜|mó", "14|膍|pí", "14|膁|qiǎn", "14|朢|wàng", "14|膆|sù", "14|膌|jí", "14|膖|pāng", "14|膅|táng", "14|膃|wà", "14|膎|xié", "14|膉|yì", "15|膘|biāo", "15|膗|chuái", "15|膵|cuì", "15|膛|táng", "15|膝|xī", "15|膣|zhì", "15|膞|zhuān", "15|膚|fū", "15|膕|guó", "15|膓|cháng", "15|膠|jiāo", "15|膔|lù", "15|膢|lǘ", "15|膟|lǜ", "15|膒|ōu", "15|膷|xiāng", "15|膤|xue", "15|膡|yìng", "15|膼|zhuā", "16|膪|chuài", "16|膰|fán", "16|膙|jiǎng", "16|膫|liáo", "16|膦|lìn", "16|膨|péng", "16|膳|shàn", "16|膩|nì", "16|臈|là", "16|朣|tóng", "16|膧|tóng", "16|膬|cuì", "16|膭|kuì", "16|膹|fèn", "16|膴|hū", "16|膲|jiāo", "16|臇|juǎn", "16|朤|lǎng", "16|朥|lɑo", "16|膸|suǐ", "16|膯|tēng", "16|膮|xiāo", "16|膶|rùn", "16|膱|zhí", "17|臂|bei,bì", "17|臌|gǔ", "17|臁|lián", "17|朦|méng", "17|臊|sào", "17|膻|shān", "17|臀|tún", "17|臆|yì", "17|膺|yīng", "17|臃|yōng", "17|膿|nóng", "17|臉|liǎn", "17|膾|kuài", "17|膽|dǎn", "17|臅|chù", "17|臄|jué", "17|臒|wò", "18|臑|ér,nào", "18|臏|bìn", "18|臍|qí", "18|臓|zàng", "18|臎|cuì", "18|臗|kuān", "18|臐|xūn", "19|臕|biāo", "19|臘|là", "19|臔|xiàn", "20|臛|huò", "20|臜|zā", "20|臙|yān", "20|臚|lú", "20|臖|xìng", "21|臝|luǒ", "21|朧|lóng", "21|臟|zàng", "21||téng", "22|臞|qú", "23|臢|zā"}
	//部首: 宀
	char_gai = Charset{
		"3|宀|mián", "5|宄|guǐ", "5|宁|níng,nìng,zhù", "5|它|tā", "5|宂|rǒng", "6|安|ān", "6|守|shǒu", "6|宇|yǔ", "6|宅|zhái", "6|宆|qióng", "7|宏|hóng", "7|宋|sòng", "7|完|wán", "7|宊|tū", "7|宑|jǐng", "7|宍|ròu", "7|宎|yǎo", "7|宐|yí", "7|宒|zhūn", "8|宝|bǎo", "8|宠|chǒng", "8|宕|dàng", "8|定|dìng", "8|官|guān", "8|宓|mì", "8|审|shěn", "8|实|shí", "8|宛|wǎn", "8|宜|yí", "8|宙|zhòu", "8|宗|zōng", "8|宖|hóng", "8|実|shí", "8|宔|zhǔ", "9|宬|chéng", "9|宫|gōng", "9|宦|huàn", "9|客|kè", "9|室|shì", "9|宪|xiàn", "9|宣|xuān", "9|宥|yòu", "9|宩|shǐ", "9|宨|tiǎo", "10|宾|bīn", "10|宸|chén", "10|家|gū,jiā,jie", "10|害|hài,hé", "10|宽|kuān", "10|宭|qún", "10|容|róng", "10|宵|xiāo", "10|宴|yàn", "10|宧|yí", "10|宰|zǎi", "10|宲|bǎo", "10|宮|gōng", "10|宺|huāng", "10|宼|kòu", "10|宻|mì", "10|宷|cài", "10|宯|xiāo", "10|宱|zhà", "11|寄|jì", "11|寂|jì", "11|寇|kòu", "11|密|mì", "11|宿|sù,xiù,xiǔ", "11|寅|yín", "11|寀|cǎi", "11|寃|yuān", "11|寉|hè", "11|寈|qīng", "11|寁|zǎn", "12|富|fù", "12|寒|hán", "12|寐|mèi", "12|寔|shí", "12|寓|yù", "12|寍|níng", "12|寕|níng", "12|寎|bǐng", "12|寏|huán", "12|寋|jiàn", "12|寑|qǐn", "12|寊|zhēn", "13|寞|mò", "13|寝|qǐn", "13|寘|zhì", "13|寛|kuān", "13|寚|bǎo", "13|寖|jìn", "13|寗|níng", "13|寜|níng", "13|寙|yǔ", "14|察|chá", "14|寡|guǎ", "14|寥|liáo", "14|寤|wù", "14|寨|zhài", "14|實|shí", "14|寣|hū", "14|寠|jù", "14|寬|kuān", "14|寧|níng", "14|寢|qǐn", "15|寯|jùn", "15|寮|liáo", "15|審|shěn", "15|寫|xiě", "15|寭|huì", "15|寪|wěi", "16|寰|huán", "17|寱|yì", "17|寲|yí", "19|寳|bǎo", "19|寴|qīn", "20|寵|chǒng", "20|寶|bǎo", "21|寷|fēng"}
	//门
	char_men = Charset{
		"3|门|mén", "4|闩|shuān", "5|闪|shǎn", "6|闭|bì", "6|闯|chuǎng", "6|闬|hàn", "6|问|wèn", "6|闫|yán", "7|闳|hóng", "7|间|jiàn,jiān", "7|闶|kàng", "7|闷|mèn,mēn", "7|闵|mǐn", "7|闰|rùn", "7|闱|wéi", "7|闲|xián", "8|闹|nào", "8|闸|zhá", "9|阀|fá", "9|阁|gé", "9|闺|guī", "9|阂|hé", "9|闿|kǎi", "9|闾|lǘ", "9|闽|mǐn", "9|闼|tà", "9|闻|wén", "9||zhèng", "10||chuài", "10|阄|jiū", "10|阃|kǔn", "10|阆|làng", "10|阅|yuè", "11|阐|chǎn", "11|阊|chāng", "11|阇|dū,shé", "11|阏|ě,yān", "11|阍|hūn", "11|阌|wén", "11|阋|xì", "11|阉|yān", "11|阎|yán", "11|阈|yù", "12|阓|huì", "12|阔|kuò", "12|阑|lán", "12|阒|qù", "12|阕|què", "13|阖|hé", "13|阙|jué,què,quē", "13|阘|tà", "13|阗|tián", "14|阚|kàn", "16|阛|huán", "15||chuài"}
	//冖
	char_mi = Charset{
		"2|冖|mì", "4|冗|rǒng", "4|冘|yín", "5|写|xiè,xiě", "5|冚|kǎn", "6|军|jūn", "6|农|nóng", "4||hǎn", "7|罕|hǎn", "7|冝|yí", "8|冞|shēn", "8|罙|shēn", "9|冠|guàn,guān", "9|冟|shì", "10|冥|míng", "10|冤|yuān", "10|冢|zhǒng", "10|冣|zuì", "10|冦|kòu", "10|冧|lín", "10|冡|měng", "11|冨|fù", "14|冩|xiě", "15|冪|mì"}
	//口
	char_kou = Charset{
		"3|口|kǒu", "5|叭|bà,bā,pā", "5|叱|chì", "5|叨|dāo,tāo", "5|叼|diāo", "5|叮|dīng", "5|句|gōu,jù", "5|古|gǔ", "5|号|hào", "5|叽|jī", "5|叫|jiào", "5|可|kè,kě", "5|叩|kòu", "5|叻|lè", "5|另|lìng", "5|叵|pǒ", "5|叶|shè,xié,yè", "5|史|shǐ", "5|司|sī", "5|台|tái,tāi", "5|叹|tàn", "5|右|yòu", "5|召|zhào", "5|只|zhǐ,zhī", "5|叺|chǐ", "5|叾|duge", "5|叧|guǎ", "5|叴|qiú", "6|吖|ā,yā", "6|吃|chī", "6|吊|diào", "6|合|gě,hé", "6|各|gè,gě", "6|吓|hè,xià", "6|后|hòu", "6|吉|jí", "6|吏|lì", "6|吕|lǚ", "6|吗|má,mǎ,mɑ", "6|名|míng", "6|同|tóng,tòng", "6|吐|tù,tǔ", "6|吸|xī", "6|向|xiàng", "6|吁|xū,yù,yū", "6|吆|yāo", "6|吒|zhā", "6|吋|dòu", "6|叿|hōng", "6|吇|zǐ", "6|吂|máng", "6|吀|miē", "6|吅|xuān", "6|吔|yē", "7|吧|bā,bɑ", "7|呗|bài,bei", "7|吡|bǐ,pǐ", "7|吥|bù", "7|吵|chǎo,chāo", "7|呈|chéng", "7|吹|chuī", "7|呆|dāi", "7|呔|dāi,tǎi", "7|吨|dūn", "7|吪|é", "7|呃|e,ě", "7|吠|fèi", "7|吩|fēn", "7|否|fǒu,pǐ", "7|呋|fū", "7|告|gào", "7|呙|guō", "7|含|hán,hàn", "7|吭|háng,kēng", "7|吽|hōng", "7|吰|hóng", "7|吼|hǒu", "7|君|jūn", "7|呖|lì", "7|吝|lìn", "7|呒|m", "7|呐|nà,nè", "7|呕|ǒu", "7|启|qǐ", "7|呛|qiàng,qiāng", "7|吣|qìn", "7|吮|shǔn", "7|听|tīng", "7|吞|tūn", "7|吻|wěn", "7|呜|wū", "7|吾|wú", "7|吴|wú", "7|吷|xuè", "7|呀|yā,yɑ", "7|呓|yì", "7|吟|yín", "7|吲|yǐn", "7|员|yuán,yún,yùn", "7|吱|zī,zhī", "7|呌|jiào", "7|吢|qìn", "7|吚|yī", "7|吳|wú", "7|呎|chǐ", "7|吜|chǒu", "7|吺|dōu", "7|吿|gɑo", "7|吤|jiè", "7|呄|gé", "7|吙|huō", "7|呁|jùn", "7|呂|lǚ", "7|呅|wěn", "7|吶|nà", "7|吘|ǒu", "7|呇|qǐ", "7|呏|shēng", "7|呑|tūn", "7|咓|wǎ", "7|呚|huá", "7|呉|wú", "7|咞|xiɑn", "7|呍|hōng", "8|呵|ā,ɑ,hā,hē,kē", "8|哎|āi", "8|咑|dā", "8|咚|dōng", "8|咄|duō", "8|咈|fú", "8|咐|fù", "8|呷|gā,xiā", "8|咖|gā,kā", "8|咕|gū", "8|呱|gū,guǎ,guā", "8|咍|hāi", "8|和|hé,hè,hú,huo,huó,huò", "8|呼|hū", "8|咎|jiù", "8|咀|jǔ,zuī", "8|咔|kǎ,kā", "8|呤|líng,lìng", "8|咙|lóng", "8|呣|m", "8|命|mìng", "8|呶|náo,nǔ", "8|呢|ne,ní", "8|咛|níng", "8|咆|páo", "8|呸|pēi", "8|呿|qù", "8|呥|rán", "8|呻|shēn", "8|咝|sī", "8|呫|tiè", "8|味|wèi", "8|呦|yōu", "8|咂|zā", "8|咋|zǎ,zé,zhà,zhā", "8|周|zhōu", "8|咒|zhòu", "8|咼|wāi", "8|呪|zhòu", "8|咊|hé", "8|呝|è", "8|咏|yǒng", "8|咇|bì", "8|咘|bù", "8|呬|xì", "8|呮|qì", "8|呹|yì", "8|呾|dá", "8|呧|dǐ", "8|咁|xián", "8|呴|xǔ", "8|呺|xiāo", "8|呟|juǎn", "8|呡|wěn", "8|呠|pěn", "8|呯|píng", "8|咅|pǒu", "8|呞|shī", "8|呩|shì", "8|咜|tuō", "8|咃|tuō", "8|咉|yǎng", "8|呭|yì", "8|咗|zuo", "8|黾|měng,mǐn", "9|哀|āi", "9|哔|bì", "9|咤|chà,zhà", "9|呲|cī", "9|哒|dā", "9|咥|dié,xì", "9|哆|duō", "9|哚|duǒ", "9|咡|èr", "9|咯|gē,kǎ,lo,luò", "9|哏|gén,hěn", "9|咣|guāng", "9|咶|guō", "9|哈|hà,hǎ,hā", "9|咳|hái,hāi,ké", "9|哄|hòng,hǒng,hōng", "9|哗|huá,huā", "9|咴|huī", "9|哕|huì,yuě", "9|咭|jī", "9|哜|jì", "9|哙|kuài", "9|哐|kuāng", "9|咧|lie,liè", "9|咪|mǐ,mī", "9|咩|miē", "9|哞|mōu", "9|哪|nà,nǎ,nǎi,né,něi", "9|哝|nóng", "9|哌|pài", "9|品|pǐn", "9|哂|shěn", "9|咷|táo", "9|哇|wā,wɑ", "9|咸|xián", "9|响|xiǎng", "9|哓|xiāo", "9|咲|xiào", "9|咻|xiū", "9|哑|yǎ,yā", "9|咽|yàn,yān,yè", "9|咬|yǎo", "9|咿|yī", "9|咦|yí", "9|哟|yo,yō", "9|哉|zāi", "9|咱|zán", "9|咫|zhǐ", "9|咮|zhòu", "9|咨|zī", "9|呰|zǐ", "9|咵|kuā", "9|哅|xiōng", "9|咹|è", "9|唌|dàn", "9|哋|diè", "9|咢|è", "9|咟|huò", "9|咾|lǎo", "9|哖|nián", "9|哛|popuni", "9|咠|qì", "9|咰|shù", "9|哃|tóng", "9|哘|xing", "9|咺|xuǎn", "9|哊|yòu", "10|啊|á,à,ǎ,ā,ɑ", "10|唉|ài,āi", "10|哱|bō", "10|哺|bǔ", "10|唓|chē", "10|哧|chī", "10|唇|chún", "10|唗|dōu", "10|哦|é,ó", "10|哥|gē", "10|哿|gě", "10|哽|gěng", "10|唝|gòng,hǒng", "10|唅|hán,hàn", "10|哼|heng,hēng", "10|唤|huàn", "10|唧|jī", "10|哭|kū", "10|唠|láo,lào", "10|哩|li,lī,yīnglǐ", "10|哢|lòng", "10|唛|mà", "10|唦|shā", "10|哨|shào", "10|唆|suō", "10|唢|suǒ", "10|唐|táng", "10|唔|wú", "10|唏|xī", "10|哯|xiàn", "10|哮|xiào", "10|唁|yàn", "10|唣|zào", "10|哳|zhā", "10|哲|zhé", "10|哶|miē", "10|唘|qǐ", "10|唡|liǎng", "10|員|yuán", "10|唄|bei", "10|唑|zuò", "10|唕|zào", "10|唚|qìn", "10|哵|bā", "10|哣|pǒu", "10|唙|dí", "10|唖|yǎ", "10|哹|fú", "10|唂|gū", "10|唃|gū", "10|哻|hān", "10|哠|hào", "10|哬|hè", "10|唊|jiá", "10|唟|gexi", "10|哴|liàng", "10|唥|léng", "10|哰|láo", "10|唎|li", "10|哷|liè", "10|哤|máng", "10|唜|mɑsi", "10|唴|qiàng", "10|唒|qiú", "10|哾|chuò", "10|哸|suī", "10|唞|dóu", "10|唋|tǔ", "10|唍|wǎn", "10|唈|yì", "10|唀|yòu", "10|唨|zǔ", "10|哫|zú", "11|唵|ǎn", "11|啵|bo,bō", "11|唱|chàng", "11|啜|chuài,chuò", "11|啐|cuì,qi", "11|啖|dàn", "11|啶|dìng", "11|啡|fēi", "11|唪|fěng", "11|啯|guō", "11|啝|hé", "11|啈|hèng", "11|唿|hū", "11|唬|hǔ,xià", "11|唶|jiè", "11|唫|jìn", "11|啃|kěn", "11|啦|lā,lɑ", "11|唻|lái", "11|啷|lāng", "11|唳|lì", "11|啉|lín,lìn", "11|啰|luo,luó,luō", "11|喵|miāo", "11|啮|niè", "11|喏|nuò,rě", "11|啪|pā", "11|啤|pí", "11|啬|sè", "11|啥|shá", "11|啑|shà,tì", "11|唼|shà", "11|商|shāng", "11|售|shòu", "11|唰|shuā", "11|啴|tān", "11|啕|táo", "11|唾|tuò", "11|啘|wā", "11|喎|wāi", "11|唯|wéi", "11|啸|xiào", "11|唷|yō", "11|啧|zé", "11|啁|zhāo,zhōu", "11|啭|zhuàn", "11|啄|zhuó", "11|啞|yǎ", "11|啢|liǎng", "11|唸|niàn", "11|啗|dàn", "11|啓|qǐ", "11|啟|qǐ", "11|問|wèn", "11|啀|ái", "11|喯|pèn", "11|啚|bǐ", "11|啋|cǎi", "11|啛|cuì", "11|啇|dí", "11|啲|dī", "11|唲|ér", "11|啹|jú", "11|啒|gǔ", "11|啩|guà", "11|啳|quán", "11|啱|yán", "11|啂|gòu", "11|唭|qì", "11|啔|qǐ", "11|啌|qiāng", "11|啨|qíng", "11|唺|tiǎn", "11|啍|zhūn", "11|唩|wō", "11|啎|wǔ", "11|唽|xī", "11|営|yíng", "11|唹|yū", "11|喐|huò", "11|啫|zé", "11|啅|zhuó", "11|啠|zhé", "12|啽|án", "12|嗏|chā", "12|喳|chā,zhā", "12|啻|chì", "12|喘|chuǎn", "12|嗒|dā,tà", "12|喋|dié,zhá", "12|喊|hǎn", "12|喝|hè,hē", "12|喉|hóu", "12|喤|huáng", "12|喙|huì", "12|嗟|jiē", "12|喈|jiē", "12|啾|jiū", "12|喀|kā", "12|喾|kù", "12|喹|kuí", "12|喟|kuì", "12|喇|lá,là,lǎ,lā,lɑ", "12|喱|lí", "12|喨|liàng", "12|喽|lou,lóu", "12|喃|nán", "12|喷|pèn,pēn", "12|善|shàn", "12|嗖|sōu", "12|啼|tí", "12|嗢|wà", "12|喂|wèi", "12|喔|wō", "12|喜|xǐ", "12|喧|xuān", "12|喭|yàn", "12|喓|yāo", "12|喑|yīn", "12|喁|yóng,yú", "12|喻|yù", "12|喌|zhōu", "12|嗞|zī", "12|啙|zǐ", "12|喬|qiáo", "12|喆|zhé", "12|喫|chī", "12|單|dān", "12|喦|yán", "12|啣|xián", "12|喒|zán", "12|喲|yō", "12|喺|xí", "12|喰|cān", "12|喢|shà", "12|喠|zhǒng", "12|啿|dàn", "12|喥|duó", "12|嘅|kǎi", "12|喼|jiē", "12|嗗|wā", "12|喛|huàn", "12|喖|hú", "12|喚|huàn", "12|喞|jī", "12|喕|miǎn", "12|喸|pɑoxi", "12|嗴|qiāng", "12|啺|táng", "12|喡|wéi", "12|喴|wēi", "12|喣|xǔ", "12|喅|yù", "12|喩|yù", "12|喗|yǔn", "13|嗄|á,shà", "13|嗳|ài,ǎi,āi", "13|嗌|ài,yì", "13|嗷|áo", "13|嗔|chēn,tián", "13|嗤|chī", "13|嗲|diǎ", "13|嘟|dū", "13|嗝|gé", "13|嗨|hāi,hēi", "13|嗐|hài", "13|嗥|háo", "13|嗑|kè", "13|嗯|n", "13|嗫|niè", "13|嗙|pǎng", "13|嗛|qiǎn,qiān,xián", "13|嗪|qín", "13|嗓|sǎng", "13|嗜|shì", "13|嗣|sì", "13|嗉|sù", "13|嗍|suō", "13|嗦|suo", "13|嗡|wēng", "13|嗅|xiù", "13|嗈|yōng", "13|嗇|sè", "13|嗸|áo", "13|嗬|hē", "13|嘩|huá", "13|嗊|gòng", "13|嗎|má", "13|嗩|suǒ", "13|嗶|bì", "13|嗆|qiàng", "13|嗚|wū", "13|嗁|tí", "13|喍|chái", "13|嗭|zi", "13|嗰|gě", "13|嗀|hù", "13|嗃|hè", "13|嗘|jī", "13|嗧|jiālún", "13|嗠|lào", "13|嗹|lián", "13|嗼|mò", "13|嗱|ná", "13|喿|zào", "13|嗕|rù", "13|嗮|sɑi", "13|嗵|tōng", "13|嗋|xié", "13|嗂|yáo", "10||wāi", "14|嘣|bēng", "14|嘈|cáo", "14|嘚|dē,dēi", "14|嘀|dí,dī", "14|嘎|gǎ,gā", "14|嘏|gǔ,jiǎ", "14|嘝|hú", "14|嘒|huì", "14|嘉|jiā", "14|嘞|lē,lei", "14|嘛|mɑ", "14|嘧|mì", "14|嘌|piào,piāo", "14|嘁|qī", "14|嘘|shī,xū", "14|嗾|sǒu", "14|嗽|sòu", "14|嘡|tāng", "14|嘕|xiān", "14|嘐|xiāo", "14|嘤|yīng", "14|嗻|zhè,zhē", "14|嘗|cháng", "14|嘖|zé", "14|嘆|tàn", "14|嘜|mà", "14|嘔|ǒu", "14|嘑|hū", "14|嘍|lóu", "14|嘓|guō", "14|噉|dàn", "14|嘊|ái", "14|嘇|shān", "14|嘨|xiào", "14|嘃|chōng", "14|嘄|jiào", "14|嘢|yě", "14|噑|háo", "14|嘂|jiào", "14|嘦|jiào", "14|嘙|pó", "14|嘥|sāi", "14|嗺|zuī", "14|嗿|tǎn", "14|嘋|xiào", "15|噌|cēng,chēng", "15|嘲|cháo,zhāo", "15|嘬|chuài,zuō", "15|噇|chuáng", "15|噔|dēng", "15|噁|é", "15|噶|gá", "15|嘿|hēi,mò", "15|噍|jiào", "15|噘|juē", "15|嘹|liáo", "15|噜|lū", "15|噢|ō", "15|嘭|pēng", "15|噗|pū", "15|噙|qín", "15|噎|shā,yē", "15|嘶|sī", "15|嘻|xī", "15|噏|xī", "15|噀|xùn", "15|嘱|zhǔ", "15|噂|zǔn", "15|噐|qì", "15|噴|pēn", "15|嘵|xiāo", "15|嘠|gā", "15|噠|dā", "15|嘽|tān", "15|嘸|fǔ", "15|嘷|háo", "15|嘮|lào", "15|噚|xún", "15|噝|sī", "15|嘰|jī", "15|噃|fān", "15|噆|zǎn", "15|噄|chī", "15|嘼|chù", "15|噈|cù", "15|嘾|dàn", "15|噵|dào", "15|嘳|kuì", "15|噅|huī", "15|噕|huī", "15|噋|tūn", "15|噒|lián", "15|嘪|mǎi", "15|噛|niè", "15|嘺|qiáo", "15|嘫|rán", "15|噓|xū", "15|噧|xiè", "15|噖|yín", "15|噊|jué", "16|噫|ài,yì,yī", "16|噩|ě", "16|嚆|hāo", "16|嚄|huò,huō", "16|噭|jiào", "16|噤|jìn", "16|噱|jué,xué", "16|噼|pī", "16|器|qì", "16|噻|sāi", "16|噬|shì", "16|噪|zào", "16|噣|zhòu", "16|嘴|zuǐ", "16|噸|dūn", "16|噦|yuě", "16|噹|dāng", "16|噥|nóng", "16|噯|ǎi", "16|噲|kuài", "16|噰|yōng", "16|嘯|xiào", "16|噡|zhān", "16|噷|xīn", "16|嚃|tà", "16|噺|hɑnɑxi", "16|噞|yǎn", "16|噟|yīng", "16|噳|yǔ", "16|噮|yuàn", "17|嚓|cā,chā", "17|嚎|háo", "17|嚅|rú", "17|嚏|tì", "17|嚮|xiàng", "17|噽|pǐ", "17|嚇|hè", "17|嚐|cháng", "17|嚀|níng", "17|嚌|jì", "17|嚋|zhōu", "17|嚁|dí", "17|嚉|duō", "17|嚂|làn", "17|嚝|hōng", "17|嚍|jìn", "17|嚒|me", "17|嚊|xiù", "17|嚑|xun", "17|嚈|yàn", "17|噾|yīn", "17|噿|zuǐ", "18|嚣|áo,xiāo", "18|嚜|me", "18|嚚|yín", "18|嚙|niè", "18|嚕|lū", "18|嚗|bó", "18|嚡|xié", "18|嚛|hù", "18|嚖|huì", "18|嚟|lí", "18|嚠|liú", "18|嚤|mō", "18|嚢|náng", "18|嚔|tì", "18|嚘|yōu", "18|嚞|zhé", "19|嚯|huò", "19|嚬|pín", "19|嚭|pǐ", "19|嚥|yàn", "19|嚦|lì", "19|嚴|yán", "19|嚫|chèn", "19|嚪|dàn", "19|嚧|lú", "19|嚰|me", "19|嚩|pó", "20|嚾|huān", "20|嚼|jiáo,jiào,jué", "20|嚷|rǎng,rāng", "20|嚲|duǒ", "20|嚨|lóng", "20|嚶|yīng", "20|嚳|kù", "20|嚵|chán", "20|嚽|chuò", "20|嚸|dimi", "20|嚿|huò", "20|嚹|lá", "20|嚺|tà", "20|嚱|xī", "17||hǎn", "21|囁|niè", "21|囈|yì", "21|囀|zhuàn", "21|囂|xiāo", "21|嚻|xiāo", "21|囃|zá", "21|囆|chài", "21|囄|lí", "22|囊|náng,nāng", "22|囋|zá,zàn", "22|囅|chǎn", "22|囉|luō", "22|囌|sū", "22|囇|lì", "22|囎|zèng", "23|囐|yàn", "23|囏|jiān", "23|囒|lán", "24|囓|niè", "24|囑|zhǔ", "24|囍|xǐ", "24|囕|rɑmo", "25|囔|nāng,nɑng", "22||hǎn", "28|囖|luó"}
	//广
	char_guang = Charset{
		"3|广|ān,guǎng", "5|庀|pǐ", "5|広|guǎng", "5|庁|tīng", "5|庂|zè", "6|庆|qìng", "6|庄|zhuāng", "6|庅|me", "7|庇|bì", "7|床|chuáng", "7|庋|guǐ", "7|库|kù", "7|庐|lú", "7|庑|wǔ", "7|序|xù", "7|应|yìng,yīng", "7|庎|jiè", "7|庒|zhuāng", "7|庍|bài", "7|庉|dùn", "7|庈|qín", "7|庌|yǎ", "8|底|de,dǐ", "8|店|diàn", "8|废|fèi", "8|府|fǔ", "8|庚|gēng", "8|庙|miào", "8|庞|páng", "8|庖|páo", "8|庝|tóng", "8|庘|yā", "9|度|dù,duó", "9|庭|tíng", "9|庠|xiáng", "9|庥|xiū", "9|庡|yǐ", "9|庰|bìng", "9|庛|cì", "9|庣|tiāo", "9|庢|zhì", "9|庤|zhì", "10|庯|bū", "10|座|zuò", "10|庩|tú", "10|庫|kù", "10|庪|guǐ", "10|庬|máng", "10|庨|xiāo", "10|庮|yóu", "11|庵|ān", "11|庳|bì", "11|康|kāng", "11|廊|láng", "11|庼|qǐng", "11|庶|shù,zhù", "11|庹|tuǒ", "11|庸|yōng", "11|庾|yǔ", "11|庻|shù", "11|庿|miào", "11|庺|sōng", "11|庱|chěng", "11|庴|jī", "11|庲|lái", "12|赓|gēng", "12|廂|xiāng", "12|廁|cè", "12|廄|jiù", "12|廃|fèi", "12|廀|sōu", "12|廆|guī,huì,wěi", "12|廋|sōu", "12|庽|yù", "12|廐|jiù", "13|廒|áo", "13|廓|kuò", "13|廉|lián", "13|廈|shà", "13|廕|yìn", "13|廍|bù", "13|廅|è", "13|廇|liù", "13|廌|zhì", "14|廑|jǐn,qín", "14|廖|liào", "14|廏|jiù", "14|廣|guǎng", "14|廗|dài", "14|廔|lóu", "14|廘|lù", "14|廎|qǐng", "14|廜|tú", "14|廙|yì", "15|廛|chán", "15|廚|chú", "15|廝|sī", "15|廤|kɑox", "15|廟|miào", "15|廠|chǎng", "15|廡|wǔ", "15|廢|fèi", "15|廞|xīn", "16|廪|lǐn", "16|廨|xiè", "16|廩|lǐn", "16|廥|kuài", "16|廦|bì", "16|廧|qiáng", "18|廫|liáo", "19|廭|ji", "19|廬|lú", "20|廰|tīng", "20|廯|xiān", "20|廮|yǐng", "21|廱|yōng", "22|廲|lí", "25|廳|tīng"}
	//山
	char_shan = Charset{
		"3|山|shān", "4|屲|wā", "5|屶|huì", "5|屵|àn", "5|屷|huì", "5|屴|lì", "5|屳|xiān", "6|岌|jí", "6|岂|qǐ", "6|屺|qǐ", "6|岁|suì", "6|屼|wù", "6|屹|yì", "6|屿|yǔ", "6|屽|hàn", "6|岀|chū", "6|岋|è", "6|屸|hóng", "6|屻|rèn", "6|屾|shēn", "6|岃|yin", "7|岙|ào", "7|岜|bā", "7|岑|cén", "7|岔|chà", "7|岛|dǎo", "7|岗|gàng,gǎng,gāng", "7|岚|lán", "7|岐|qí", "7|岍|qiān", "7|岖|qū", "7|岘|xiàn", "7|岈|yá", "7|岅|bǎn", "7|岠|jù", "7|岇|áng", "7|岎|fén", "7|岊|jié", "7|岕|jiè", "7|岓|qí", "7|岒|qián", "7|岏|wán", "7|岉|wù", "7|岆|yǎo", "7|岄|yuè", "8|岸|àn", "8|岱|dài", "8|岽|dōng", "8|岣|gǒu", "8|岵|hù", "8|岬|jiǎ", "8|岢|kě", "8|岿|kuī", "8|岭|lǐng", "8|峁|mǎo", "8|岷|mín", "8|岧|tiáo", "8|峂|tóng", "8|岫|xiù", "8|峃|xué", "8|岩|yán", "8|峄|yì", "8|岳|yuè", "8|岡|gāng", "8|岞|zuò", "8|岰|ào", "8|峀|xiù", "8|峅|biɑn", "8|岾|zɑi", "8|岻|dī", "8|岪|fú", "8|岨|jū", "8|岲|kuàng", "8|岦|lì", "8|岺|lǐng", "8|岯|pī", "8|岼|ping", "8|岥|pō", "8|岶|pò", "8|岴|qū", "8|岹|tiáo", "8|岮|tuó", "8|岤|xuè", "8|岟|yǎng", "8|岝|zuò", "9|峒|dòng,tóng", "9|峧|jiāo", "9|峤|jiào,qiáo", "9|峦|luán", "9|峙|shì,zhì", "9|峡|xiá", "9|峋|xún", "9|峣|yáo", "9|峥|zhēng", "9|峕|shí", "9|峝|tóng", "9|峖|ān", "9|峇|kè", "9|峸|chéng", "9|峌|dié", "9|峉|é", "9|峎|ěn", "9|峏|ér", "9|峊|fù", "9|峐|gāi", "9|峠|qiǎ", "9|峆|hé", "9|峘|huán", "9|峜|fǎ", "9|峛|lǐ", "9|峢|lǐ", "9|峍|lù", "9|峈|luò", "9|峚|mì", "9|峔|mǔ", "9|峑|quán", "9|峗|wéi", "9|峞|wéi", "9|峫|xié", "9|峓|yí", "9|峟|yòu", "10|峬|bū", "10|峨|é", "10|峰|fēng", "10|峻|jùn", "10|崁|kàn", "10|崃|lāi", "10|崀|làng", "10|崂|láo", "10|峱|náo", "10|峭|qiào", "10|峪|yù", "10|峽|xiá", "10|峴|xiàn", "10|峩|é", "10|島|dǎo", "10|峯|fēng", "10|峼|gào", "10|峺|gěng", "10|崋|huà", "10|峲|lǐ", "10|崅|què", "10|峮|qún", "10|峵|róng", "10|峷|shēn", "10|峹|tú", "10|峿|wú", "10|崄|xiǎn", "10|峾|yín", "10|峳|yōu", "11|崩|bēng", "11|崇|chóng", "11|崔|cuī", "11|崮|gù", "11|崞|guō", "11|崌|jū", "11|崛|jué", "11|崆|kōng", "11|崚|líng", "11|崎|qí", "11|崤|xiáo", "11|崖|yá", "11|崦|yān", "11|崟|yín", "11|崭|zhǎn", "11|崒|zú", "11|崧|sōng", "11|崬|dōng", "11|崕|yá", "11|崍|lái", "11|崗|gǎng", "11|崑|kūn", "11|崐|kūn", "11|崯|yín", "11|崘|lún", "11|崙|lún", "11|崪|zú", "11|崥|pí", "11|崈|chóng", "11|崠|dōng", "11|崜|duǒ", "11|崓|gù", "11|崡|hán", "11|崨|jié", "11|崫|jué", "11|崊|lín", "11|崏|mín", "11|崉|tà", "11|崣|wěi", "11|崝|zhēng", "11|崢|zhēng", "11|崰|zī", "12|嵖|chá", "12|嵯|cuó", "12|崿|ě", "12|嵇|jī", "12|嵁|kān", "12|嵝|lǒu", "12|嵋|méi", "12|嵌|qiàn", "12|嵚|qīn", "12|嵘|róng", "12|崴|wǎi,wēi", "12|嵬|wéi", "12|嵎|yú", "12|嵛|yú", "12|崽|zǎi", "12|嵫|zī", "12|嵗|suì", "12|嵐|lán", "12|嵳|cuó", "12|崵|yáng", "12|崼|shì", "12|崶|fēng", "12|嵅|hán", "12|嵈|huàn", "12|崲|huáng", "12|嵆|jī", "12|嵑|kě", "12|嵙|ke", "12|嵂|lǜ", "12|嵍|wù", "12|嵄|měi", "12|嵒|yán", "12|嵜|qi", "12|崷|qiú", "12|崹|tí", "12|嵉|tíng", "12|嵔|wēi", "12|嵃|yǎn", "12|嵓|yán", "12|崸|yáng", "12|崾|yǎo", "12|崺|yǐ", "12|崳|yú", "12|崱|zè", "12|崻|zhì", "12|嵀|zhù", "12|嵏|zōng", "12|嵕|zōng", "13|嶅|áo", "13|嵴|jí", "13|嵲|niè", "13|嵊|shèng", "13|嵩|sōng", "13|嵠|xī", "13|嵦|kǎi", "13|嵭|bēng", "13|嵢|cāng", "13|嵣|dàng", "13|嵮|diān", "13|嵟|cuī", "13|嵥|jié", "13|嵪|kāo", "13|嵧|liú", "13|嵰|qīn", "13|嵤|róng", "13|嵶|ruo", "13|嵵|shi", "13|嵞|tú", "13|嵡|wěng", "13|嵨|wù", "13|嵱|yǒng", "14|嶍|xí", "14|嶂|zhàng", "14|嵸|zōng", "14|嵽|dié", "14|嶄|zhǎn", "14|嶃|zhǎn", "14|嶇|qū", "14|嶁|lǒu", "14|嵾|cēn", "14|嶆|cáo", "14|嵼|yǎn", "14|嶉|wěi", "14|嶋|dǎo", "14|嶌|dǎo", "14|嵿|dǐng", "14|嶞|tuò", "14|嵺|liáo", "14|嵻|kāng", "14|嶐|lóng", "14|嶈|qiāng", "14|嵷|sǒng", "14|嶀|tū", "14|嶑|xiàng", "14|嶎|yù", "14|嶊|zuǐ", "15|嶓|bō", "15|嶒|céng", "15|嶝|dèng", "15|嶙|lín", "15|嶟|zūn", "15|嶢|yáo", "15|嶠|jiào", "15|嶴|ào", "15|嶔|qīn", "15|嶗|láo", "15|嶡|jué", "15|嶯|jí", "15|嵹|jiàng", "15|嶕|jiāo", "15|嶣|jiāo", "15|嶜|qín", "15|嶥|jué", "15|嶱|kě", "15|嶚|liáo", "15|嶛|liáo", "15|嶏|pǐ", "15|嶖|yān", "15|嶤|yáo", "15|嶘|zhàn", "16|嶰|xiè", "16|嶪|yè", "16|嶩|náo", "16|嶧|yì", "16|嶼|yǔ", "16|嶨|xué", "16|嶮|xiǎn", "16|嶳|dì", "16|嶭|niè", "16|嶦|zhān", "16|嶶|wei", "16|嶫|yè", "16|嶬|yí", "16|嶵|zuì", "13|﨑|qí", "17|嶷|nì,yí", "17|嶽|yuè", "17|嶺|lǐng", "17|嶹|dǎo", "17|嶻|jié", "17|巁|lì", "17|嶸|róng", "17|嶿|ru", "17|嶾|yǐn", "18|巂|xī,xī", "18|嶲|guī", "18|巀|jié", "19|巅|diān", "19|巆|yíng", "19|巌|yán", "20|巉|chán", "20|巍|wēi", "20|巇|xī", "20|巈|jú", "20|巃|lóng", "20|巄|lóng", "20|巏|quán", "20|巊|yǐng", "21|巋|kuī", "21|巐|chǎo", "22|巎|náo", "22|巓|diān", "22|巒|luán", "22|巖|yán", "22|巗|yán", "22|巑|cuán", "22|巕|niè", "23|巘|yǎn", "23|巔|diān", "23|巚|yǎn", "24|巙|kuí"}
	//爫
	char_zhao = Charset{
		"4|爫|zhǎo", "8|爭|zhēng", "9|爰|yuán", "9|爯|chēng", "10|爱|ài", "12|爲|wéi", "14|爳|hɑn", "17|爵|jué"}
	//亠
	char_tou = Charset{
		"2|亠|tóu", "3|亡|wáng,wú", "4|亢|kàng", "4|亣|dà", "6|充|chōng ", "6|产|chǎn", "6|亥|hài", "6|交|jiāo", "6|亦|yì", "7|亨|hēng", "7|亩|mǔ", "7|亪|ye", "8|京|jīng", "8|享|xiǎng", "8|兖|yǎn", "9|亮|liàng", "9|亲|qīn,qìng", "9|亭|tíng", "9|亱|yè", "9|亰|jīng", "9|亯|xiǎng", "9|兗|yǎn", "10|亳|bó", "10|亵|xiè", "10|亴|yòu", "10|衰|shuāi", "10|衷|zhōng", "10|亶|dàn,dǎn", "10|亷|lián", "12|裏|lǐ", "16|亸|duǒ", "19|羸|léi", "22|亹|mén,wěi"}
)

//
//func TestUpdateCharacter(t *testing.T) {
// max := len(charList)
// cs := make(chan string, max)
// for _, list := range charList {
//  go func(cl []NameChar, rdc string, s chan string) {
//
//   for _, v := range cl {
//    model.UpdateCharacter(strings.TrimSpace(v.NameChar), model.RadicalChar{
//     v.Strokes,//     strings.TrimSpace(v.NameChar),//     strings.TrimSpace(v.Pinyin),//     strings.TrimSpace(rdc),//    })
//
//   }
//   s <- rdc
//  }(list.NameChatList, list.Radical, cs)
//
// }
//
// for i := 0; i < max; i++ {
//  log.Println(<-cs, "is done")
// }
//
//}

//
//func TestUpdateCharacter2(t *testing.T) {
// max := len(fixList)
// wg.Add(max)
// for _, list := range fixList {
//  nc := strings.TrimSpace(list.NameChars)
//  nca := strings.Split(nc, " ")
//  go func(cl  Charset, st string) {
//   defer wg.Done()
//   sti, _ := strconv.ParseUint(st, 10, 32)
//   for _, v := range cl {
//    model.UpdateCharacter(strings.TrimSpace(v), model.RadicalChar{
//     int(sti),//     strings.TrimSpace(v),//     strings.TrimSpace(""),//     strings.TrimSpace(""),//    })
//   }
//  }(nca, list.Strokes)
// }
// wg.Wait()
// log.Println("Done")
//}

var scienceFixList = Charset{
	"",
	"一 乙",
	"二 乃 了 人 入 刀 力 卜 又 几 丁",
	"三 上 下 久 个 丸 乞 也 于 千 大 子 寸 小 山 川 工 己 匀 女 子",
	"四 中 丹 之 予 云 井 亢 介 仁 元 公 切 分 化 午 升 友 及 太 天 夫 少 引 心 户 支 文 斗 斤 方 日 月 木 火 水 比",
	"五 丘 且 世 丙 主 井 仕 仙 代 令 冬 出 加 功 包 北 半 占 卯 右 可 句 叶 古 司 只 召 外 本 巧 巨 市 布 平 弘 弗 必 戊 旦 正 民 永 玉 瓦 甘 生 用 田 由 甲 申 白 目 石 穴 立",
	"六 亘 交 仰 任 仲 伏 仔 光 先 兆 全 共 再 列 印 合 吉 向 后 同 名 宇 存 安 字 守 州 帆 年 旭 早 有 求 百 弛 竹 米 羊 羽 臣 自 至 舟 行 衣 西 回 如 充 成",
	"七 亨 吾 均 坐 壮 声 妙 孝 宏 局 希 序 志 戒 改 更 杏 材 村 位 佑 作 伯 伴 体 余 克 兑 兵 初 判 利 助 告 君 步 江 汗 汝 池 秀 究 良 见 言 彤 谷 豆 赤 车 辰",
	"八 并 事 亨 京 依 佳 侃 供 侍 使 佩 来 例 免 雨 其 具 典 冒 冽 函 刻 刷 刹 制 到 效 协 卓 卷 取 受 和 周 命 固 坤 垂 坦 坡 夜 奇 奈 奉 姑 始 妹 枚 板 林 欣 武 汲 决 沙 汰 冲 沛 沐 沃 汪 炎 炊 版 物 牧 玖 的 直 盲 知 社 空 究 舌 虎 采 金 长 昔 明 旺 服 朋 杭 果 枝 松 扭 东 门 青 季 孟 宜 官 宗 宙 定 尚 居 岳 岸 岩 岱 幸 庚 店 府 弦 征 彼 往 快 忽 忠 念 或 所 房 技 承 折 扶 政 放 齐 于 昂 昆 昌 升 昊 闰 兔",
	"九 亭 亮 系 侠 信 俊 保 便 侣 俞 冒 冠 克 前 则 劲 勉 勃 勇 南 厚 叙 咸 哄 品 垠 奎 奏 威 姻 姬 姜 妍 姿 客 宣 室 屋 巷 帝 幽 度 回 建 彦 待 律 思 性 易 招 拓 折 拜 抱 施 映 昨 是 春 星 昭 架 柯 查 柴 柔 柘 韦 柱 柏 柄 柳 段 油 泳 沿 河 况 注 泉 治 波 泊 法 冷 炳 帅 甚 界 皆 皇 盈 看 相 眉 祈 科 秋 秒 穿 突 竿 红 罕 美 耐 肖 衍 表 要 计 订 贞 军 重 门 面 革 音 风 飞 食 首 香 姣",
	"十 乘 倚 幸 仓 修 借 值 倍 仿 表 伦 党 兼 倡 刚 原 员 哥 唐 哲 城 夏 娥 宴 家 宫 宰 容 射 展 峡 岛 峰 师 席 库 航 般 芽 芹 花 芝 芳 娘 袁 衿 活 洪 洲 泰 洗 洞 派 洋 流 烘 烈 特 珂 珊 珍 玲 益 真 词 神 祝 组 祚 秦 秤 租 秘 并 竟 级 纱 纯 素 纳 纽 纺 纹 翁 者 耘 耿 育 股 皋 座 庭 径 徐 恩 恭 恢 恒 恤 息 恬 扇 拾 持 效 料 旁 旅 晏 晃 时 晋 书 朔 校 格 桂 根 栖 桃 桐 钊 殊 气 记 训 讨 豹 贡 财 起 马 支 高 娟 倩 娜 笔",
	"乾 伟 偕 健 偶 侧 停 侦 富 凰 剩 副 勘 动 务 区 卿 参 唯 启 商 唱 珠 般 产 皎 眼 婉 研 祥 移 竟 章 笛 伏 笙 弦 紫 绅 绍 绊 累 罩 习 翌 者 聊 胡 教 敏 斌 斜 旌 旋 族 晤 晨 晚 曹 望 朗 梗 梧 梓 梅 梨 梁 毫 球 海 浩 涉 涌 浴 烽 爽 崇 国 基 坚 执 堂 培 寅 寄 宿 寂 密 尉 寻 将 专 崔 巢 常 带 康 张 彩 彬 从 悦 悟 戚 挺 英 婕 若 苔 苗 茂 术 袖 许 责 赦 近 闭 雪 顷 顶 鹿 麦 扇 掘 卷 扫 舍 掌 迫 贰 量 开 闲 间 添 焰 无 为 犁 猛 球 麻 胜 佩 焕 盛",
	"仅 债 杰 催 惠 伤 舒 倦 传 勤 势 募 嗣 园 圆 块 干 廊 渡 湃 渺 照 煎 媒 炼 爷 琴 琢 琵 琶 棱 督 睦 碇 禁 禄 禽 稚 绢 义 圣 廉 巢 微 爱 意 惮 荣 雅 顺 翔 感 愚 想 愉 愈 斟 暑 会 极 楚 楠 枫 椰 榆 殿 景 钞 钦 发 农 退 乃 郊 电 佃 附 雌 雉 聘 肆 琛 唇 脱 台 获 莓 莫 蜀 街 词 衙 裟 装 裕 里 解 咏 夸 詹 资 迹 跳 路 载 浅 淘 淡 涯 涵 混 深 淑 清 饮 驯 驰 普 创 诏 雄 博 弼 智 贺 凯 等 筏 绞 给 绚 絮 绝 统 络 能 舜 砚 稀 稍 税 程 窗 竣 童 策 答 筑 筒 棠 栋 棒 棉 款 证 净 媛 登 授 捷 现 理 番 强 闵 雁 集 云 项 须 黑 备 接 注 评 象 贵 贴 贸 越 超 迪 茹 茫 众 传 割 劳 喜 乔 善 敢 散 敦 斑 斯 晶 晴 晰 最 替 棋 棍 栈 森 植 荒 草 曾 单 喻 围 堪 尧 场 堤 报 堡 媒 媚 寒 寓 寻 尊 岚 巽 帽 几 复 惟 情 荀 茜 茶",
	"团 图 寿 梦 奖 察 实 对 伪 侨 像 佟 煌 仆 僚 崭 廓 彰 愿 慈 慎 态 搬 业 温 港 渠 湖 湘 测 汤 滋 支 犒 猿 狮 瑟 鼓 监 尽 经 种 称 竭 端 个 算 精 紧 绰 绶 综 绯 绵 维 纶 绫 置 靖 晖 裳 暄 铃 群 郎 铅 阁 韶 领 饰 饱 仿 魁 魏 诗 试 询 诠 援 挥 扬 新 铁 莆 莎 莉 鸣 鼻 齐 瑛 碌 椿 琳 杨 虞 当 盟 酩 雷 颂 顿 预 鼎 鼓 雍 渊",
	"尽 俭 僻 剧 剑 劈 啸 豪 宽 番 寮 履 帜 广 熙 弹 影 微 彻 慰 慷 栗 醉 锐 锄 锋 铮 阅 院 阵 宵 霆 霈 落 蝶 冲 褓 复 课 谈 调 谅 敲 溪 源 溶 赐 质 赏 卖 趣 践 辈 轮 替 游 进 邮 部 醇 确 磁 磐 稼 稿 稻 期 朝 溢 沟 穷 箱 节 箭 范 篇 糊 纬 缘 缄 绪 线 缔 编 练 暑 义 铺 馆 苇 叶 葛 葵 管 著 虑 掴 摧 摩 数 暂 暴 暮 概 乐 槽 樟 枢 标 模 样 楼 欢 毅 演 汉 境 渐 涨 滞 漫 满 洋 熟 热 荧 瑶 玛 几 皓 盘 驾 驻 魄 鸦 华 惯 嘉 碧 樊 蒂 块 发 葆 渔 漆 纲 尝 彰 志 赫 辅 造 逍 速 逞 途 透 通 逢 连 静 萤 阴 银 铜 铭 齐 黄 旗 畅 槐 枪 歌 瑞 瑚 廖 硕 祯 福 翠 翡 台 与 舞 菊 果 菜 蜻 蜜 裙 诫 诰 诲 诚 誓 说 诞 认 貌 赈 宾 轻 赵 酸 宁 瑗 榕 诱 玮",
	"仪 仅 万 冀 剑 进 器 喷 论 坛 壁 奋 道 岭 憬 憧 抚 怜 战 撮 撤 撰 幢 播 扑 整 德 赓 晕 厉 机 陆 陵 鞘 头 余 默 桦 横 桥 橇 树 樽 橙 竖 洁 润 泄 贤 增 郭 赋 谷 莹 刘 烨 烧 燃 炖 磷 燎 芦 穆 窥 筛 筑 糖 县 罢 举 苍 蒸 席 辉 震 墨 娇 慧 萱 董 卫 衡 亲 谓 谒 诚 谏 谚 诸 豫 蹄 辑 办 运 遇 遂 道 达 都 醒 皓 锡 钱 总 橡 震 敬 磊 庆",
	"儒 优 赏 壕 壑 岳 应 撼 擒 擎 检 操 擅 择 擂 敛 檄 檀 褒 讲 谦 谢 豁 趋 龙 融 远 乡 键 针 钟 锻 阶 队 阳 馆 骏 鲜 点 齐 鸿 荫 襁 激 浓 颖 翰 致 雕 营 灿 烛 燧 微 响 独 瞰 瞬 禅 簇 纵 缝 声 聪 聊 临 艰 参 蔗 谅 蔬 钢 赛 璜 燃 兴 学 遥 晓 霖 澄 潮 潜 潭 蓉 蓄 茜 颖 璇 蓓 陶 陈 谘 璋 逸 霓 谋 颐 锦",
	"骏 澡 泽 黛 澧 澳 澹 激 逢 总 授 逊 斋 遣 忆 憾 懂 螺 恳 懈 应 懋 鲜 繁 韩 戴 搁 拟 擦 断 曜 曛 曙 涛 滨 爵 获 狞 猎 瞻 简 馈 箫 蔺 缮 翻 异 职 旧 荫 蕊 荡 蕃 蝉 声 讴 转 遭 适 鄙 医 锁 镇 锤 镰 聂 鸡 霜 离 雏 额 频 题 骑 鹃 灿 鞭 碧 霞 蒲 慕 鞠 隆",
	"劝 庐 扩 攀 旷 泻 溅 瀑 镜 关 雾 愿 类 鲸 鹊 鹏 麓 兽 猎 祷 稳 获 环 薄 绳 臆 臂 膺 薪 蔷 薇 襟 证 赞 赠 遵 郑 丰 礼 蕙 织 谨 济 归 濠 阔 湿",
	"还 释 钟 阐 露 飘 馨 璃 龄 宝 迈 怀 悬 胧 沥 献 琼 砾 籍 筹 篮 继 办 麒 辞 藏 萨 籍 薯 觉 触 译 议 警 赢 面 瀚 瀛 烁 蕾 选 辽 韵 绣",
	"翻 饶 驱 鸡 傈 属 巍 续 缠 腊 护 誉 贴 轰 辩 随 隐 霸 竞 耀 宝 识 篷 莲 罗",
	"顾 艺 俨 巅 摄 权 欢 灌 叠 穰 笼 听 澡 苏 览 赞 读 边 乡 餐 须 樱 铁 铎 栏 莺 鹤 锈",
	"岩 恋 织 藓 变 矿 显 驿 验 髓 体 乐 龚 懿 鉴 芦",
	"矗 罐 艳 燕 禳 酿 炉 陇 谒 灵 鹰 鑫 兰 麟",
	"听 篱 蛮 观 才 灵",
	"湾 瞩 赞 逻 爵 厌",
	"锣 銮 缆",
	"艳 欢 鹦",
	"麓",
	"鸾", //29
}

func InitAll() {
	runtime.GOMAXPROCS(runtime.NumCPU())
	initCharFrom5156()
	updateStrokes()
	updateFivePhase()
}

func initCharFrom5156() {
	list := excavator.Get("http://xh.5156edu.com")
	debug.Println("initCharFrom5156 start")
	log.Println(list)
	for k, v := range list {
		insertCharacter(v, k)
	}
	debug.Println("initCharFrom5156 end")
}

func insertCharacter(charset Charset, k string) {
	debug.Println("start: ", k)
	for _, v := range charset {
		s := strings.Split(v, "|")

		s0, _ := strconv.Atoi(s[0])
		if len(s) != 3 {
			debug.Println("wrong:", s)
			continue
		}
		c := model.Character{
			SimpleStrokes: s0,
			SimpleChar:    s[1],
			Pinyin:        s[2],
			Radical:       k,
		}
		i, e := c.Create()
		if e != nil {
			debug.Println(i, e)
		}
	}
	debug.Println("end", k)

}

func initLocalChar() {
	debug.Println("initChar start")
	for _, v := range charList {
		func(charset Charset) {
			radical := ""
			for _, v := range charset {
				s := strings.Split(v, "|")
				if radical == "" {
					radical = s[1]
					debug.Println("start", radical)
				}
				s0, _ := strconv.Atoi(s[0])
				if len(s) != 3 {
					debug.Println("wrong:", s)
					continue
				}
				c := model.Character{
					SimpleStrokes: s0,
					SimpleChar:    s[1],
					Pinyin:        s[2],
					Radical:       radical,
				}
				c.Create()
			}
			debug.Println("end", radical)
		}(v)
	}
	debug.Println("initChar end")
}

func updateStrokes() {
	debug.Println("updateStrokes start")
	for k, v := range scienceFixList {
		ScienceUpdate(k, v)
	}
	debug.Println("updateStrokes end")
}

func ScienceUpdate(index int, s string) {
	debug.Println("science:", index)
	sa := strings.Split(s, "")
	for _, v := range sa {
		if v == "" {
			continue
		}
		_ = v
		c := model.Character{SimpleChar: v}
		c = *c.Get()
		c.ScienceStrokes = index
		if uuid.FromStringOrNil(c.Id) == uuid.Nil {
			debug.Println("notfound: ", c)
			c.Create()
			continue
		}

	}

}

func updateFivePhase() {
	log.Println("555")
}
