/*
 Navicat Premium Data Transfer

 Source Server         : localhost_3306
 Source Server Type    : MySQL
 Source Server Version : 50719
 Source Host           : localhost:3306
 Source Schema         : fate

 Target Server Type    : MySQL
 Target Server Version : 50719
 File Encoding         : 65001

 Date: 09/01/2018 17:21:07
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for big_yan
-- ----------------------------
DROP TABLE IF EXISTS `big_yan`;
CREATE TABLE `big_yan`  (
  `id` varchar(40) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `created` datetime(0) NULL DEFAULT NULL,
  `updated` datetime(0) NULL DEFAULT NULL,
  `deleted` datetime(0) NULL DEFAULT NULL,
  `version` int(11) NULL DEFAULT 1,
  `index` int(11) NULL DEFAULT NULL,
  `goil` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `sky_nine` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `comment` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of big_yan
-- ----------------------------
INSERT INTO `big_yan` VALUES ('2539e0d1-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 1, '吉', '太极之数', '太极之数，万物开泰，生发无穷，利禄亨通。');
INSERT INTO `big_yan` VALUES ('253d3c16-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 2, '凶', '两仪之数', '两仪之数，混沌未开，进退保守，志望难达。');
INSERT INTO `big_yan` VALUES ('253ec2b5-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 3, '吉', '三才之数', '三才之数，天地人和，大事大业，繁荣昌隆。');
INSERT INTO `big_yan` VALUES ('2540705d-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 4, '凶', '四象之数', '四象之数，待于生发，万事慎重，不具营谋。');
INSERT INTO `big_yan` VALUES ('2541f73b-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 5, '吉', '五行之数', '五行俱权，循环相生，圆通畅达，福祉无穷。');
INSERT INTO `big_yan` VALUES ('25432f81-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 6, '吉', '六爻之数', '六爻之数，发展变化，天赋美德，吉祥安泰。');
INSERT INTO `big_yan` VALUES ('254615bc-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 7, '吉', '七政之数', '七政之数，精悍严谨，天赋之力，吉星照耀。');
INSERT INTO `big_yan` VALUES ('2547272e-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 8, '半吉', '八卦之数', '八卦之数，乾坎艮震，巽离坤兑，无穷无尽。');
INSERT INTO `big_yan` VALUES ('25481192-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 9, '凶', '大成之数', '大成之数，蕴涵凶险，或成或败，难以把握。');
INSERT INTO `big_yan` VALUES ('25494a0d-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 10, '凶', '终结之数', '终结之数，雪暗飘零，偶或有成，回顾茫然。');
INSERT INTO `big_yan` VALUES ('254cf384-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 11, '吉', '旱苗逢雨', '万物更新，调顺发达，恢弘泽世，繁荣富贵。');
INSERT INTO `big_yan` VALUES ('254f8c3a-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:19', '2018-01-05 10:57:19', NULL, 1, 12, '凶', '掘井无泉', '无理之数，发展薄弱，虽生不足，难酬志向。');
INSERT INTO `big_yan` VALUES ('25511237-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 13, '吉', '春日牡丹', '才艺多能，智谋奇略，忍柔当事，鸣奏大功。');
INSERT INTO `big_yan` VALUES ('25524abc-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 14, '凶', '破兆', '家庭缘薄，孤独遭难，谋事不达，悲惨不测。');
INSERT INTO `big_yan` VALUES ('2554e2de-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 15, '吉', '福寿', '福寿圆满，富贵荣誉，涵养雅量，德高望重。');
INSERT INTO `big_yan` VALUES ('25569094-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 16, '吉', '厚重', '厚重载德，安富尊荣，财官双美，功成名就。');
INSERT INTO `big_yan` VALUES ('2559ebfc-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 17, '半吉', '刚强', '权威刚强，突破万难，如能容忍，必获成功。');
INSERT INTO `big_yan` VALUES ('255c83f4-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 18, '半吉', '铁镜重磨', '权威显达，博得名利，且养柔德，功成名就。');
INSERT INTO `big_yan` VALUES ('25607b9a-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 19, '凶', '多难', '风云蔽日，辛苦重来，虽有智谋，万事挫折。');
INSERT INTO `big_yan` VALUES ('25627746-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 20, '凶', '屋下藏金', '非业破运，灾难重重，进退维谷，万事难成。');
INSERT INTO `big_yan` VALUES ('2564c152-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 21, '吉', '明月中天', '光风霁月，万物确立，官运亨通，大搏名利。女性不宜此数。');
INSERT INTO `big_yan` VALUES ('256620e0-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 22, '凶', '秋草逢霜', '秋草逢霜，困难疾弱，虽出豪杰，人生波折。');
INSERT INTO `big_yan` VALUES ('2567a783-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 23, '吉', '壮丽', '旭日东升，壮丽壮观，权威旺盛，功名荣达。女性不宜此数。');
INSERT INTO `big_yan` VALUES ('2568e008-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 24, '吉', '掘藏得金', '家门余庆，金钱丰盈，白手成家，财源广进。');
INSERT INTO `big_yan` VALUES ('2569a367-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 25, '半吉', '荣俊', '资性英敏，才能奇特，克服傲慢，尚可成功。');
INSERT INTO `big_yan` VALUES ('256ab4b9-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 26, '凶', '变怪', '变怪之谜，英雄豪杰，波澜重叠，而奏大功。');
INSERT INTO `big_yan` VALUES ('256bed37-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 27, '凶', '增长', '欲望无止，自我强烈，多受毁谤，尚可成功。');
INSERT INTO `big_yan` VALUES ('256d73dd-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 28, '凶', '阔水浮萍', '遭难之数，豪杰气概，四海漂泊，终世浮躁。女性不宜此数。');
INSERT INTO `big_yan` VALUES ('256fbdc6-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 29, '吉', '智谋', '智谋优秀，财力归集，名闻海内，成就大业。');
INSERT INTO `big_yan` VALUES ('2570cf34-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 30, '半吉', '非运', '沉浮不定，凶吉难变，若明若暗，大成大败。');
INSERT INTO `big_yan` VALUES ('25722ec9-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 31, '吉', '春日花开', '智勇得志，博得名利，统领众人，繁荣富贵。');
INSERT INTO `big_yan` VALUES ('25753c2d-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 32, '吉', '宝马金鞍', '侥幸多望，贵人得助，财帛如裕，繁荣至上。');
INSERT INTO `big_yan` VALUES ('2576c2a5-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 33, '吉', '旭日升天', '旭日升天，鸾凤相会，名闻天下，隆昌至极。女性不宜此数。');
INSERT INTO `big_yan` VALUES ('25795ab6-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 34, '凶', '破家', '破家之身，见识短小，辛苦遭逢，灾祸至极。');
INSERT INTO `big_yan` VALUES ('257ae166-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 35, '吉', '高楼望月', '温和平静，智达通畅，文昌技艺，奏功洋洋。');
INSERT INTO `big_yan` VALUES ('257d7965-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 36, '半吉', '波澜重叠', '波澜重叠，沉浮万状，侠肝义胆，舍己成仁。');
INSERT INTO `big_yan` VALUES ('258149f7-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 37, '吉', '猛虎出林', '权威显达，热诚忠信，宜着雅量，终身荣富。');
INSERT INTO `big_yan` VALUES ('25851a89-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 38, '半吉', '磨铁成针', '意志薄弱，刻意经营，才识不凡，技艺有成。');
INSERT INTO `big_yan` VALUES ('2586c83f-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 39, '半吉', '富贵荣华', '富贵荣华，财帛丰盈，暗藏险象，德泽四方。');
INSERT INTO `big_yan` VALUES ('258800b2-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 40, '凶', '退安', '智谋胆力，冒险投机，沉浮不定，退保平安。');
INSERT INTO `big_yan` VALUES ('25891224-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 41, '吉', '有德', '纯阳独秀，德高望重，和顺畅达，博得名利。此数为最大好运数。');
INSERT INTO `big_yan` VALUES ('258a98d8-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 42, '凶', '寒蝉在柳', '博识多能，精通世情，如能专心，尚可成功。');
INSERT INTO `big_yan` VALUES ('258da612-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 43, '凶', '散财破产', '散财破产，诸事不遂，虽有智谋，财来财去。');
INSERT INTO `big_yan` VALUES ('258ede9a-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 44, '凶', '烦闷', '破家亡身，暗藏惨淡，事不如意，乱世怪杰。');
INSERT INTO `big_yan` VALUES ('2591c4bd-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 45, '吉', '顺风', '新生泰和，顺风扬帆，智谋经纬，富贵繁荣。');
INSERT INTO `big_yan` VALUES ('25932452-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 46, '凶', '浪里淘金', '载宝沉舟，浪里淘金，大难尝尽，大功有成。');
INSERT INTO `big_yan` VALUES ('25945ce2-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 47, '吉', '点石成金', '花开之象，万事如意，祯祥吉庆，天赋幸福。');
INSERT INTO `big_yan` VALUES ('2595bc66-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 48, '吉', '古松立鹤', '智谋兼备，德量荣达，威望成师，洋洋大观。');
INSERT INTO `big_yan` VALUES ('2596f4e1-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 49, '半吉', '转变', '吉临则吉，凶来则凶，转凶为吉，配好三才。');
INSERT INTO `big_yan` VALUES ('25998cf5-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 50, '半吉', '小舟入海', '一成一败，吉凶参半，先得庇荫，后遭凄惨。');
INSERT INTO `big_yan` VALUES ('259aecb5-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 51, '半吉', '沉浮', '盛衰交加，波澜重叠，如能慎始，必获成功。');
INSERT INTO `big_yan` VALUES ('259bfdee-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 52, '吉', '达眼', '卓识达眼，先见之明，智谋超群，名利双收。');
INSERT INTO `big_yan` VALUES ('259d5d91-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 53, '凶', '曲卷难星', '外祥内患，外祸内安，先富后贫，先贫后富。');
INSERT INTO `big_yan` VALUES ('259ebd0e-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 54, '凶', '石上栽花', '石上栽花，难得有活，忧闷烦来，辛惨不绝。');
INSERT INTO `big_yan` VALUES ('259ff5da-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 55, '半吉', '善恶', '善善得恶，恶恶得善，吉到极限，反生凶险。');
INSERT INTO `big_yan` VALUES ('25a17c3d-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 56, '凶', '浪里行舟', '历尽艰辛，四周障碍，万事龃龌，做事难成。');
INSERT INTO `big_yan` VALUES ('25a23f8a-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 57, '吉', '日照春松', '寒雪青松，夜莺吟春，必遭一过，繁荣白事。');
INSERT INTO `big_yan` VALUES ('25a39f15-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 58, '半吉', '晚行遇月', '沉浮多端，先苦后甜，宽宏扬名，富贵繁荣。');
INSERT INTO `big_yan` VALUES ('25a54cc4-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 59, '凶', '寒蝉悲风', '寒蝉悲风，意志衰退，缺乏忍耐，苦难不休。');
INSERT INTO `big_yan` VALUES ('25a68538-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 60, '凶', '无谋', '无谋之人，漂泊不定，晦暝暗黑，动摇不安。');
INSERT INTO `big_yan` VALUES ('25a796b4-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 61, '吉', '牡丹芙蓉', '牡丹芙蓉，花开富贵，名利双收，定享天赋。');
INSERT INTO `big_yan` VALUES ('25a8a81b-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 62, '凶', '衰败', '衰败之象，内外不和，志望难达，灾祸频来。');
INSERT INTO `big_yan` VALUES ('25a96b69-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 63, '吉', '舟归平海', '富贵荣华，身心安泰，雨露惠泽，万事亨通。');
INSERT INTO `big_yan` VALUES ('25aaf629-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 64, '凶', '非命', '骨肉分离，孤独悲愁，难得心安，做事不成。');
INSERT INTO `big_yan` VALUES ('25ac0383-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 65, '吉', '巨流归海', '天长地久，家运隆昌，福寿绵长，事事成就。');
INSERT INTO `big_yan` VALUES ('25acee1d-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 66, '凶', '岩头步马', '进退维谷，艰难不堪，等待时机，一跃而起。');
INSERT INTO `big_yan` VALUES ('25af85e3-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 67, '吉', '顺风通达', '天赋幸运，四通八达，家道繁昌，富贵东来。');
INSERT INTO `big_yan` VALUES ('25b0975f-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 68, '吉', '顺风吹帆', '智虑周密，集众信达，发明能智，拓展昂进。');
INSERT INTO `big_yan` VALUES ('25b15ac6-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 69, '凶', '非业', '非业非力，精神迫滞，灾害交至，遍偿痛苦。');
INSERT INTO `big_yan` VALUES ('25b26c34-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 70, '凶', '残菊逢霜', '残菊逢霜，寂寞无碍，惨淡忧愁，晚景凄凉。');
INSERT INTO `big_yan` VALUES ('25b37d9b-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 71, '半吉', '石上金花', '石上金花，内心劳苦，贯彻始终，定可昌隆。');
INSERT INTO `big_yan` VALUES ('25b419c6-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 72, '半吉', '劳苦', '荣苦相伴，阴云覆月，外表吉祥，内实凶祸。');
INSERT INTO `big_yan` VALUES ('25b530e5-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 73, '半吉', '无勇', '盛衰交加，徒有高志，天王福祉，终世平安。');
INSERT INTO `big_yan` VALUES ('25b5ee9b-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 74, '凶', '残菊经霜', '残菊经霜，秋叶寂寞，无能无智，辛苦繁多。');
INSERT INTO `big_yan` VALUES ('25b7270e-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 75, '凶', '退守', '退守保吉，发迹甚迟，虽有吉象，无谋难成。');
INSERT INTO `big_yan` VALUES ('25b8fbce-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 76, '凶', '离散', '倾覆离散，骨肉分离，内外不和，虽劳无功。');
INSERT INTO `big_yan` VALUES ('25ba0d54-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 77, '半吉', '半吉', '家庭有悦，半吉半凶，能获援护，陷落不幸。');
INSERT INTO `big_yan` VALUES ('25bb45bd-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 78, '凶', '晚苦', '祸福参半，先天智能，中年发达，晚景困苦。');
INSERT INTO `big_yan` VALUES ('25bc3022-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 79, '凶', '云头望月', '云头望月，身疲力尽，穷迫不伸，精神不定。');
INSERT INTO `big_yan` VALUES ('25bd6899-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 80, '凶', '遁吉', '辛苦不绝，早入隐遁，安心立命，化凶转吉。');
INSERT INTO `big_yan` VALUES ('25be803e-f1c4-11e7-8f75-ce15fda84d48', '2018-01-05 10:57:20', '2018-01-05 10:57:20', NULL, 1, 81, '吉', '万物回春', '最吉之数，还本归元，吉祥重叠，富贵尊荣。');

SET FOREIGN_KEY_CHECKS = 1;
